{
    "index": 934,
    "text": "President Trump on Thursday reaffirmed his criticism of the Iran nuclear deal and pledged not to expand the United States’ role in Libya beyond fighting the Islamic State.\nAt a time when several of the president’s stances on foreign affairs appear to be shifting, the dual comments represent a fidelity with some of the national security positions Trump staked out during the campaign, many of which were aimed at projecting military strength through a buildup of the armed forces while promising a more limited U.S. role in foreign conflicts.\nSpeaking at a joint news conference with Italian Prime Minister Paolo Gentiloni, Trump bluntly declared that he saw “no role” for the United States in stabilizing Libya, except in fighting the Islamic State.\n“I do not see a role in Libya,” Trump said, just seconds after Gentiloni said his country hoped to see more U.S. engagement there. “I think the United States has right now enough roles. We’re in a role everywhere. So I do not see that.”\n“I do see a role in getting rid of ISIS. We’re being very effective in that regard,” he added.\n(The Washington Post)\nFor Italy, political instability and violence in Libya have led to a crisis of migrants seeking refuge on its shores, many of them dying on the perilous journey across the Mediterranean. Gentiloni on Thursday urged the United States to further help find a political solution in Libya.\n“A divided country and in conflict would make civility worse,” he said of Libya. “The U.S. role in this is very critical.”\nTrump also sharply denounced the 2015 Iran nuclear deal and promised to address it further in the “not-too-distant future.”\n“It was a terrible agreement. It shouldn’t have been signed,” Trump said. “They are not living up to the spirit of the agreement. I can tell you that.”\nThe comments underscored one part of Trump’s position on the deal during the campaign, but he notably did not reiterate his promise to rip it up immediately, a tacit acknowledgment that the administration does not yet have an alternative to the deal in place.\nThe meeting between Trump and Gentiloni comes weeks before Trump is set to travel to Europe on his first foreign trip as president. He will make a stop at the summit of leaders of the Group of Seven, which will be held in Sicily.\nGentiloni is one of several world leaders and close U.S. allies seeking to quickly establish a relationship with Trump and perhaps influence his young presidency.\nLike Trump, Gentiloni is new to his job, having taken power in December after former prime minister Matteo Renzi resigned after constitutional changes he backed failed in a referendum. While Renzi had a close relationship with President Barack Obama — and openly backed Democrat Hillary Clinton’s candidacy — Gentiloni and Trump come to their relationship without much baggage, potentially opening the door for warm relations.\nIn recent weeks, Trump has shifted on his strident criticism of NATO and said last week in a meeting with NATO Secretary General Jens Stoltenberg that the alliance was “no longer obsolete.”\n“The administration’s views of the European Union and the European project are a work in progress,” said Charles Kupchan, a senior fellow at the Council on Foreign Relations and a former director for European affairs at the National Security Council under Obama.\nTrump continues to pressure NATO members to contribute at least the agreed-upon 2 percent of gross domestic product to their own defense, but on Thursday he delivered a more muted warning to Italy.\n“As we reaffirm our support for historic institutions, we must also reaffirm the requirement that everyone must pay their full and fair share for the cost of defense,” Trump said.\nItaly, which has long been allied with the United States in military action in the Middle East and elsewhere, maintains that its contribution to NATO goes beyond its financial obligation and encompasses Italian military efforts in Iraq and Afghanistan and in the fight against the Islamic State. Italy does not yet devote 2 percent of its GDP to defense spending, but Gentiloni emphasized that Italy’s contribution is increasing.\n“We know that this will be a gradual process. . . . It has already begun,” Gentiloni said.\nDuring the campaign, Trump also voiced support for the Brexit campaign that resulted in Britain leaving the European Union. And in January, he declared that Brexit “is going to end up being a great thing.”\nAfter meeting with Gentiloni on Thursday, Trump appeared to affirm the United States’ commitment to Europe.\n“A strong Europe is very, very important to me as president of the United States,” Trump said. “And it’s also, in my opinion — in my very strong opinion, important for the United States.\n“We want to see it. We will help it be strong, and it’s very much to everybody’s advantage,” he added.",
    "label": 3
}