{
    "index": 484,
    "text": "How the latest Trump headlines played out in conservative, liberal media\nShow Caption Hide Caption National security adviser denies Trump shared intel President Trump's national security adviser says a Washington Post report that says Trump shared intelligence with Russia \"is false.\" USA TODAY\nA great deal has been written and said about the media divide in the United States — or how Americans tend to follow news organizations that reinforce their political beliefs — and that divide was clearly in evidence Monday in the wake of a Washington Post story alleging President Trump shared classified information with Russian diplomats during a meeting at the White House.\nFor example, a glance at the three major cable news networks at 8:20 p.m. ET revealed the following banners on the bottom of the screen:\nCNN — Wash Post: Trump shared highly classified info with Russians\nMSNBC — Dem congressman calls for impeaching Trump\nFox News — Liberals melting down & turning violent\nWhile CNN and MSNBC focused on the report from the Post and the reaction from Trump's opponents, Fox News focused on a perceived hysteria among liberals — a tactic the network also employed in the wake of the firing of former FBI director James Comey.\nJust under an hour later, Fox News ran a banner reading, \"McMaster: Washington Post story on Russia meeting is false,\" while CNN's banner read, \"Sources: Trump shared classified info with Russian foreign minister.\"\nOn the Fox News website, the top story at 9:30 p.m. ET was about Hillary Clinton and the launch of her \"Onward Together\" PAC. The story about Trump was programmed beneath that under the headline, \"'It didn't happen': WH denies report Trump revealed classified info.\"\nRead more:\nOn Breitbart, the top headline read \"Deep State Strikes: Leaks Classified Info To Washington Post To Smear Trump, LOL: Reporters Negate Oversold Headline In 7th Paragraph.\"\nThe \"deep state\" refers to a theory repeatedly propagated by Breitbart since Trump took office, which says a cadre of government officials loyal to former President Obama have been working behind the scenes to undermine Trump.\nThe 7th paragraph from the Post story that the Breitbart headline refers to reads, \"As president, Trump has broad authority to declassify government secrets, making it unlikely that his disclosures broke the law.\" The headline implies since the president did not break the law, the story is of little importance.\nRead more:\nThe second headline on Breitbart was, \"McMaster: WAPO Story 'False' — 'I Was In The Room, It Didn't Happen'.\" An accurate summation of the denial issued by Trump's national security adviser, Lt. Gen. H.R. McMaster.\nOn The Washington Times website, the top story was \"Officials dispute report Trump revealed classified information to Russians.\"\nBy contrast, CNN led — after obtaining their own unnamed sources — with a wide, banner headline reading, \"Sources: Trump shared classified info with Russians.\" Four other stories critical of the White House preceded a video of McMaster's denial.\nOn the Fox News show Hannity, host Sean Hannity opened by attacking the sources of the leaks to the Post.\n\"No White House can sustain these types of constant leaks,\" he said. \"So, if you're in the White House, and you're this, if you're not there to serve your country and all you're doing is hurting the country, well, then you might want to get out of the way.\"\nHannity proceeded to report on the Comey firing and \"the worst liberal media feeding frenzy in American history\" that followed. He went on to explain why he believes Comey deserved to be fired and why Clinton should have been prosecuted for her handling of classified material on a private email server.",
    "label": 2
}