{
    "index": 366,
    "text": "The Los Angeles County Board of Supervisors is expected to approve a motion Tuesday that would help foster children avoid having to switch schools when they move to a new home.\nThe motion would create a pilot program to provide transportation for the students to the schools they were attending before being moved.\nA federal law passed in 2015 requires that school districts and child welfare agencies collaborate in order to give foster youths stability at school.\n“Changing schools, along with changing homes, creates further upheaval for foster kids who have already experienced trauma and loss,” said Supervisor Kathryn Barger, who introduced the motion with Supervisor Mark Ridley-Thomas.\nDuring the fiscal year that ended June 30, about 8,000 school-age children in the Los Angeles County foster system experienced at least one move, said Deborah Silver, who oversees education at the Department of Children and Family Services.\nAdvertisement\nSuch moves set children back academically by as much as four to six months, according to some estimates. That’s because it can take time to enroll in a new school, records are often lost, classes may not transfer over, and testing and developing lesson plans for children with special needs isn’t always immediately available, Silver said.\nThe motion directs Children and Family Services, the L.A. County Office of Education and one or more school districts to sign an agreement to transport foster kids to and from school anywhere within L.A. County. Children and Family Services will contribute $300,000, the Office of Education $100,000 and Los Angeles Unified School District $100,000.\nThe pilot program will test such strategies as giving out Metro TAP cards, reimbursing caregivers, altering bus routes within districts and contracting a private car service.\nIf approved, the program will begin this month and continue through December.\nnina.agrawal@latimes.com\nTwitter: @AgrawalNina",
    "label": 2
}