{
    "index": 405,
    "text": "Imagine the world through President Trump's eyes — yearbook style\nHigh school never ends? That's the idea behind IJR's annual project, The Labrador, a \"yearbook\" that pokes fun at the White House and the reporters who cover it.\nIn the project's second year, the IJR staff and comedian Dave Jorgenson tried a different approach: What if the yearbook was owned by President Trump?\nThe result is a book filled with \"commentary\" that does sound like the president.\n\"Low energy,\" reads a note next to a reference to Jeb Bush, one of Trump's many rivals in the 2016 GOP primary).\nFlip through the pages to the \"Senior Class\" of White House correspondents, and you'll see drawings on the reporters and notes to some of their names. \"Failing\" is added next to Maggie Haberman's outlet, the New York Times, the president's favorite adjective for the publication.e\nA few pages later, in the \"Upper Classmen\" section, a star is drawn around a photo of Sean Hannity.\nAnd in advice for the \"incoming freshmen,\" a final point is added at the bottom of the list: \"Be nice to President Trump.\"\nThe IJR yearbook comes as part of the kickoff for a weekend of events surrounding the annual dinner for White House correspondents, including IJR's own Golden Age of Journalism pre-party on Thursday night. With heightened tensions between the Trump administration and the press — including Trump announcing he would not attend the dinner, and White House staff saying they wouldn't go in \"solidarity\" with the president — the weekend has been toned down from the celebrity-laden lavishness of recent years.\nEric Kuhn of Layer3 TV, which hosted the Bytes and Bylines opening party on Thursday, said that allowed the weekend to focus on journalism, something his event, which brings journalists and people from the tech industry together, has always strived to do.\n\"The ability to make this event about journalists and the future of journalism as journalism keeps on changing, the ability to allow all these journalists to interact with all these techies is really fun for us, and hopefully innovation will come out of that,\" he said.",
    "label": 3
}