{
    "index": 334,
    "text": "Agriculture Secretary Sonny Perdue said Monday that he would roll back part of former First Lady Michelle Obama’s healthy eating initiative: stricter nutritional standards for school lunches.\nPerdue, who became head of the agency last week, announced he would be relaxing guidelines and providing greater flexibility in nutrition requirements for schools’ meal programs.\n“This announcement is the result of years of feedback from students, schools and food service experts about the challenges they are facing in meeting the final regulations for school meals,” Perdue said during a visit to Catoctin Elementary School in Leesburg, Va.\n“If kids aren’t eating the food, and it’s ending up in the trash, they aren’t getting any nutrition — thus undermining the intent of the program,” said Perdue, who was accompanied by Sen. Pat Roberts (R-Kan.) and Patricia Montague of the School Nutrition Assn.\nUnder the changes to the federal nutrition standards, schools won’t have to cut salt in meals, states will be able to allow some schools to serve fewer whole grains, and schools will be allowed to serve 1% milk rather than only nonfat milk.\nAdvertisement\nAdvocates for change on school lunch nutrition have said it’s difficult to meet rules set under the Obama administration.\n“We have been wanting flexibility so that schools can serve meals that are both nutritious and palatable,” Montague said during Monday’s announcement. “We don’t want kids wasting their meals by throwing them away. Some of our schools are actually using that food waste as compost. That shouldn’t be happening.”\nThe Obama administration placed standards on school lunch nutrition in 2010 when it passed the Healthy, Hunger-Free Kids Act. During that time, Michelle Obama was seen by many as a leading advocate in the fight against childhood obesity. She started the Let’s Move! campaign, which sought to encourage children to take part in more physical activity and help provide healthier food options in schools in under-served communities.\nThe percentage of U.S. children with obesity has more than tripled since the 1970s, causing long-term physical and emotional distress for children, according to the Centers for Disease Control and Prevention.\nChildren with obesity are at higher risk for having asthma and Type 2 diabetes. Many are bullied and, as a result, are likely to suffer from depression and self-esteem issues.\nIn 2014, the standards were met with challenges in Congress led by the School Nutrition Assn., which has called the regulations too rigid, and House Republicans who supported the powerful lobbying group’s efforts.\nBut according to the Department of Agriculture, 97% of schools across the country are implementing the school nutrition standards set by the Healthy, Hunger-Free Kids Act.\nThe changes announced Monday are seen by some as undermining a bipartisan breakthrough.\n“Michelle Obama started a conversation with every mom and dad in America on what they were feeding their kids in a way that didn’t cast judgment,” said Scott Faber, senior vice president from the Environmental Working Group, which specializes in research and advocacy.\n“Nothing will change that legacy, but unfortunately today’s actions will delay and undermine Obama’s food policy legacy,” he said.\nPoliticians and public health advocates have also criticized the rollbacks.\nReps. Rosa DeLauro (D-Conn.) and Jim McGovern (D-Mass.) condemned the Trump administration’s change to nutrition standards for school meals across the country.\n“Just days into his new job as Secretary of USDA, Secretary Perdue has decided to put special interests ahead of the health of America’s children,” DeLauro said in a statement.\n“The USDA and President Trump have now decided to roll back much of the progress we have made in the fight against rates of childhood obesity and malnutrition,” DeLauro said. “This interim final rule by the USDA is a slippery slope that will completely undermine school breakfast and lunch programs and the USDA should immediately reverse course.”\nMcGovern said the country should build on the progress made rather than “turn our backs” on youths who rely on the meals.\n“This isn’t about flexibility; it’s about making kids less healthy,” McGovern said. “Just because President Trump thinks fast food is a balanced meal doesn’t mean we should lower our standards for our kids.”\nThe Alliance for a Healthier Generation has worked with more than 35,000 schools to reduce the prevalence of childhood obesity.\n“We would not lower standards for reading, writing and arithmetic just because students found them challenging subjects and we should not do it for school nutrition either,” Howell Wechsler, the organization’s chief executive, said in a statement.\nmelissa.etehad@latimes.com\nFollow me on Twitter: @melissaetehad\nALSO\nTrump’s frustration with budget compromise has him considering merits of a ‘shutdown’\nCongress is on track with sweeping spending deal, but not much else\nNEA budget poised to get a $2 million boost, leaving arts organizations hopeful",
    "label": 3
}