{
    "index": 326,
    "text": "Federal Reserve policymakers on Wednesday held a key interest rate steady, downplaying recent weak economic data and indicating they remained on track for two more rate hikes this year.\nCentral bank officials said a sharp slowdown in the pace of economic growth in the first quarter “was likely to be transitory” and that the fundamentals underpinning continued growth in consumer spending “remained solid” despite a first-quarter performance that was the worst in seven years.\nIn a policy statement following a two-day meeting, the Federal Open Market Committee highlighted what it called “solid” average gains in job growth in recent months, improved business investment and inflation running close to the central bank’s 2% annual target.\nCommittee members voted unanimously to hold the short-term federal funds rate, a key benchmark for consumer and business lending, to a target between 0.75% and 1%. The policy statement did not say anything about the timing of additional rate hikes, but that was a signal that Fed officials were sticking to the forecast at their last meeting, in March, for two more small rate hikes this year.\n“The Fed’s soothing words about the recent soft patch in the economic data signals they still believe gradual rate hikes are appropriate later this year,” said Chris Rupkey, chief financial economist at Mitsubishi UFG Financial Group in New York. He added that a June rate hike “is very much on the table.”\nAdvertisement\nAnalysts at Barclay’s Investment Bank agreed. They said in a research note that the Fed statement “lacked any tone of uncertainty over the state of the economy or hesitation over the path” for slowly raising rates.\n“We maintain our call for rate hikes in June and September,” Barclays said.\nAnalysts hadn’t expected a rate hike Wednesday after 0.25 percentage point hikes in March and December. But they had been hoping for some indication of a rate hike at the Fed’s next meeting in June.\nBefore the announcement, investors had put the odds of a rate hike on Wednesday at 5%, according to the FedWatch Tool by the CME Group futures exchange. The odds of a June rate hike were 67%.\nThe Fed’s meeting came amid continued uncertainty about Washington’s fiscal policies and recent signs of softness in the U.S. economy.\nThe nation’s total economic output, known as gross domestic product, expanded at its slowest pace in two years in the first quarter, the Commerce Department said last week.\nThe report showed the challenge facing President Trump as he pushes an ambitious but still vague tax cut plan that administration officials said would boost annual growth to a sustained 3% pace.\nThe U.S. economy hasn’t posted annual growth of 3% or more since 2006.\nThe 0.7% annual growth rate in the first three months of this year — down sharply from 2.1% in the fourth quarter of 2016 — was fueled by anemic consumer spending.\nAlthough consumer confidence is up since Trump’s election in November, consumer spending grew just 0.3% in the first quarter of the year. That was down from 3.5% the previous quarter.\nThe labor market also has shown signs of weakness.\nThe U.S. added just 98,000 net new jobs in March, the fewest in a year, although economists said weather was probably a factor. Fed policymakers said Wednesday that the labor market has “continued to strengthen” and indicated it viewed March’s lackluster job growth as an anomaly.\nOverall economic growth is expected to pick up this spring. A closely watched estimate from the Federal Reserve Bank of Atlanta is forecasting a 4.3% annual growth rate in the second quarter of this year.\njim.puzzanghera@latimes.com\nTwitter: @JimPuzzanghera\nUPDATES:\n12:45 p.m.: This article was updated with comments from Chris Rupkey of Mitsubishi UFG Financial Group and from Barclay’s Investment Bank.\nThis article originally was published at 11:30 a.m.",
    "label": 3
}