{
    "index": 300,
    "text": "Congress avoided a government shutdown Friday as President Trump marks his first 100 days in office, but failed to serve up a decisive legislative accomplishment for the White House as Republican leaders shelved another attempt to repeal and replace the Affordable Care Act.\nThe House approved a temporary spending bill, 382 to 30, providing a weeklong extension of federal funding as negotiators continue to hash out a broader deal to keep government running through the remainder of the fiscal year. The Senate unanimously followed, ahead of Friday’s midnight deadline when funding expires.\nThe final deal is expected to include a boost in military spending, though smaller than what Trump wanted, and other provisions, including continued federal assistance to prop up a pension fund for retired coal miners that both parties support. Talks will continue next week.\nTrump had orchestrated the 100-day spending showdown shortly after he won the election, insisting last year that Congress fund the government only through April 28 so he could put his stamp on federal spending after he took office.\nHowever, the president’s demands for funds to build a border wall with Mexico and his threat to withhold some payments for Obamacare fell by the wayside as even Republicans, who have the majority in the House and Senate, panned those initiatives.\nAdvertisement\nDemocrats also resisted Trump’s spending priorities. Because Republicans have stark divisions within their ranks over spending levels, they must rely on Democrats for passage of most measures to prevent shutdowns.\nTrump’s push for border wall funding was quickly rejected by Democrats.\n“Americans know that $50 billion, if that’s what the wall will cost, is far better spent laying broadband throughout America, rebuilding our roads and bridges, doing things that help Americans,” said Senate Minority Leader Charles E. Schumer (D-N.Y.) ”Thankfully, for the American people, the president failed.”\nDemocrats also are fighting other so-called policy riders that Republicans want to attach to the spending bill, including those related to abortion access, regulations on financial services professionals and one that would limit oversight of various flavors of electronic cigarettes, aides said.\nTrump balked at including funds for Puerto Rico, which is seeking federal aid for its struggling Medicaid program, but that money is likely now to be included in the final deal as talks continue.\nCongressional leaders hope to reach a consensus in the days ahead so they can avoid another standoff next week when the just-passed temporary funding for government operations will again expire on May 5.\nA late push to salvage the Republican promise of dismantling Obamacare also was delayed when it became clear there still were not enough votes of support from rank-and-file lawmakers, who are concerned their constituents will lose their health insurance.\nLawmakers left town for the weekend frustrated after making only halting progress on either issue.\nMajority Leader Kevin McCarthy said he expects the House to vote “as soon as possible” on the latest version of the Obamacare repeal. A vote last month was shelved amid similar dissent.\n“We’re close, but we have some work to do,” said a GOP leadership aide granted anonymity to discuss the ongoing situation.\nThe GOP healthcare bill continues to face stiff headwinds, particularly from centrist Republicans, after leaders embraced an amendment designed to appease the most conservative lawmakers.\nThe provision would allow states to waive many of the regulations Obamacare slapped on insurers, which are some of the most popular parts of the law, including mental health coverage, maternity coverage and a ban on charging higher rates for patients with preexisting conditions.\nWhile the changes generated new support from lawmakers in the conservative House Freedom Caucus, they are driving away others in more centrist districts, like Florida Rep. Mario Diaz-Balart, who is now leaning against the bill.\n“The proposed changes to this bill would leave too many of my constituents with preexisting conditions paying more for health insurance coverage, and too many of them will even be left without any coverage at all,” said Rep. Ileana Ros-Lehtinen (R-Fla.), who remains opposed.\nThe White House sent mixed signals. Trump wanted to move on to other issues after the March vote was abandoned, but then he made a push for this latest version. But it did not appear that administration officials were heavily engaged in arm-twisting or cajoling to round up votes this week.\nThere were hardly any visible signs of shuttle diplomacy between the White House and lawmakers on Capitol Hill as leaders struggled to find votes. GOP aides say they ended the week having made a net gain in votes, but still not enough for majority passage amid a wall of opposition from Democrats.\nlisa.mascaro@latimes.com\n@LisaMascaro\nALSO\nGOP shuts out doctors, experts, Democrats — pretty much everybody — as they work on Obamacare repeal\nTrump wants a border wall, but few in Congress want to pay for it\nTrump’s election has mobilized a resistance like no other, but will Democrats’ answer to the tea party divide the ranks?\nMore coverage of Congress\nMore coverage of politics and the White House\nUPDATES:\n2:25 p.m.: This article was updated with additional reaction.\n9 a.m.: This article was updated after the Senate vote.\nThis article was originally published at 8:30 a.m.",
    "label": 3
}