{
    "index": 164,
    "text": "Trump tweets threat at former FBI director to not talk to press\nLYNCHBURG, Va. -- President Trump has been politically bruised after a remarkable week in which his administration struggled to explain why former FBI Director James Comey was fired.\nBut in making his case on TV and on Twitter Friday, the president appears to have opened new, self-inflicted wounds.\nMr. Trump suggested in a Friday tweet that he may possess \"tapes\" of a conversation with Comey.\nBut Mr. Trump told Fox News he would not discuss the possibility his conversations with Comey may have been recorded.\n\"Well, that I can't talk about. I won't talk about that,\" he told host Jeanine Pirro in an interview set to air Saturday night. \"All I want is for Comey to be honest. And I hope he will be. I'm sure he will be. I hope.\"\nTop Democrats on the House oversight and judiciary committees are now requesting copies of \"all recordings in possession of the White House\" in a letter sent to the White House counsel.\nLike many Democrats, Sen. Tim Kaine of Virginia is suspicious of the motivation behind Comey's firing.\n\"President Trump has fired this guy because the dragnet is tightening on the Russia investigation,\" Kaine said, referring to the FBI's probe into possible collusion between the Trump campaign and Russia.\nBut the White House originally claimed Comey was fired over his handling of the investigation into Hillary Clinton's emails. The president criticized Comey's decision not to recommend charges against Clinton in an interview with NBC News.\n\"What happened, he had a lot of pressure put on and he exonerated her. Should have never exonerated her,\" he told Lester Holt.\nMr. Trump also disputes reports that he asked Comey for his loyalty during a dinner in January. Comey told associates he declined the president's request, saying instead he would always be honest.\nMr. Trump denied asking for a loyalty pledge when asked by Fox News.\n\"No, no I didn't, but I don't think it would be a bad question to ask,\" he said. \"I think loyalty to the country, loyalty to the United States is important. You know, I mean, it depends on how you define loyalty, number one. Number two, I don't know how that got there, because I didn't ask that question.\"\nThe shifting explanations from the White House for Comey's firing led the president to suggest getting rid of press briefings all together.\n\"We just don't have them. Unless I have them every two weeks and do it myself. We don't have them,\" he told Fox.\nThe president said he was considering scrapping the daily briefing because of what he called unfair hostility toward his spokespeople, like press secretary Sean Spicer.\n\"I think [Mr. Trump] is a little dismayed, as well as a lot of people, that we come out here and try to do everything we can to provide you and the American people with what he's doing on their behalf,\" Spicer said at Friday's press briefing.\nOn Saturday, the president will try to put the tumultuous week behind him, delivering the commencement address at Liberty University in Lynchburg, Virginia.",
    "label": 2
}