{
    "index": 208,
    "text": "Washington (CNN) President Donald Trump and his top advisers' frustrations with Democrats' victory lap over the budget negotiations spilled over into the White House briefing room Tuesday as two Cabinet-level officials took to the podium.\nHomeland Security Secretary John Kelly and Office of Management and Budget Director Mick Mulvaney made the White House's most forceful case yet that the bipartisan budget deal amounted to a major win for the White House and a loss for Democrats.\nOne senior administration official said Trump was \"not happy\" as he watched Democrats claim victory in the budget negotiations, and a second senior administration official said Trump was baffled that Democrats felt they could claim victory.\n\"Democrats misrepresented reality,\" claimed one senior administration official.\nThat prompted the White House to send Kelly and Mulvaney out to push back on Democrats' messaging.\nThe two leaned on the fact that the budget deal will deliver a multi-billion dollar boost to the Pentagon and border security, which they said would be used to rebuild existing fencing into a steel wall on parts of the border.\nDemocrats, though, had made that case that the deal amounted to a victory for their priorities.\nThe budget deal will not provide any money for Trump's promised border wall with Mexico or deliver the funding cuts to sanctuary cities that Trump had threatened. There are also no cuts to funding for Planned Parenthood or the $18 billion in cuts to nondefense spending that Trump had requested in his budget proposal.\nInstead, funding for the National Institute of Health is increased by $2 billion, despite Trump's budget plan calling for cuts to the program, and the bill will also deliver money for clean energy and science funding.\nAs Democrats' claimed victory, Trump tweeted Tuesday morning to express his frustrations, claiming he might be willing to allow the government to shutdown during the next round of budget negotiations in September.\nThe reason for the plan negotiated between the Republicans and Democrats is that we need 60 votes in the Senate which are not there! We.... — Donald J. Trump (@realDonaldTrump) May 2, 2017\neither elect more Republican Senators in 2018 or change the rules now to 51%. Our country needs a good \"shutdown\" in September to fix mess! — Donald J. Trump (@realDonaldTrump) May 2, 2017\n\"I think the President is frustrated with the fact that he negotiated in good faith with the Democrats and they went out to try and spike the football and make him look bad,\" Mulvaney said, explaining Trump's tweet. \"I think what you heard this morning was his sense of frustration over how he's getting mistreated by the Democrats on this bipartisan piece of legislation.\"\n\"They're walking around trying to make it look like they pulled one over fast on the President. I just won't stand for it, because it's not true,\" he said.\nMulvaney ticked off what he claimed were White House wins in the budget deal -- from reinstating a school choice program in Washington to funding for border security. Kelly, meanwhile, condemned Democrats for being pleased with their blocking of border wall funding.\n\"They're rejoicing in the fact that that wall will be slower to be built and consequently our southwest border under less control than it could be,\" Kelly said.\nThe two senior administration officials who spoke to CNN on Tuesday said Trump and Kelly had planned to address Democratic claims head on at the signing of the omnibus bill -- particularly with regard to the border wall -- but some of Trump's senior advisers outside the communications shop pushed for Mulvaney and Kelly to make the case Tuesday instead.\nThe White House's boiling frustrations with Democrats' claims was apparent in the last 24 hours.\nMulvaney rounded up reporters in the briefing room on short notice late Monday afternoon and then again during a brief phone call with reporters Tuesday morning.\nAfter Trump lodged some of his complaints on Twitter and in the Rose Garden late Tuesday morning, Mulvaney and Kelly were dispatched to the briefing room in lieu of White House press secretary Sean Spicer.",
    "label": 2
}