{
    "index": 444,
    "text": "What health insurance covers could change dramatically if AHCA becomes law\nShow Caption Hide Caption Obamacare repeal passes in U.S. House: 217 yea, 213 nay House Republicans have passed legislation to repeal and replace the Affordable Care Act. USA TODAY\nThursday's vote in the House to repeal the Affordable Care Act means people who get health insurance through their employers could also wind up with lifetime limits on their coverage and plans that don't cover benefits such as mental health or maternity care, just as it will be for those who buy their own insurance on the exchanges.\nThe ACA prohibited annual and lifetime limits on insurance coverage, just as it established a set of essential benefits that all insurance plans must cover. These include preventive care, such as mammograms, as well as benefits for hospitalization and substance use disorder.\nProvisions in the replacement legislation, the American Health Care Act, don't specifically mention employer-provided \"essential health benefits,\" but Brookings Institution fellow Matthew Fiedler says it could have a big effect on those who get insurance through their jobs. Once states can determine what benefits insurance plans must cover, large employers could move to slash coverage based on whatever states set as a benchmark plan.\nThe two major affected protections are the ACA’s ban on annual and lifetime limits, as well as the law's requirement that insurance plans cap people's annual out-of-pocket spending.\n\"Both of these provisions aim to ensure that seriously ill people can access needed health care services while continuing to meet their other financial needs,\" Fiedler wrote.\nThis does pose a significant risk, says Kaiser Family Foundation's Larry Levitt, as nearly 60% of employer plans had lifetime limits on coverage before the ACA.\nIn a conservative state, regulators could also \"just get rid of (essential health benefits) altogether and leave up to insurers what to cover,\" says Levitt. \"That would be the easiest political decision.\"\nIt's not clear at all whether insurers would offer optional maternity coverage at an affordable price, says Levitt. Women past childbearing age often complained about high premiums on plans they said covered things like maternity care they didn't need.\nRead more:\nBig companies heralded the AHCA's passage because they \"will continue to have the ability to operate, improve, and innovate,” as Annette Guarisco Fildes, CEO of the ERISA Industry Committee (ERIC), said in a statement.\nERIC. which represents the largest U.S. employers, noted that Health Savings Account contribution limits were increased to match annual maximum out-of-pocket costs.\nWhile most large plans had limits on coverage before the ACA, ERIC's James Gelfand says that when an employee got near it, \"the plan tended to change it or accommodate.\"\n\"We want them to be healthy and taken care of,\" says Gelfand, ERIC's senior vice president for health policy. \"This is a very different motivation than some of the actors in the individual and fully insured market.\"\nAdams Dudley, a physician and director of the Center for Healthcare Value, says when insurance didn't cover all of the essential health benefits it wasn't actually \"real insurance.\"\nBefore the ACA, insurers \"could write into the fine print that weren’t covered and there were caps on those things — sometimes with very Draconian results.\"",
    "label": 3
}