{
    "index": 348,
    "text": "A top Obama administration Justice Department official will testify to Congress for the first time Monday about the most explosive contacts to emerge so far between President Trump’s former top aides and senior Russian officials, the focus of several investigations on Capitol Hill.\nSally Yates, deputy attorney general under President Obama, is expected to disclose details to a Senate Judiciary Committee panel about her warnings to White House officials in January that Trump’s national security advisor, retired Lt. Gen. Michael Flynn, had misled Vice President Mike Pence and other officials about his conversations with Russian Ambassador Sergey Kislyak.\nFlynn was fired 18 days after Yates went to the White House, and only after news stories revealed the existence of a transcript of Flynn’s telephone conversation with Kislyak, which was recorded as part of routine U.S. intelligence monitoring of foreign officials’ communications.\nYates, a former U.S. attorney who became deputy attorney general in 2015, took over the Justice Department as acting attorney general after Trump was inaugurated Jan. 20 while he prepared his own team.\nShe was fired 10 days later after she announced that under her leadership, the Justice Department would not defend Trump’s executive order seeking to bar travel to the U.S. from select Muslim-majority nations.\nAdvertisement\nYates’ attorney did not return messages Friday seeking comment about her upcoming testimony. James R. Clapper, the director of national intelligence during the Obama administration, is also scheduled to testify at the same hearing.\nLawmakers from both parties are likely to press Yates for details about her warnings to the White House that Flynn’s misrepresentations to Pence, and to the public, about his conversations with Kislyak left him vulnerable to blackmail by Moscow.\nThe FBI director, James B. Comey, recently told a judiciary subcommittee that Yates had spoken to him about her “concerns that Gen. Flynn had been compromised.”\nFlynn and Kislyak exchanged phone calls and text messages during the White House transition, and were in touch on Dec. 29, the day the Obama administration levied a range of sanctions against Moscow for meddling in the 2016 election.\nAfter leaks revealed those contacts, Flynn and other Trump administration officials, including Pence, denied that Flynn and Kislyak had discussed easing the sanctions. Doing so might violate the Logan Act, a 1799 law prohibiting private citizens from negotiating with foreign governments.\nThose denials unraveled in mid-February after news stories revealed the existence of a transcript of Flynn’s conversations with Kislyak, and Flynn was forced to resign.\nYates was supposed to testify last month to the House Intelligence Committee, but the appearance was canceled by Rep. Devin Nunes, the chairman. Nunes later recused himself from the panel’s Russia inquiry after the House Ethics Committee announced it was investigating whether the Tulare Republican had wrongly disclosed classified information amid his claims that U.S. surveillance under Obama had deliberately targeted Trump’s aides.\nThe Senate Intelligence Committee, which is conducting a parallel investigation, sent a letter to several members of Trump’s former campaign team last month seeking details of their contacts and financial ties with Russian authorities.\nIn addition to Flynn, those who received the letters are Roger Stone, an informal advisor to Trump; Paul Manafort, the former Trump campaign chairman; and Carter Page, an energy trader and former foreign policy advisor to the campaign.\nThe FBI opened a counter-intelligence investigation last July after learning of Page’s business relationships in Russia and his ties to officials in President Vladimir Putin’s government in Moscow.\nThe FBI inquiry has expanded to determine whether any of Trump’s current or former aides improperly coordinated with Russian intelligence services to interfere with the 2016 campaign.\nIn a letter dated April 28, the Senate committee asked Page to supply a list of “all meetings between you and any Russian official or representative of Russian business interests” from 2015 to 2017, according to a copy of the letter that Page provided to the Los Angeles Times.\nIt asked him to provide the list and any notes he took at those meetings by Tuesday.\nThe letter also asked Page to provide details of any meetings with Russians by other Trump associates, and their “financial and real estate holdings” in Russia. It set a deadline of May 19 for that information.\nIn a return letter, Page denounced the committee request as a “witch hunt.”\nHe demanded that the Senate panel give him all U.S. government documents it possessed, including classified material, about his Russian investments, meetings and other connections before he would provide any documents in return.\nOn Friday, Sen. Richard M. Burr (R-N.C.), the committee chairman, and Sen. Mark R. Warner (D-Va.), the panel’s ranking member, warned Page against backing away from his promise to cooperate in the investigation, although they stopped short of threatening specific action.\nIf Page fails to meet the deadlines, “the Committee will consider its next steps at that time,” the two leaders said in a statement.\nALSO\nMcManus: Is the GOP getting serious about the Russia investigation?\nPresident Trump has backed off many of his provocative foreign policy promises\nLawmakers say Flynn did not disclose lobbying and payments from Turkey and Russia",
    "label": 3
}