{
    "index": 481,
    "text": "Little-known Mo. House member ends up in middle of health care debate\nWASHINGTON — Rep. Billy Long is not a part of the House Republican leadership, nor is he a committee chairman. He’s not one of the hard-charging, ultra-conservative Freedom Caucus members, nor is he part of the GOP’s pivotal moderate faction.\nSo how did the former auctioneer from southwest Missouri end up at the center of the legislative battle over replacing Obamacare and help get the president’s top priority through the House?\nIt all started with a tweet, as so many things in Washington do these days.\n“BREAKING: Rep. Billy Long (R-Mo.) tells me he's a NO on new GOP health bill! Brings to 22 the number of NO votes,” tweeted Scott Wong, a Capitol Hill reporter with The Hill newspaper.\nThose 93 characters ricocheted around Washington — and landed with a thud at the White House. Republicans had already suffered an embarrassing setback in March when they failed to secure enough votes from their own ranks for passage of their first proposal to unravel the Affordable Care Act. The Long tweet came as GOP leaders were trying to round up votes for a new bill — one that included a delicate set of revisions designed to appease both the hardline conservatives and wavering moderates.\n“Billy's against me?” Trump reportedly said when informed of the development. “Billy was on the campaign!”\nLong, of Springfield, had supported every previous version of the GOP’s push to repeal and replace Obamacare.\nSo the news that he was not going to go along with the new plan was a shocker. And it signaled that GOP leaders were in a deeper hole on “yes” votes than they may have realized.\nAt issue for Long: Obamacare’s provision banning insurance companies from discriminating against patients with pre-existing conditions by denying them coverage or charging them exorbitant premiums. Under the GOP’s new bill, states could seek a waiver from that requirement, thus letting insurance companies charge higher premiums to some consumers with existing health conditions — anything from asthma to cancer to pregnancy.\nThe exemption would only apply to those buying coverage in the individual market, but critics said it would gut the protections for sick patients, one of the most popular provisions in that 2010 law. Long had campaigned on a promise to repeal the ACA, but, like other Republicans, he’d also said he wanted to keep that protection in place.\nLong had privately told his staff he would oppose the new measure, but he had not publicly announced his position. That changed on Monday, when Wong caught the congressman in the hallway and asked him how he planned to vote.\nWithin a few hours, Long’s cell phone buzzed; it was the president.\n\"'Billy, really need you. We need you man,” Long recounted later of his conversation with Trump. “’I said, ‘You don’t have me.'”\nMore than 1,000 miles away, the phone was also ringing in Long’s Springfield office. “Royce, New York Times on the phone for you.”\nRoyce Reding is Long’s district director, and he’s been with the congressman since his first 2010 campaign for Congress. In the seven years since, Long had only been on national TV a few times, including an appearance after the 2011 Joplin tornado ravaged parts of the 7th congressional district.\n“Oh my word,” Reding thought as media requests rolled in fast and furious. “We’re not used to that type of attention pouring in.”\nThe congressman has never had his name on an amendment that helped push such a major piece of legislation across the finish line in the House. “For Billy, this was the biggest legislative battle he has fought in his career,” said Reding.\nAlong with the media spotlight came the fury of angry conservatives, who blasted Long for supporting a repeal of the ACA when Obama was still in office and he knew the president would veto it.\n“… Now, when it counts, and President Trump is ready to sign the bill, Billy has flip-flopped to defend Obamacare,” the president of the Club for Growth, an influential conservative group, said in a blistering statement on Tuesday.\nRead more:\nLong has not publicly explained why he supported the previous bills to kill the ACA — including the law’s pre-existing conditions protections — but could not bring himself to support this one. But Reding said that Long grew concerned after analyzing the bill that it would leave some sick people in the lurch.\n“That was enough for Billy to stand back, put his heels in the ground, and say, ‘I’m a no on this,’” Reding said.\nLong’s daughter, now 28, was treated for Hodgkin’s lymphoma in 2015. Reding said that experience “personalized” the debate for him, but it was not a driving factor in his objection to the GOP bill.\n“It made it real,” Reding said. “He could understand people’s plights (because) he’s lived it. But long before his daughter’s illness, he had promised to protect pre-existing conditions.”\nAs Long dug in, another influential GOP lawmaker, Rep. Fred Upton from Michigan, also came out against the bill on Tuesday — expressing the same concerns about pre-existing conditions. As pressure from the White House ratcheted up, Upton and Long started quietly discussing a legislative fix: adding $8 billion over five years to the underlying bill, aimed at helping those patients who would be hit with higher premiums and out-of-pocket costs.\nTrump called both Upton and Long on Tuesday, pushing them in separate conversations to change their minds. Both said no, unless the White House agreed to their new language.\n“He got a little angry, but I have a thick skin,” Upton recounted. “It was, you know, give and take.”\nThe White House declined to talk about the president’s conversations with the two congressmen. But Trump’s call to Long was even testier, according to Reding.\n“Let us talk to you about this amendment I have, and I think we can work something out,” Long said to the president. “The president said, ‘No, I’m not doing that. We’re not changing it,'\" said Reding, adding that the call ended abruptly.\nIf the White House didn’t want yet another tweak to the bill, it’s no wonder. It was already a carefully negotiated compromise. Any new provision — especially one with an $8 billion price tag — could drive away conservatives in the Freedom Caucus and torpedo the bill again.\nBut Trump’s hard line softened after Republican leaders told the White House they would not have enough votes to pass the bill without Upton and Long on board. By Tuesday night, the two congressmen had an appointment at the White House for the next morning.\nOn Wednesday morning, the small House GOP contingent met with Trump and other top White House officials for about an hour. When Long, Upton and others emerged from the West Wing, they were met by a phalanx of reporters with television cameras rolling and microphones out.\n\"With this addition that we brought to the president and sold him on,\" Long said, he and Upton had moved to the \"yes\" column.\n“The guy that sealed the deal?” Upton told reporters. “Billy Long.”\nWhether the deal was a good one is a point of sharp debate. Health care experts say $8 billion over five years is not nearly enough to cover the potential health care costs of millions of people with serious illnesses. Patient and physician groups strongly opposed the final bill, and so did 20 Republican House members, most of them moderates.\nRep. Charlie Dent, R-Penn., called the bill \"haphazardly constructed and hastily considered.\" He predicted it would \"increase health insurance costs — particularly for low-to-moderate income Americans, increase the number of uninsured by up to as many as 24 million people, and undermine important protections for those living with pre-existing conditions.\"\nLong and Upton said they were confident the $8 billion would be plenty. No one knows how many states will seek a waiver, they noted. And under the GOP bill, residents of those states will not be subject to higher premiums as long as they maintain “continuous” coverage, with no gaps. Long said those with pre-existing conditions \"need to be covered, period.\"\nAs the bill headed for House passage, Long seemed surprised at his role and ready to retreat from the limelight. He noted that he has never joined any of the ideological caucus in the House, saying “I don’t like that group-think thing.”\n“I’m a member of the Show-Me caucus, just one guy,” Long said.",
    "label": 3
}