{
    "index": 244,
    "text": "Washington (CNN) Just hours after House Republicans managed to pass a bill to repeal and replace Obamacare, the Senate is signaling it will write its own proposal -- announcing a group of 13 Republican members who will be responsible for crafting the Senate's plan.\nAll are male.\nSenators in the group include Finance Committee Chairman Orrin Hatch, Health and Education Committee Chairman Lamar Alexander and conservatives Ted Cruz and Mike Lee.\nA GOP aide defended the makeup of the group.\n\"We have no interest in playing the games of identity politics, that's not what this is about; it's about getting a job done,\" the aide said. \"We'll work with any member of any background who wants to pass a health reform bill that will reduce premiums and take away the burdens that Obamacare inflicted.\n\"To reduce this to gender, race or geography misses the more important point of the diverse segments of the conference the group represents on policy -- from members who support Medicaid expansion, to those opposed to it, to those who have called for long term full repeal,\" the aide added.\nThe announcement of the health care working group is yet another signal that the bill passed out of the House is merely a starting point for Senate Republicans, who have been saying for months that they had serious concerns about the House's efforts to repeal Obamacare ranging from how the House bill dealt with Medicaid to how it handled people with pre-existing conditions.\nEven as the legislation was passing on the House floor, Senate Republicans were admonishing the House's efforts.\n\"A bill -- finalized yesterday, has not been scored, amendments not allowed, and 3 hours final debate -- should be viewed with caution,\" tweeted South Carolina Sen. Lindsey Graham\nHere are the group of 13 Republicans who will work to build the Senate's bill:\nMembers of Senate leadership\nMajority Leader Mitch McConnell of Kentucky\nSen. John Cornyn of Texas\nSen. John Thune of South Dakota\nSen. John Barrasso of Wyoming\nCommittee chairmen\nHELP Chairman Lamar Alexander of Tennessee\nBudget Chairman Mike Enzi of Wyoming\nFinance Chairman Orrin Hatch of Utah\nConservatives\nSen. Ted Cruz of Texas\nSen. Mike Lee of Utah\nSen. Tom Cotton of Arkansas\nModerate-leaning\nSen. Cory Gardner of Colorado\nSen. Rob Portman of Ohio\nSen. Pat Toomey of Pennsylvania\nThis story has been updated.",
    "label": 3
}