{
    "index": 667,
    "text": "NEW You can now listen to Fox News articles!\nThe chairman of the Senate Judiciary Committee is poking around for more information on the spurious dossier leaked to the media ahead of President Trump’s inauguration – this time, homing in on Andrew McCabe, the second in command at the FBI.\nIn a March 28 letter, Sen. Charles Grassley, R-Iowa, told FBI Director James Comey he wants a detailed description on the involvement of Deputy Director McCabe in the investigation of Russian ties to Trump associates.\nGrassley also wants to know whether McCabe’s involvement in the probe “raises the appearance a conflict of interest in light of his wife’s ties with Clinton’s associates” and whether it would merit McCabe recusing himself from the investigation.\nGrassley was referring to McCabe’s wife having accepted $700,000 in political contributions facilitated by Hillary Clinton ally Terry McAuliffe, the Virginia governor, for her state Senate run.\nAs reported by The Washington Examiner, Grassley noted McCabe already is being looked at by the inspector general for his involvement in the Clinton email investigation, despite his wife's ties.\nThe Senate committee’s probe began March 6.\nGiven the latest letter, the panel appears to be looking to see whether McCabe faces similar conflict of interest concerns on Trump matters.\nGrassley asked Comey for answers to 12 detailed questions into McCabe, including whether “anyone within the FBI filed a complaint with the Department of Justice Office of the Inspector General regarding Mr. McCabe’s involvement in the investigation?” and whether anyone from the DOJ or the Inspector General had raised concerns “as to whether Mr.McCabe’s alleged partisan conflict would also apply to the investigation of Mr. Trump’s associates?”\nThe Senate Judiciary Committee is, more broadly, investigating whether the FBI wrongly included political opposition research from Trump’s opponents in its probe, and then paid the author of that controversial dossier, a former British spy, to work for the FBI on its investigation.\nMcCabe has periodically faced scrutiny for his family ties to the Clinton world.\nFox News reported last month that McCabe did not list his wife's 2015 donations or his wife’s salary in financial disclosure forms -- though such disclosure was not technically required.\nGrassley, in his recent letter, revived concerns about McCabe's involvement in the Clinton email case.\n“While Mr. McCabe recused himself from public corruption cases in Virginia – presumably including the reportedly ongoing investigation of Mr. McAuliffe regarding illegal campaign contributions – he failed to recuse himself from the Clinton email investigation, despite the appearance of a conflict created by his wife’s campaign accepting $700,000 from a close Clinton associate during the investigation.”",
    "label": 2
}