{
    "index": 211,
    "text": "Washington (CNN) Legal issues are now the sticking point in Trump administration discussions over whether to withdraw from the Paris climate accord, according to a person close to the talks.\nThe hang-up: Administration lawyers aren't sure whether the US would expose itself legally if it remains in the Paris agreement, but decreases the carbon reduction goals which comprise its commitment to the pact.\nTrump has already ordered his Environmental Protection Agency to review the Clean Power Plan, which was the lynchpin in the commitment President Barack Obama made in 2015 to reduce US carbon emissions by 26-28% by 2025. The administration is expected to make major alterations to the Obama-era rules which would have reduced carbon emissions.\nWhite House counsel Don McGhan raised the legal concern during last Thursday's meeting of top West Wing advisers, which included senior advisers Ivanka Trump and Jared Kushner, chief strategist Steve Bannon, EPA administrator Scott Pruitt and Energy Secretary Rick Perry.\nAfter Thursday's meeting, a senior White House official said the complex nature of the agreement has surprised some advisers inside the administration. There was no agreement inside the administration on the basic facts of the Paris climate accord, the official said, saying a final decision wouldn't be presented to Trump until some agreement on those facts are resolved.\nA second meeting focused specifically on the legal concerns was held Monday, according to the person close to the talks.\nThe sticky legal situation has led to further doubts that Trump will remain in the agreement, at least as it currently stands.\nThe possibility of \"renegotiating\" the US pledge to the agreement had emerged as a leading possibility. But the legal issues surrounding that option are now in question.\nThe debate over whether to withdraw from the Paris agreement has divided Trump's advisers. Bannon has encouraged Trump to follow through on his campaign trail promises to remove the US from the plan. He's supported by Pruitt, who told \"Fox & Friends\" last month that he would advise the President to exit the pact.\nBut opposing voices, including those of Kushner and Ivanka Trump, have grown more influential in shaping Trump's decisions in recent weeks. Top Cabinet officials have also spoken against removing the US from the deal, citing the negative effect such a move would have on US diplomatic relationships and global standing.\nAhead of last week's meeting, a third person close to the talks characterized the debate as going beyond merely a policy dispute over the deal's carbon reduction targets. Instead, aides are weighing the repercussions of removing the US from a pact that almost every country in the world signed onto in 2015.\n\"The Paris accord is quite complicated,\" this person said, speaking on condition of anonymity to discuss internal deliberations. \"When the United States is in something, you've got to be very thoughtful and reflective about how you do it. There are so many moving pieces to Paris.\"\nOfficials declined to speculate any further when the White House would announce a final decision, beyond saying Trump is still planning to announce a decision before the G7 in May.\nBut environmental groups were already raising the alarm at any potential changes to the US pledge toward reducing its carbon emissions.\n\"Using the flexibility of the Paris Agreement to reduce our commitment, or even going so far as to pull us out, would be a disaster for the United States because it would provoke international blowback, harm our global leadership role, and threaten the health and safety of all families in this country,\" said Sierra Club Global Climate Policy Director John Coequyt.",
    "label": 3
}