{
    "index": 183,
    "text": "Former Secretary of Defense Robert Gates, who served under Presidents George W. Bush and Barack Obama, said that he's confident Trump cabinet members have the ability to lend advice, concerns and criticism to President Donald Trump.\nIn an interview for \"Face the Nation\" on Sunday, Gates told John Dickerson that correcting the president when he's \"heading down the wrong path\" requires \"a certain tactical skill,\" and current Trump cabinet members like Homeland Security Secretary John Kelly, Defense Secretary James Mattis and Secretary of State Rex Tillerson have it.\n\"I still have confidence that the people that I know personally, people like Kelly and Mattis and Tillerson, are the kind of people who will tell the president if he's [Mr. Trump] headed down the wrong path,\" Gates said. \"You know, there are a lot of different ways to do this with a boss. I mean, you don't walk in and say, 'That's the dumbest thing you've ever done, or at least this week.' But it's another to say, 'You know, there's a different way to do this that might come out better.'\"\nGates also opened up about his many disagreements with Mr. Obama in his first term as president.\n\"I had some significant disagreements at various times with President Obama over the defense budget, over how we would get rid of 'Don't Ask, Don't Tell,' and so on,\" he said. \"And we would go at it sometimes in the Oval Office, in private. But at the end, more often than not, he would stand up and smile and say, 'You sure I can't get you to stay for another year?'\"\nHowever, there's a certain risk to such candor, Gates admitted.\n\"In any setting, let's be honest, most bosses say, 'I want your candor. I want you to tell me when you think I'm doing something wrong,' until you do. And then a lot of people have found out, 'Well, maybe they didn't want that candor after all.' And have found themselves out on the street,\" he said.\nThe key for White House advisers, Gates recommended, is figuring out how blunt to be with a president on a selective case-by-case basis.\n\"You have to be judicious about it,\" Gates said.\nHe elaborated: \"If you're going in carping at your boss every day, you're probably not going to last very long. But I think on the big things, that's where it's important to tell yourself, 'This is important for this person. It's important for the country. And I owe it to them to disagree.'\"",
    "label": 2
}