{
    "index": 28,
    "text": "— -- President Donald Trump clearly sees himself in former President Andrew Jackson. From Jackson’s populist appeal to his “nasty” campaign style, Trump has consistently argued it’s an apt comparison -- and Steve Inskeep says, “There’s something to it.”\nInskeep is the host NPR’s \"Morning Edition\" and the author of “Jacksonland,” a history of Jackson’s presidency. He said that in addition to some obvious parallels between the two presidents, they have one overlooked similarity -- they both used their celebrity to reach the White House.\n“His reality show was the War of 1812 basically,” Inskeep told ABC News' Jonathan Karl and Rick Klein on the \"Powerhouse Politics\" podcast. “He was incredibly famous and he exploited, extended, took advantage of his fame.”\nInskeep said Jackson emerged from the War of 1812 with such a surprising victory that he was seen “as a man who had God on his side.” He later allowed his aides to write a biography of him shortly after the war. It essentially became the first presidential campaign biography, promoting Jackson for the presidency.\nIn a SiriusXM interview Monday, Trump said that his “campaign and win was most like Andrew Jackson,” and Inskeep said that in many ways, that’s true. (In that same interview, Trump also suggested that Jackson, who was president from 1829 to 1837 and died in 1845, could have prevented the Civil War, which broke out in 1861.)\n“Jackson was or cast himself as an outsider even though he was actually a very rich guy and a member of a certain elite, which can sound kind of familiar,” Inskeep said. “And he cast himself as the man who was in favor of the common people. ... So the language is a little different but the sentiment is really similar.”\nWhen Jackson was elected, elites “were horrified” and thought he may become a dictator, given his penchant for crude and outlandish statements. Once, Jackson threatened to cut off the ears of his political enemies.\nIn the same interview, Trump also claimed that Jackson “had a big heart.” While that may have been true with his friends and allies, Inskeep said Jackson was also “a guy who would stop at nothing if his pocketbook was involved, if his interests were involved, or if his political coalition was in any way threatened.”\nThen, Inskeep said, “he would be totally ruthless.”\nIn many ways, Jackson has left an unsavory mark on history: He was the architect of the Native American Trail of Tears and was an adamant slave owner. In recent years, Jackson’s cruelty has been a center of public debate, which prompted the Obama administration to promise to replace Jackson’s face with Harriet Tubman’s on the $20 bill.\nBut many Americans grew up being taught to revere Jackson and “had been all along kind of quietly resentful that he was under such continuous attack,” Inskeep said.\nFor Trump, a candidate who revived the “silent majority” axiom during his 2016 campaign, choosing to align himself with the memory of Jackson is more than an apt observation -- it's politically clever, says Inskeep.\n“Nobody publicly defended this guy,” Inskeep said. “So if you were going to be Donald Trump taking the political approach that he’s taken to every issue and you’re thinking about what historical character to identify with, Jackson is almost the perfect guy.”",
    "label": 3
}