{
    "index": 504,
    "text": "Dana Perino: Trump candidacy has set GOP women 'adrift'\nShow Caption Hide Caption Fox TV's Dana Perino on Trump, GOP, and Jasper Capital Download talks to DanaPerino on Trump, the GOP – and Jasper\nDana Perino, a former White House press secretary for President George W. Bush, personifies the GOP’s looming crisis with women voters. At 44, she is a lifelong Republican and aide to Republican officeholders, but she’s not voting for Donald Trump on Election Day. Perino, co-host of Fox's The Five, is promoting her new book, Let Me Tell You About Jasper: How My Best Friend Became America’s Dog, published by Twelve. She was interviewed for USA TODAY's Capital Download Friday in New York. Questions and answers have been edited for length and clarity.\nQ: You’ve worked for Republican congressmen, in a Republican Justice Department and at a Republican White House. So are you voting for the Republican presidential nominee next month?\nPerino: I do feel adrift as a Republican woman, maybe a woman without a party. ... You sort of feel like, ‘I don’t know if I belong anymore.’ Now, there are plenty of Republican women that support Donald Trump fervently and passionately, without any hesitation. I just have hesitation and I don’t know what I’m going to do. I don’t know if I’m even going to vote, and I have a perfect voting record.\nQ: Why is Trump losing so many women voters?\nPerino: I think that a lot of women in their gut are concerned about the temperament, and knowledge and experience, (although) they don’t necessarily like Hillary Clinton. ...\nUnless the Republican Party changes either the way that it talks about things (like sexual assault) or the way it approaches issues like paid maternity leave, they’re going to risk losing women in the future. But it also depends on how Hillary Clinton decides to govern, and I think we don’t know what that’s going to be like, if she becomes president.\nQ: A question for you from a reader on Twitter: What did you think about the exchange between Megyn Kelly and Newt Gingrich? (Gingrich accused the Fox News anchor of being “fascinated by sex” when she asked about allegations of sexual misconduct by Trump.)\nPerino: I thought Megyn was extremely, exceedingly professional. I do think that it’s a news story and I don’t think that the news media is just making up the news story. ...\nWhen he (Trump) went to Gettysburg (Pa.) and he made the Gettysburg address, I called it the Gettysburg redress of grievances. Because substantively, if you’re a Republican, you could read that speech or listen to it, and say ‘I agree with all that. School choice, lower taxes, I’m for that.’ But adding the paragraph that he’s going to sue all the women (accusers) after the election – one, to me was about intimidation to make sure if you were thinking of coming out, don’t. It’s calling women liars and it’s putting them on the defensive. Look, we just went through a summer at Fox News where questions of sexual harassment came up.\nQ: The issue of sexual harassment has had a political power this year it hasn’t had before.\nPerino: I certainly think so. In fact, what I thought was strange about the way the Trump campaign handled all that was, one of their strongest talking points against Hillary Clinton’s character had been how accusers of Bill Clinton had been treated through the years. But now accusers of Donald Trump are being treated in the exact same way that they complain Hillary Clinton treated those women. So it kind of canceled each other out. No wonder people are dissatisfied with this election.\nQ: Do you think Trump could win?\nPerino: I think it’s unlikely. However, I do remember 2000.... I do think that anything could happen.\nWhen Donald Trump’s campaign says that there are a lot of undecideds out there and people who are not willing to admit that they plan to vote for Donald Trump, that might be true. But I also think it could be true on the other side as well. For instance, these Republican women who feel adrift, if they decide they’re going to go to the polls to vote for Hillary Clinton, they’re probably not telling too many people about that.\nQ: Are you a secret Hillary Clinton voter?\nPerino: No, I am not going to vote for Hillary.\nQ: Is it conceivable you would vote for Trump?\nPerino: No. My question right now is: Do I go in and write in a candidate that I don’t even know? Or do I not even go? .... It pains me to think about not voting, but not that much, actually. I feel that decision is actually making a statement.",
    "label": 3
}