{
    "index": 465,
    "text": "Trump praises Australia's universal health care in meeting with Prime Minister Malcolm Turnbull\nShow Caption Hide Caption Trump meets with Australian PM in New York President Donald Trump met with Australian Prime Minister Malcolm Turnbull Thursday night in New York. (May 4) AP\nWASHINGTON – Four months after a contentious phone call, President Trump sought Thursday to smooth relations with the leader of Australia by celebrating a major U.S.-Australian naval milestone in World War II.\n\"We've been allies for 99 years,\" Trump told reporters after meeting with Australian Prime Minister Malcolm Turnbull. \"Can you imagine that? 99 years. And never a bad time.\"\nTrump and Turnbull met in New York City for about 30 minutes ahead of a gala honoring the 75th anniversary of the Battle of the Coral Sea. In the early days of World War II, the U.S. and Australia faced off with Japan's navy in a historic aircraft carrier battle in the Pacific Ocean.\n\"That was some battle,\" Trump said. \"That was a very important battle for both of us.\"\nEarlier in the day, Trump delayed his trip to New York and his meeting with Turnbull to await the results of a vote in the U.S. House to repeal and replace the Affordable Care Act. Hours later, Trump told Turnbull that Australia has \"“better health care” than the United States.\n\"It's going to be fantastic health care,\" Trump said, referring to Thursday's passed health care bill. \"I shouldn't say this to our great gentleman and my friend from Australia because you have better health care than we do.\"\nThe Trump-Turnbull sit-down comes just a few months after their reported acrimonious conversation of Jan. 28, a phone call that was subsequently parodied on Saturday Night Live.\nLittle more than a week after becoming president, Trump protested a refugee agreement Turnbull made with President Obama's administration. Under the deal — which the Trump administration has since said it would honor — the United States committed to resettling some 1,250 mostly Muslim refugees who have been housed in immigration camps on the Pacific island nations of Nauru and Papua New Guinea.\nTrump praises ‘iron bonds’ between U.S. and Australia President Donald Trump says few people share ties in history, affection and culture like the Americans and the Australians. Trump praised the 'iron bonds' between the United States and Australia. (May 4) AP\nTrump, who during the campaign pledged new restrictions on refugees entering the United States, reportedly told Turnbull that he was \"going to get killed\" politically over the Australian deal.\nIt was a calmer scene Thursday as Trump and Turnbull met at the Intrepid Sea, Air and Space Museum, site of the Coral Sea gala.\nTrump disputed the idea that he had a testy phone call with Trumbull, telling reporters: \"We get along great. We have a fantastic relationship, I love Australia, I always have.\"\nTurnbull said Australia and the United States have always been close: \"We are always more assured of winning when we are fighting together.\"\nIn addition to refugees, the leaders were expected to discuss the North Korean nuclear and global security generally. Australia is a key member of the Five Eyes intelligence alliance, along with the United States, Canada, New Zealand, and the United Kingdom.\n\"I think that you can expect a strengthening out of an already strong ally, and furthered continued great relationship that we have with them,\" said White House spokesperson Sarah Sanders.\nIn commemorating the Battle of the Coral Sea, the United States and Australia are saluting the emergence of a new kind of naval warfare that took place less than six months after Pearl Harbor.\n\"At the Battle of the Coral Sea, a complex action stretching across hundreds of sea miles and five days, from May 3 to 8, 1942, the two sides made naval history, as all the fighting was conducted by carrier-based aircraft,\" historian David M. Kennedy wrote in Freedom from Fear: The American People in Depression and War, 1929-1945.\n\"Separated by 175 miles of ocean, the warships neither directly fired upon nor even actually sighted one another,\" Kennedy said.\nBoth sides publicly claimed success in the battle that preceded the more decisive U.S. victory at Midway one month later.",
    "label": 2
}