{
    "index": 162,
    "text": "President Trump said he hopes to \"make a fast decision\" on the replacement for fired FBI Director James Comey, hinting an announcement could come within days.\nMr. Trump told reporters on Air Force One that he may select Comey's successor before leaving for his first foreign trip next week.\n\"We can make a fast decision,\" Mr. Trump said. \"These are outstanding people that are very well known, highest level. So we can make a fast decision.\"\nPresident Trump speaks to members of the media aboard Air Force One before his departure from Andrews Air Force Base, Md., on Sat., May 13, 2017. AP\nHe made the comments during a flight to Lynchburg, Virginia, where he delivered his first commencement address as president to graduates of Liberty University.\n\"I think the process is going to go quickly. Almost all of them are very well known,\" Mr. Trump said. \"They've been vetted over their lifetime essentially, but very well known, highly respected, really talented people. And that's what we want for the FBI.\"\nAsked if the pick would be announced before his trip overseas, Mr. Trump said, \"Even that is possible.\"\nIt was unclear whether Mr. Trump was referring to a permanent replacement or an interim director. An interim director does not require confirmation by the Senate and could give the administration more time to search for a permanent pick.\nActing Director Andrew McCabe has been in charge of the bureau since Comey's precipitous ouster on Tuesday.\nMr. Trump will travel to Saudi Arabia at the end of next week, followed by visits to the Vatican and Israel. He will also travel to Sicily for a G-7 meeting and Brussels for a summit of NATO leaders.\nDepartment of Justice officials spent the day Saturday interviewing candidates for the permanent FBI director role, including McCabe, Republican Sen. John Cornyn of Texas, attorney Alice Fisher, federal Judge Henry Hudson and former Homeland Security Adviser Fran Townsend, who is also a CBS News national security analyst.\nLate in the day, Mike Rogers, a former congressman, was a last-minute addition to the list of interviewees. Rogers was endorsed for the permanent director role earlier Saturday by the FBI Agents Association, which represents 13,000 current and former agents.\nThe DOJ also says several current FBI and intelligence officials were being interviewed for the interim position, including Special Agent in Charge Adam Lee, who returned to DOJ for a second interview Saturday. Earlier in the week, DOJ officials said they were close to naming an interim director, but have yet to do so.\nCBS News' Paula Reid and Kathryn Watson contributed to this report.",
    "label": 3
}