{
    "index": 356,
    "text": "Texas Gov. Greg Abbott was poised Thursday to sign the nation’s most stringent law yet to target “sanctuary cities,” a measure that could impose heavy fines or even jail time on local law enforcement officials who refuse to honor immigration detention requests.\nAfter weeks of heated debate, sit-ins and protests at the state Capitol in Austin, Texas lawmakers Wednesday night passed the sweeping bill that would ban sanctuary cities and allow police to inquire about the immigration status of anyone they detained, even those stopped for minor traffic violations. It would also force local officials to comply with federal immigration requests to detain those who are suspected of being in the country illegally.\nPolice chiefs and county sheriffs who refuse to comply with federal requests, which are not mandatory under federal law, could face up to a year in jail. Cities, counties and colleges could also face stiff fines, from $1,000 to $25,500 a day.\nAbbott has said he will sign the bill in the coming days, and immigrant advocates are gearing up for a court fight.\n“This is unprecedented,” said Angie Junck, supervising attorney at the Immigrant Legal Resource Center in San Francisco, who argued the bill violated 4th Amendment protections against warrantless arrests without probable cause and raised concerns about racial profiling.\nAdvertisement\n“It’s not only telling law enforcement to engage in unconstitutional behavior, but it’s then seeking to punish them for a crime,” she said. “It’s astonishing.”\nThe Texas legislation, Senate Bill 4, passed amid a fierce national debate on sanctuary cities, jurisdictions which decline to hold immigrants arrested for local crimes past their release date simply because immigration authorities want them detained for potential deportation proceedings.\nShortly after his inauguration, President Trump issued an executive order on immigration that threatened to strip federal funds from cities that did not cooperate with federal immigration enforcement. That provision of the order is in legal limbo after a federal judge in Northern California temporarily blocked it last week, concluding that cities could prevail in their argument that placing new conditions on federal funds is unconstitutional.\nOn Thursday, Maryland Atty. Gen. Brian E. Frosh issued a memo warning that state and local law enforcement officers were “potentially exposed to liability” if they honored immigration detainer requests — unless the request is accompanied by a judicial warrant or supported by information providing probable cause that the person has committed a crime.\nWhile other states have passed laws urging municipalities to assist federal immigration efforts — Mississippi’s governor signed a law in March that bars sanctuary jurisdictions — legal experts say the Texas bill is the first to explicitly make it mandatory to honor U.S. Immigration and Customs Enforcement detainers, with noncompliance subject to criminal penalties.\n“This law takes some of the federal policies that we’ve seen and puts it on steroids,” Junck said. “It seems this governor and the Texas Legislature are trying to outdo the federal government and design their own plan for deportations of residents and to create fear within anyone that’s in the immigrant community to drive them out of the state of Texas.”\nAbbott, who has promised he will “not tolerate sanctuary-city policies that put the cities of Texas at risk,” has signaled that he plans to sign the bill. Shortly after it won final legislative approval Wednesday, he wrote on Twitter: “I’m getting my signing pen warmed up.”\nLegal experts say the Texas bill is even stricter than Arizona’s widely criticized 2010 law, SB 1070, that required police officers to demand the papers of people suspected of being in the country illegally. After a string of lawsuits and boycotts, that law was eventually amended.\nRepublican officials who have supported the legislation say it is needed to ensure that those who have committed crimes and are in the country illegally are deported.\n“SB 4 will ensure that no liberal local official can flaunt the law,” Lt. Gov. Dan Patrick said in a statement. “This legislation will eliminate a substantial incentive for illegal immigration and help make Texas communities safer.”\nA wide range of opponents — immigrant advocates, Democratic legislators, police organizations and politicians from cities such as Austin and Houston with large immigrant populations — had made it a priority to defeat the bill.\n“I am concerned that we’re the canary in the coal mine and other states will start attempting to pass draconian anti-immigrant laws,” said Gregorio Casar, an Austin city councilman who represents a heavily Latino part of north Austin. On Monday, he was one of two dozen protesters arrested and charged with trespassing after occupying the lobby of the governor’s office in protest of the bill.\n“You’re going to see the people of Texas fight this law every single step of the way, because it’s unconstitutional, it’s dangerous, it’s bad for the economy and it isn’t the state’s business to be cracking down on immigrants,” Casar added.\nIn turn, Republican Sen. Charles Perry, who wrote the bill, has accused opponents of fear-mongering. The bill, he has argued, provides “uniform application of the law without prejudice” to everyone in Texas.\n“Banning sanctuary cities is about stopping officials who have sworn to enforce the law from helping people who commit terrible crimes evade immigration detainers,” he said in a statement.\nPolice chiefs and sheriffs of major jurisdictions across Texas have spoken out against the bill, arguing that requiring local law enforcement to take a more active role in immigration enforcement will create fear among immigrant communities, foster distrust of police and eventually lead to an uptick in crime.\nTravis County Sheriff Sally Hernandez, who made headlines this year when she announced she would not voluntarily comply with federal requests to detain people solely on the basis of their immigration status, said the bill passed as a result of fear and misinformation.\n“I am disappointed, because this is not in the best interest of public safety,” she said Thursday in a statement. “It ties the hands of our law enforcement agency and pushes victims of crime into the shadows. While I hate seeing a state law like this come to pass, I have always followed the law and that will not change.”\nIn an opinion piece published in the Dallas Morning News, David Pughes, interim chief of police in Dallas, and Art Acevedo, chief of police in Houston, wrote that the bill was “political pandering that will make our communities more dangerous.”\n“Such a divide between the local police and immigrant groups will result in increased crime against immigrants and in the broader community, create a class of silent victims, and eliminate the potential for assistance from immigrants in solving crimes or preventing crime,” they said.\nIn recent weeks, Texas Democrats and moderate Republicans worked desperately to try to tone down the bill. Last week, Democratic lawmakers in the Republican-dominated House wore all black as they engaged in a marathon overnight session to defeat the legislation. But after 16 hours of emotional debate, the bill that eventually passed the House 93 to 54 was stricter than previous versions.\nOne late amendment, criticized by Democratic lawmakers, says police departments cannot discourage officers from inquiring about the immigration status of those who have been detained, even during routine traffic stops. Legal experts warn this would allow sheriff’s deputies and police officers to question a person’s legal status without having probable cause.\n“It has gone from a bad bill to a worse bill,” Sen. Sylvia Garcia, a Democrat who represents Houston, warned in remarks to the Senate on Wednesday. She said she feared the legislation could lead to police harassment and profiling of Latinos.\n“The last thing I want is ‘walking while brown’ to become reasonable suspicion,” she said. “And, frankly, that is what will happen with this legislation — it doesn’t matter how much its supporters promise that this will not happen. It will happen.”\nAlready, Immigration and Customs Enforcement agents arrest more people in the state of Texas than in other state.\nFrom fiscal year 2014 through 2016, Texas received 58,452 federal immigration detainer requests, compared with 46,444 detainers issued in California, according to Syracuse University’s Transactional Records Access Clearinghouse, which tracks immigration data.\nFederal agents took into custody 35,632 individuals in Texas based on those detainers, more than double the number in California.\nJarvie is a special correspondent.",
    "label": 3
}