{
    "index": 323,
    "text": "FBI Director James B. Comey said Wednesday he has suffered anguish but does not regret his decision to inform Congress in late October that the bureau would reopen its inquiry into whether Hillary Clinton had mishandled classified emails, a disclosure that roiled the presidential race in its final days.\nIn his most detailed public comments on the explosive episode, the FBI director told the Senate Judiciary Committee that his decision to disclose the preliminary investigation into newly discovered Clinton emails 11 days before the election was “one of the world’s most painful experiences,” but that he would do it again.\n“It makes me mildly nauseous to think that we might have had some impact on the election, but honestly, it wouldn’t change the decision,” Comey said.\n“I’ve gotten all kinds of rocks thrown at me, and this has been really hard, but I think I’ve done the right thing at every turn,” he added.\nComey testified a day after the unsuccessful Democratic presidential nominee said that she believed Comey’s unusual letter to Congress on Oct. 28 had essentially tilted the close race to her rival, Donald Trump.\nAdvertisement\n“If the election had been on Oct. 27, I would be your president,” Clinton said in a CNN interview at a women’s conference in New York. She blamed her loss on Comey’s disclosure, Russian hacking of Democratic Party emails and her own flaws as a candidate.\nIn response, President Trump said on Twitter that Comey “was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds!”\n“The phony Trump/Russia story was an excuse used by the Democrats as justification for losing the election,” Trump tweeted.\nComey repeatedly rebuffed questions Wednesday about the ongoing FBI counterintelligence investigation into whether any of Trump’s current or former aides cooperated with Russian intelligence agencies during the presidential race.\nComey only disclosed that investigation to a House hearing in March and said it had begun last July, during the heat of the campaign. After the election, U.S. intelligence agencies concluded that Russia had deliberately sought to interfere in the race to aid Trump and to undermine Clinton.\nOn Wednesday, Comey said he did not think he was inconsistent last fall when he disclosed that the FBI had obtained new evidence that might lead it to reopen its investigation of Clinton’s use of a private email server when she was secretary of State — but did not disclose a separate FBI investigation into whether members of Trump’s inner circle colluded with a foreign intelligence service.\nHe said he only announced the Clinton email inquiry, which the FBI had code named Midyear Exam, when it was formally closed in July. He said he felt obliged to inform Congress in October when new Clinton emails were found in an unrelated investigation.\nComey sent a follow-up letter two days before the election to say the additional emails did not change his earlier conclusion that charges against Clinton were not warranted.\nComey’s many critics say his news conference in July — when he called Clinton’s handling of classified material “extremely careless” but said that she would not be charged — and then his disclosures to Congress at the end of a bitter national election campaign were improper since the FBI is not supposed to discuss cases unless charges are filed.\nIn January, the Justice Department’s inspector general said he would investigate whether Comey violated department guidelines in his handling of the case.\nComey said Wednesday that he welcomes the internal inquiry. “If I did something wrong, I want to hear that,” he said.\nHe specifically declined to say whether the White House is cooperating with the Russia investigation, or whether the FBI has sought to examine Trump’s tax returns for evidence of ties to Russia. Trump has refused to release his tax returns to the public.\nThe FBI chief said Russia is still interested in trying to affect U.S. politics, and he believes it “a certainty” that Moscow will try to influence the elections in 2018 and 2020.\nIn a detailed, at times emotional explanation of his actions, Comey laid out the sequence of events that he said led to his July 5 news conference, his Oct. 28 letter to Congress and a follow-up letter three days before the election.\nComey said he decided the Justice Department was too compromised in July to publicly explain why Clinton would not be charged without “grievous damage to the American people’s confidence in the justice system.”\nA big reason, he said, was because Atty. Gen. Loretta Lynch had met privately with former President Clinton in June in what both later described as a social visit because they were both at the same airport.\nUnder heavy criticism for meeting the former president while his wife was under an FBI investigation, Lynch recused herself from a direct role in the case. That gave Comey the authority to hold the politically sensitive news conference on his own, he said.\nHe said he sent the Oct. 28 letter after FBI agents found emails from Hillary Clinton on a laptop computer used by former Rep. Anthony Weiner, the husband of Clinton aide Huma Abedin, and thought they might include what he called “golden missing emails” from Clinton’s first months at the State Department. The FBI had seized Weiner’s laptop in an investigation of sexual texts he had exchanged with a teenage girl.\nAgents found evidence that Abedin had passed classified emails to Weiner, who would print out emails for her to read, Comey said. But no charges were filed because the FBI could not “prove any sort of criminal intent,” he said.\nComey said he and his top staff debated whether to go public, mindful of long-standing Justice Department policies that seek to avoid actions that could sway elections.\nBreaking that policy would be “really bad,” Comey said. But he said the only other choice, “concealment,” would have been “catastrophic.”\n“We’ve got to walk into the world of really bad,” he said he concluded. “We’ve got to tell Congress we are restarting this.”\nHe said he made the decision even though a deputy said that might help elect Trump. Comey said he couldn’t consider that when making the call.\n“Down that path lies the death of the FBI as an independent institution in America,” he said.\njoseph.tanfani@latimes.com\nTwitter: @jtanfani",
    "label": 2
}