{
    "index": 397,
    "text": "Congress and guns: Key moments in 26 years of death and debate\nShow Caption Hide Caption Paul Ryan vows to vote on gun control legislation next week If passed, the legislation would block terrorism suspects from purchasing guns. Video provided by Newsy Newslook\nIn the wake of the June 12 Orlando nightclub massacre, Congress has found itself gridlocked over what to about guns — or whether to do anything at all.\nThis has been the pattern in recent memory: a tragedy; a heartfelt speech; a call for action; and a stalemate. But since 1990, Congress has actually legislated on guns repeatedly, sometimes tightening and sometimes loosening regulations. Here's a timeline of key moments in 26 years of gun debate.\nNov. 29, 1990\nPresident George H. W. Bush signs the Gun-Free School Zone Act of 1990, which prohibits firearms in school zones.\nOct. 16, 1991\nGeorge Hennard, 35, crashes his pickup truck into a Luby’s cafeteria in Killeen, Texas and guns down 22 people.\nNov. 30, 1993\nPresident Bill Clinton signs the Brady Handgun Violence Prevention Act of 1993, requiring gun buyers get background checks when purchasing guns from federally licensed dealers and implementing a five-day waiting period.\nSept. 13, 1994\nClinton signs the Violent Crime Control and Law Enforcement Act of 1994, prohibiting the manufacture or importation of semiautomatic assault weapons and increasing penalties for criminal use of firearms.\nApril 26, 1995\nThe U.S. Supreme Court decides the Gun-Free School Zone Act is unconstitutional during the United States v. Lopez case.\nSept. 30, 1996\nCongress enacts the Domestic Violence Offender Gun Ban, which prohibits persons convicted of misdeameanor domestic violence crimes or under restraining orders from possessing, using or transporting guns.\nOct. 21, 1998\nClinton signs The Omnibus Consolidated and Emergency Supplemented Act of of 1999, which requires federal firearm licensees to sell gun storage and safety devices.\nApril 20, 1999\nColumbine High School students Eric Harris,18, and Dylan Klebold, 17, open fire at school, killing 13 people and injuring 21 more in Littleton, Colo.\nNov. 25, 2002\nPresident George W. Bush signs the Homeland Security Act of 2002, establishing the Bureau of Alcohol, Tobacco, Firearms and Explosives.\nSept. 13, 2004\nThe Violent Crime Control and Law Enforcement Act assault-weapon ban expires after 10 years.\nMarch 21, 2005\nJeffrey Weise, 16, kills seven people and injures five more at a shooting in Red Lake High School in Red Lakes, Minn. He also killed his grandfather and his grandfather's girlfriend before heading to the school.\nOct. 26, 2005\nBush signs the Protection of Lawful Commerce in Arms Act, stopping certain litigants from recovering damages against firearm dealers and manufacturers when guns are unlawfully used.\nApril 16, 2007\nSeung Hui Cho, 23, goes on a shooting spree at Virginia Tech in Blacksburg, Va., killing 32 people.\nJan. 8, 2008\nBush signs the NICS Improvement Amendments Act of 2007, which improves federal and state electronic recordkeeping for use in background checks on people ineligible to possess firearms due to mental illness or domestic violence.\nNov. 5, 2009\nU.S. Army Maj. Nidal Hasan, 45, fatally shoots 13 people and injures 30 others at Fort Hood near Killeen, Texas.\nJan. 8, 2011\nJared Lee Loughner, 27, opens fire at a constituent event for Rep. Gabrielle Giffords in a Casas Adobes, Ariz. supermarket parking lot, killing six people and critically injuring Giffords.\nJuly 20, 2012\nJames Holmes, 28, shoots and kills 12 people in an Aurora, Colo., movie theater.\nDec. 14, 2012\nAdam Lanza, 20, guns down 20 children and six adults at Sandy Hook Elementary School in Newtown, Conn.\nApril 18, 2013\nSenate rejects Nevada Democratic Sen. Harry Reid's Safe Schools Act of 2013, which would have required background checks for every firearm sale.\nSept. 16, 2013\nGunman Aaron Alexis, 34, fatally shoots 12 people and injures three others at the Naval Sea Systems Command headquarters at the Washington Navy Yard in D.C.\nJune 17, 2015\nDylan Roof, 22, opens fire at a weekly Bible study at the Emanuel African Methodist Episcopal Church in Charleston, S.C., killing nine people.\nOct. 1, 2015\nChristopher Harper-Mercer, 26, shoots and kills an assistant professor and eight students in a classroom at Umpqua Community College near Roseburg, Ore.\nDec. 2, 2015\nSyed Farook, 28, and Tashfeen Malik, 29, open fire at a San Bernardino County Department of Public Health holiday party, killing 14 people and injuring 22 others in San Bernardino, Calif.\nDec. 3, 2015\nSenate rejects measures to expand background checks for guns purchased online and at gun shows and an amendment to prevent individuals on the terror watch list from purchasing firearms.\nJan. 5, 2016\nPresident Obama issues executive actions that include hiring more people to run the FBI background check system and asks Congress for $500 million to increase access to mental health care.\nJune 12, 2016\nOmar Mateen, 29, opens fire in a gay nightclub in Orlando, Fla., leaving 49 dead and 53 injured.\nJune 20, 2016\nSenate rejects four gun measures to expand background checks and ban gun sales to people on the terror watch list.\nJune 22, 2016\nHouse Democrats stage a day-long sit-in on the chamber floor, demanding a vote on gun control measures. House Republicans refuse the demand, calling the sit-in a \"publicity stunt.\"\nContributing: Donovan Slack",
    "label": 3
}