{
    "index": 298,
    "text": "In a Trump administration beset by lost opportunities, muddled strategies and frequent missteps in its first 100 days, one area stands out for its disciplined approach and early successes: the multi-front assault on environmental regulations.\nUnlike the Obamacare repeal debacle or immigration actions now tangled in the federal courts, the administration has managed in a few short months to upend numerous hard-fought environmental protections and climate actions that the fossil fuel industries have been targeting for years.\nPlanned action on climate change has been shelved, national monuments are imperiled, clean air and water rules have been eroded. Doubt has even been cast on the ability of states like California to protect their own robust environmental regulations.\nThe tens of thousands of protesters who converged Saturday on Washington and other cities for the People’s Climate March confronted a policy landscape that perhaps more than any other has been transformed under President Trump.\nEven as marchers were making their signs and plotting their chants on Friday, Trump was delivering another blow, signing an order that could open the California coast and Arctic to new oil and gas drilling.\nAdvertisement\n“It has been a wrecking ball right out of the gate,” said Rep. Jared Huffman of San Rafael, a top Democrat on the House Natural Resources Committee. “We shouldn’t underestimate the amount of damage that has already been done to the environment by an administration that can’t seem to get almost anything else done.”\nThe fast clip at which the administration has eased environmental rules reflects how vulnerable many of the rules are after having been put into place administratively by an Obama White House that could not get consent from a resistant Congress.\nBut it is also a sign of the unprecedented sophistication and political organization of fossil fuel and related industries, which have nurtured for years a network of think tanks and politicians in preparation for this moment. That team of industry-supported activists now dominates the leadership of Trump’s environmental agencies, which have set about killing those rules in the hopes of boosting some U.S. industries.\n“We are very heartened by the progress that has been made,” said Myron Ebell, who headed Trump’s transition at the Environmental Protection Agency and has since returned to the Competitive Enterprise Institute, an industry-funded group that takes a lead nationally in denying mainstream climate science. “I’m not going to take credit, but one might take a look at the work of the transition for the Department of Energy, Department of Interior, and the EPA.”\nThe transition at each of those agencies was run by leaders from think tanks aligned with the donor network guided by fossil fuel tycoons Charles and David Koch. The organizations over the last several years have sent lobbyists and attorneys across the country in a coordinated effort to undermine President Obama’s climate action and fight state efforts to promote clean energy.\nAmong their most prized allies was Scott Pruitt, now the EPA administrator, who during the Obama administration developed extensive legal strategies for attacking federal environmental rules while serving as Oklahoma’s attorney general. Trump’s Energy secretary, former Texas Gov. Rick Perry, oversaw a similar effort in his home state.\nBusiness groups have praised the administration’s quick work, saying the Obama-era rules were expensive, burdensome and unnecessary.\n“A lot of this involves questionable uses of executive authority by the Obama administration that simply had to be put back in the bottle,” said Scott Segal, a lobbyist for big energy firms.\nBut longtime EPA officials have been alarmed by the speed of the changes, with one likening Trump’s team to “trained assassins.”\nPeople don’t trust government, they don’t trust scientists, they don’t trust environmentalists in the same way they did 10 or 20 years ago. — Jared Blumenfeld, EPA official under Obama\nSome of the attacks have been high-profile and attention-grabbing: the dismantling of the Clean Power Plan that promised to put the nation’s dirtiest power plants out of business; the shelving of aggressive fuel mileage standards that California and other states are dead-set on implementing; the move to get rid of national monuments; the hasty approval of contentious, massive oil pipelines.\nBut even on days when the announcements don’t make headlines, the tearing-up of environmental rules marches along.\nOften the rules involved are obtuse and escape broad public notice, but the impact of stripping them piles up.\n“A lot of this is technical and below the radar, and the real harm isn’t readily understood by the American people,” Huffman said. “When you are dealing with things like methane leakage, it gets real technical fast.”\nThe actions have galvanized the environmental movement, as groups scramble to file lawsuits and donations gush in at a record pace. Environmental activists are defiant. They predict Trump’s efforts will ultimately collapse as they have in other sectors.\n“They have shown in this first 100 days where they want to go with respect to unraveling climate action and protections for clean air and water, but how effective and competent they will be at executing that agenda remains to be seen,” said Brian Deese, who advised Obama on climate change. “In practice, these things are more difficult, more complicated and messier than they appear on Day One of an executive order.”\nEven Ebell expressed concern about a backlog of appointments at the environmental agencies, which right now he worries don’t have the staff in place to implement the directives Trump has made.\nBut the confrontation with Trump presents tough questions for the environmental movement and its effectiveness in the new political climate. Leaders of environmental groups express confidence that Trump will soon be subjected to the same public backlash that hobbled previous Republican administrations that worked to undermine environmental rules. Others who have long been in the trenches of federal environmental protection are more panicked.\n“I am very skeptical that public concern about overreach will be the thing that stops Trump from destroying these institutions,” said Jared Blumenfeld, who headed EPA operations in California, Nevada and Arizona under Obama. “People don’t trust government, they don’t trust scientists, they don’t trust environmentalists in the same way they did 10 or 20 years ago.… The question is, how is the environmental movement retooling its message to deal with this threat?”\nPolls show Americans favor action on climate change and strong environmental rules. But they don’t show that the coalition of voters that got Trump elected is at all concerned by his direction on such issues.\nLess than a third of Republican voters worry that Trump’s executive order dismantling much of the federal effort to confront climate change would harm the environment, according to a recent Morning Consult poll. More than half of the Republicans asked by Gallup in March about their feelings on the future of the environment said they believed it was getting better.\n“I’m not sure who the environmental advocates can even go to anymore on the Republican side of the aisle,” said Blumenfeld. “Protecting the environment is something to me that is inherently bipartisan. Yet no one in the environmental community seems to be able to reach out and stop what is happening.”\nevan.halper@latimes.com\nFollow me: @evanhalper\nALSO\nHere are the national monuments being reviewed under Trump’s order\nRepublicans are rethinking their disdain for the Paris accord – creating a political headache for Trump\nTrump signs order to reconsider national monuments created by Obama, George W. Bush and Clinton\nUPDATES:\n11:30 a.m.: This article was updated with information about protests Saturday in Washington and other cities.\nThis article was originally published at 3 a.m.",
    "label": 3
}