{
    "index": 820,
    "text": "The House of Representatives passed a short-term extension Friday morning to keep the government operating for another week, one step in averting a shutdown as negotiators continue to work on an agreement to extend funding through the remainder of the year.\nThe Senate also voted to pass the short-term spending bill, known as a continuing resolution, shortly after the House passed it. The president has until midnight tonight to sign the extension. Senate Majority Leader Chuck Schumer told NBC News that he dropped his objection to the extension even though there wasn't an agreement yet on the larger spending bill.\n\"There’s no Democratic objection,\" Schumer said in an interview with NBC News. \"There's still some to be negotiated,\" on a long-term deal he said, \"but the negotiators were up 'til 1:30 last night … so certainly we’re willing to give it a few more days.\"\nTrump Friday evening signed the House resolution keeping the government running, the White House said.\nThe short-term measure was needed after negotiations between the two parties in Congress and the administration on a long-term bill fell short of Friday's deadline.\nThose negotiations hit a snag earlier this week with last-minute demands by President Donald Trump. But after just several days, Trump dropped his request for funding for the construction of a border wall and said he would continue to fund cost-sharing subsidies for low-income people in the Affordable Care Act.\nTrump’s concessions helped to move talks along but sticking points still exist, including funding for Puerto Rico and health insurance for coal miners to name just two.\nBut even that one-week funding bill ran into political roadblocks. Democrats said they would not support the extension if Republicans brought up a bill to repeal and replace their signature legislation, the Affordable Care Act.\nRepublican Speaker of the House from Wisconsin Paul Ryan speaks to the media about President Trump's remarks about the conservative House Freedom Caucus in the U.S. Capitol in Washington, D.C., March 30, 2017. Jim Lo Scalzo / EPA\nRepublicans have seen renewed momentum on their health care bill this week after a core group of conservatives said that they would support it after changes were made, but House leadership still didn’t bring up the bill for a floor this week. The decision was not because of Democrats’ threats but because they didn’t have the votes to pass it.\nRepublicans can only afford to lose 22 members in order for the bill to pass and NBC News has identified 17 who are not supporting it and nearly a dozen more who are undecided.",
    "label": 3
}