{
    "index": 314,
    "text": "The Trump administration announced a major tax reform plan on Wednesday, except it isn’t much of a reform (merely another massive tax cut for the very wealthy) and it isn’t much of a plan (just a one-page list of ideas that have yet to be developed into a legislative proposal). In other words, it is much like Donald Trump’s “plans” for healthcare, trade, a border wall and North Korea: lots of salesmanship with no actual product to sell.\nWhen it came to repealing and replacing Obamacare, Trump latched onto a half-baked House Republican bill that couldn’t even be brought up for a vote. On trade, he has backed away from his pledge to kill NAFTA. He has let the border wall be postponed, and it seems to shrink with each passing day. He had the entire United States Senate bused to the White House for a top secret briefing about North Korea, and even Republican senators came away from the session saying it was little more than a publicity stunt.\nThat Trump, in his first 100 days, has done very little that he promised to do on the campaign trail is not necessarily a bad thing. A reworking of American healthcare should not happen until Trump can actually deliver what he promised — good care at lower cost for everyone — which is likely unobtainable without moving to a single-payer system like that enjoyed by citizens in Canada, Europe and Japan. NAFTA should not be jettisoned, it should be improved. Billions should not be wasted on a border wall when there are smarter, cheaper options for dealing with illegal immigration. And North Korea needs to be addressed by someone who doesn’t think blustering tough talk is the same as a real strategy.\n1 / 51 la-1491523602-y7ephyarj1-snap-image (David Horsey / Los Angeles Times) 2 / 51 la-1491368625-0bgh58ihw8-snap-image (David Horsey / Los Angeles Times) 3 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 4 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 5 / 51 Top of the Ticket cartoon (David Horsey / Los angeles Times) 6 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 7 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 8 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 9 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 10 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 11 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 12 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 13 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 14 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 15 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 16 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 17 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 18 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 19 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 20 / 51 Trump inspires millions to take to the streets -- to oppose him. (David Horsey / Los Angeles Times) 21 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 22 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 23 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 24 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 25 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 26 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 27 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 28 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 29 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 30 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 31 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 32 / 51 Cartoon caption contest winner at the DENT conference in Sun Valley, Idaho: Jon Duval, executive director of the Ketchum Community Development Corporation. (David Horsey / Los Angeles Times) 33 / 51 Old radicals and big media descend on Selma (David Horsey / Los Angeles Times) 34 / 51 Horsey imagined the creation of the Ann Coulter phenomenon in this cartoon from 2007. (David Horsey / Los Angeles Times) 35 / 51 This David Horsey drawing is a reconfiguration of a cartoon he first published in 2006. (David Horsey / Los Angeles Times) 36 / 51 Donald Sterling, owner of the L.A. Clippers, should give Cliven Bundy a call. After Sterling loses his NBA franchise and the deadbeat Nevada rancher loses his cattle, the two old racists will both need a buddy. Maybe they can team up together and open an all-white rodeo. (David Horsey / Los Angeles Times) 37 / 51 Besides sending a chill up the spine of the international community, Vladimir Putin has accomplished one other thing by seizing Crimea and threatening the rest of Ukraine: Putin has brought back the bear. (David Horsey / Los Angeles Times) 38 / 51 The right-wing insurrection at the Bundy ranch in Bunkerville, Nev., has taken another weird turn with new revelations about the family history of Cliven Bundy. (David Horsey / Los Angeles Times) 39 / 51 See full story» (David Horsey / Los Angeles Times) 40 / 51 See full story» (David Horsey / Los Angeles Times) 41 / 51 See full story» (David Horsey / Los Angeles Times) 42 / 51 See full story» (David Horsey / Los Angeles Times) 43 / 51 See full story» (David Horsey / Los Angeles Times) 44 / 51 See full story» (David Horsey / Los Angeles Times) 45 / 51 David Horsey / Los Angeles Times (David Horsey / Los Angeles Times) 46 / 51 See full story» (David Horsey / Los Angeles Times) 47 / 51 See full story» (David Horsey / Los Angeles Times) 48 / 51 See full story» (David Horsey / Los Angeles Times) 49 / 51 See full story» (David Horsey / Los Angeles Times) 50 / 51 See full story» (David Horsey / Los Angeles Times) 51 / 51 See full story» (David Horsey / Los Angeles Times)\nAnd it is not bad that the tax plan is, at this point, little more than a ploy to give the illusion of action. It is a rehash of the voodoo economics that have clouded Republican minds since Ronald Reagan. It is built on the theory that huge tax cuts for big corporations and billionaires will create so many jobs and so much economic activity that the dramatic drop in tax rates will magically produce a gush of revenue for the government, thereby avoiding an increase in the federal debt. Treasury Secretary Steven Mnuchin made this discredited claim when he presented the skeleton of the “plan” on Wednesday.\nAdvertisement\nNot many fell for it, including Republican budget hawks who remember what happened when President George W. Bush dramatically cut taxes and failed to make the budget cuts needed to make up for the lost revenue: skyrocketing deficits and debt. Trump is no better witch doctor than Bush; the voodoo doesn’t work.\nThe Trump administration’s proposed federal budget would make draconian cuts in many government programs and agencies, but all that money is not saved — it gets shifted to the military. Then Trump wants to throw in the escalating cost of the border wall and a major new infrastructure spending program. Top that with big tax cuts and, within a decade, another $7 trillion will be added to the federal debt. That level of government borrowing would be a drag on the economy that would stifle business and kill jobs, not encourage growth.\nAllowing business tycoons to pay a low 15% corporate tax rate instead of a significantly higher personal tax rate — one of the elements of the administration proposal — would be great for rich guys like Trump, but that is not exactly what the president’s loyal followers were hoping for when they decided to take a chance on a celebrity real estate mogul with zero experience in government. The plan’s elimination of the estate tax would help out the extremely tiny percentage of Americans whose net worth is greater than $11 million, but the other 99.8% of us might be better off if the government kept that tax money to pay for pure air, water and food or for medical research that will keep us alive a bit longer or for a State Department robust enough to keep our kids out of future wars.\nThe sketchy tax plan is further proof that Trump’s expressions of empathy for the struggling working men and women of the country are the cheap words of a perpetual salesman. Still, we can be grateful that a man with so many bad ideas is mostly talk and no follow-through.\nDavid.Horsey@latimes.com\nFollow me at @davidhorsey on Twitter",
    "label": 3
}