{
    "index": 8,
    "text": "— -- The National Security Agency will cease collecting internet communications that merely mention an individual who is considered to be a “foreign intelligence target.”\nThe move is being welcomed by privacy advocates who have criticized the earlier practice as the collection of domestic communications by an agency intended to intercept only foreign communications.\nThe agency will now limit its collection to specific internet communications that are sent directly to or from a foreign target.\n“NSA will no longer collect certain internet communications that merely mention a foreign intelligence target,” a news release posted on the agency’s website said.\nThe National Security Agency collects intercepted voice and data communications, known as signals intelligence, that are made overseas.\n“The Agency will stop the practice to reduce the chance that it would acquire communications of U.S. persons or others who are not in direct contact with a foreign intelligence target,” the release added.\nThe NSA said it will also delete “the vast majority” of the casual mentions of individuals who are foreign targets \"to further protect the privacy of U.S. person communications.\" What’s known as \"about\" information may consist of the mention of a targeted email address found \"in the text or body of the email, even though the email is between two persons who are not themselves targets.\"NSA will delete the vast majority of its upstream internet data to further protect the privacy of U.S. individuals’ communications “to further protect the privacy of U.S. person communications.”\nThe change is being made after an internal review of section 702 of the Foreign Intelligence Surveillance Act that “discovered several inadvertent compliance lapses.”\nCrafted to fight international terrorism and cyberthreats, section 702 allows the intelligence community to conduct surveillance on specific foreign targets located outside the United States.\nSet to expire later this year, it could be reauthorized by Congress.\nThe collection of “about” and “upstream” communications had been criticized as a means of domestic surveillance collection by the NSA, which collects foreign communications.\n“This development underscores the need for Congress to significantly reform Section 702 of FISA, which will continue to allow warrantless surveillance of Americans,” said Neema Singh Guliani, American Civil Liberties Union legislative counsel.\n“While the NSA’s policy change will curb some of the most egregious abuses under the statute, it is at best a partial fix,” Guliani added.\n“Congress should take steps to ensure such practices are never resurrected and end policies that permit broad, warrantless surveillance under Section 702, which is up for reauthorization at the end of the year.”",
    "label": 2
}