{
    "index": 428,
    "text": "Here's what the FBI's James Comey said about Clinton's emails, Russia and WikiLeaks\nShow Caption Hide Caption Dems press Comey on Clinton, Trump probes FBI Director James Comey is maintaining that he did not treat disclosures about investigations into Hillary Clinton's emails and potential connections between the Trump campaign and Russia differently. (May 3) AP\nFBI Director James Comey was fired by President Trump on Tuesday, becoming the latest person to be dismissed in the early days of Trump's presidency.\nLast week, Comey answered senators' questions about the probe into Hillary Clinton's emails, Russia and Wikileaks. Here are some key quotes from his testimony before the Senate Judiciary Committee:\nOn the timing of his announcement\n\"I could see two doors, and they were both actions: One was labeled 'speak,' the other was labeled 'conceal,'\" Comey said of his decision to inform lawmakers in late October about possible new evidence in the probe of Hillary Clinton's use of a private email server when she was secretary of State.\n\"Because here's how I thought about it... Having repeatedly told this Congress that we're done and there's nothing there, there's no case there, to restart, in a hugely significant way, potentially finding the emails that would reflect on her intent from the beginning, and not speak about it would require an act of concealment, in my view.\n\"And so I stared at 'speak' and 'conceal.' 'Speak' would be really bad, there's an election in 11 days. Lordy, that would be really bad. 'Concealing,' in my view, would be catastrophic. Not just to the FBI, but well beyond. And honestly, as between 'really bad' and 'catastrophic,' I said to my team, 'We've gotta walk into the world of really bad.\"\nOn how he felt afterward\n\"Look, this is terrible,\" he said of the email revelation. \"It makes me feel mildly nauseous that we might have had some impact on the election. But honestly, it wouldn't change the decision. Everybody who disagrees with me has to come back to Oct. 28 with me and stare at this and tell me what you would do.\"\nOn the hacking of the Democratic National Committee\n\"We have high confidence that the Russians did the hacking of the DNC and other organizations,\" he said, referencing the release of thousands of emails from the Democratic organization and its key staffers.\nOn why he talked about the Clinton email investigation but didn't talk about the probe into Trump and Russia\n\"I think I treated both investigations consistently, under the same principles,\" he said, saying that the Trump investigation was still in its early stages. \"People forget, we would not confirm the existence of the Hillary Clinton email investigation until three months after it began.\"\nOn whether Russia is still involved in American politics\n\"Yes,\" he said, answering a question from Sen. Lindsey Graham, R-S.C. Also, when it comes to preserving the democratic process free from foreign interference, he said Russia is \"the greatest threat to any nation on earth, given their intention and their ability.\"\nOn WikiLeaks\n\"To my mind, it crosses a line when it moves from being about trying to educate a public and instead just becomes about intelligence porn, frankly,\" he said, criticizing the antisecrecy organization's release of the classified information and private information that had been stolen by hackers. \"Just pushing out information about sources and methods without regard to interest, without regard to the First Amendment values that normally underlie press reporting and simply becomes a conduit for the Russian intelligence services or some other adversaries of the United States, just to push out information that damages the United States.\"",
    "label": 2
}