{
    "index": 740,
    "text": "After racking up an estimated $22 million travel tab in less than three months, Donald Trump is well on his way to spending more in a single year than Barack Obama spent on travel during all eight years of his presidency.\nTrump has spent 21 days of his 80-day presidency at his Mar-a-Lago resort in Palm Beach, at an estimated cost of $21.6 million in travel and security expenses, CNN reported. In contrast, Obama spent a total of just under $97 million during his entire presidency, according to costs estimated by Judicial Watch.\nAdvertisement\nAt Trump’s current pace, he will spend $99 million by the end of his first year in office. That would add up to close to $800 million if he served an eight-year term as Obama did.\nPresident Trump has already spent one-fourth of his presidency hanging out at his Mar-a-Lago resort in Palm Beach. Cost to taxpayers: $22 million. David Moir / Reuters\nIt’s not clear if Trump will continue his frequent trips to the Florida resort as the temperatures rise. Earlier this month, however, he changed his nickname for Mar-a-Lago from the “Winter White House” to the “Southern White House,” signaling that his trips down south wouldn’t be confined to the winter months.\nTrump’s frequent visits to South Florida have also taken a toll on the area. Last month, Rep. Lois Frankel (D-Fla.) asked Trump to help pay for the extra security his visits require, a service that has already cost the community $1.7 million.\nAdvertisement\n“Please step up to the plate and help us get this money back,’” said Frankel, per WPBF. “And if you’re unable to do that, consider curtailing your travel.”\nShe suggested Camp David as an alternative.\nFlorida lawmakers have also suggested imposing special taxes on Mar-a-Lago to help defray costs. Palm Beach County Sheriff Ric Bradshaw estimated that Trump’s meeting with Chinese President Xi Jinping cost the community $250,000 in police overtime.\nTaxpayers are also footing the bill for a second presidential residence at Trump Tower in Manhattan, where first lady Melania and son Baron reside. NYPD officials estimated that they spend $500,000 a day on security, CNBC reported.\nTrump’s inflated travel expenditures have become a particularly touchy subject, given the extensive budget cuts he has proposed. Voters and politicians have even started comparing Mar-a-Lago costs to federal funds that could save a program destined for the chopping block.\nTrump has often boasted that he doesn’t need vacations and prefers to work. He even blasted Obama’s golfing in tweets some 26 times, and at campaign rallies.\nAdvertisement\n\"Don't take vacations. What's the point? If you're not enjoying your work, you're in the wrong job.\" -- Think Like A Billionaire — Donald J. Trump (@realDonaldTrump) November 19, 2012\nWe pay for Obama's travel so he can fundraise millions so Democrats can run on lies. Then we pay for his golf. — Donald J. Trump (@realDonaldTrump) October 14, 2014\nYesterday @BarackObama actually spent a full day in Washington. He didn't campaign, fund raise or play golf. Shocking. — Donald J. Trump (@realDonaldTrump) November 22, 2011\nSecurity issues at Mar-a-Lago, which lacks the same protections and visitor vetting as the White House, have also raised concerns. In March, the Government Accountability Office agreed to examine the costs and security issues surrounding Trump’s frequent visits to Mar-a-Lago.\nSome critics claim that Trump’s frequent trips away from the White House serve to keep his activities far from the public eye. According to Politico, the president was seen chatting with the conservative billionaire Koch brothers, Charles and David, at the resort last weekend.",
    "label": 3
}