{
    "index": 190,
    "text": "(CNN) FBI Director James Comey addressed senators for four hours Wednesday, giving testimony to the Senate judiciary committee mostly related to Russia's meddling in the US election last year.\nIn that time, Comey touched on a variety of subtopics and revealed a lot of his thinking that had gone on behind the scenes.\nHere are 10 things we learned:\n1. Bill Clinton's meeting with Attorney General Loretta Lynch proved disastrous\nComey said he decided to go public with his findings from the Hillary Clinton email investigation following former President Bill Clinton met privately with Attorney General Loretta Lynch. Comey said he felt he had to prove the FBI was independent from political influence.\n\"Her meeting with President Clinton on that airplane was the capper for me, and I then said, 'You know what? The department cannot, by itself, credibly end this,'\" Comey said.\nNot long after their meeting, Comey publicly chastised Hillary Clinton for using a private email in a news conference that laid the groundwork for the October surprise revelation by Comey that he was looking again at her emails.\n2. FBI investigators thought Anthony Weiner had the missing Clinton email trove\nFBI investigators reviewing former Rep. Anthony Weiner's computer in an unrelated case discovered he had thousands of emails from Hillary Clinton's Verizon Blackberry account -- which they believed were the missing Clinton emails, Comey told the Senate Judiciary Committee.\nThat discovery set the ball rolling on a series of events that many Democrats argue -- including Hillary Clinton -- cost the election. Comey said he alerted Congress of the finding, with the full expectation that lawmakers would leak that discovery.\nBy the time investigators determined they were not the missing emails -- and it did not change their initial decision not to seek prosecution -- the national narrative had already shifted back to Clinton's emails, with just days left before the election.\n3. The FBI investigated Weiner and Abedin for mishandling classified information\nAfter the discovery of Clinton's emails, the FBI opened an investigation into whether Weiner and Huma Abedin had mishandled classified information in Clinton's emails. But, Comey said, they determined there was no criminal intent from either one and decided not to seek charges.\n\"Somebody should be prosecuted for letting Anthony Weiner have access to classified intelligence,\" Sen. Lindsey Graham said.\nComey replied: \"There's no Anthony Weiner statute.\"\n4. Sally Yates alerted Comey that Flynn could be vulnerable to blackmail\nComey confirmed that then-acting Attorney General Sally Yates alerted him in January that former National Security Adviser Michael Flynn had lied about his conversations with Russian ambassador to the US Sergey Kislyak, and could be vulnerable to blackmail. Yates is expected to tell a Senate Judiciary subcommittee led by Sen. Lindsey Graham the same thing in testimony this coming Monday.\n5. Russia is still \"active\" in US politics\n\"Is it fair to say the Russian government is still involved in American politics?\" Graham asked.\n\"Yes,\" Comey said.\nComey and other intelligence officials have publicly said they're counting on Russia trying to influence US elections from here on, using similar tactics to what they used in 2016.\nOne rebuttal that Comey said will work is creating \"good troll armies\" online to counter Russian disinformation campaign.\n6. Comey sees a difference between regular journalism and 'intelligence porn'\nComey has forever given the world a new term for WikiLeaks' unmitigated style of unauthorized intelligence dumps: \"intelligence porn.\"\nResponding to a question from Sen. Ben Sasse whether he considered WikiLeaks to be journalism, Comey went off\n\"To my mind it crosses a line when it moves from being about trying to educate a public and instead just becomes about intelligence porn, frankly,\" Comey said. \"Just pushing out information about sources and methods without regard to interest, without regard to the First Amendment values that normally underlie press reporting, and simply becomes a conduit for the Russian intelligence services or some other adversary of the United States.\"\n7. The Justice Department is going after leakers\nSenate Judiciary Chairman Chuck Grassley peppered Comey, pressing him on what the FBI was doing to stop the recent spate of leaks. The line of questioning is similar to questions House Republicans pressed Comey on during the House Intelligence Committee hearing in March.\n\"Leaks are always a problem, but especially in the last three-to-six months,\" Comey said, noting that he wouldn't confirm any specific investigations into leaks. \"Where there is a leak of classified information, the FBI -- if it's our information -- makes a referral to the Department of Justice.\"\n8. Comey felt \"nauseous\" thinking he affected the election\nComey clearly labored over the decision to announce, in October, that he was looking again at Clinton's emails, saying the thought that he affected the outcome made him feel \"mildly nauseous.\"\n\"Look, this is terrible. It makes me mildly nauseous to think that we might have had some impact on the election,\" Comey said. \"But honestly, it wouldn't change the decision.\"\n9. Trump blasts don't bother Comey\nWednesday's public hearing marked the second time Trump knocked his own FBI director around the time of his public hearing. In March, Trump sub-tweeted Comey throughout the actual House hearing, repeatedly misstating testimony he was delivering.\nLate Tuesday night, Trump tweeted \" FBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds!\"\nComey brushed it off Wednesday, saying he didn't give Clinton a free pass.\nWhite House Press Secretary Sean Spicer later explained that Trump \"has confidence in the director.\"\n10. The FBI is still investigating ties between the Trump campaign and Russia\nGraham asked Comey if the Trump Russia investigation was still under way.\nComey responded, \"Yes.\"",
    "label": 3
}