{
    "index": 438,
    "text": "Religious conservatives mixed on Trump's order targeting birth control, church involvement in politics\nShow Caption Hide Caption President Trump signs executive order on religious freedom President Donald Trump is seeking to further weaken enforcement of an IRS rule barring churches and tax-exempt groups from endorsing political candidates, though his executive order on religious freedom is disappointing some of his supporters. Time\nWASHINGTON – Before a crowd of priests, nuns, and faith leaders, President Trump promised the executive order he signed Thursday would take \"historic steps to protect religious liberty\" in the United States. But some religious conservatives who supported his candidacy were left wanting more.\nActivists called the executive order Trump signed in the Rose Garden on the National Day of Prayer a mere shadow of a draft that leaked earlier this year, and woefully inadequate.\n“President Trump must continue to work to protect religious freedom,” said Paul Weber, president of the Family Policy Alliance.\nTrump’s executive order targeted the Johnson Amendment, a provision of tax law which prohibits churches from getting directly involved in political campaigns – and has long chafed some evangelical activists.\nBut the order stopped short of Trump's vow to “totally destroy” the amendment, instead instructing the Internal Revenue Service to enforce the law consistent with how it’s done so in the past — allowing speech on political and moral issues as long as it doesn’t advocate the election or defeat of a particular candidate. Only Congress can change that law to allow churches to endorse candidates without losing their tax-exempt status.\nThe Executive Order on Promoting Free Speech and Religious Liberty also aims to make it easier for employers with religious objections not to include contraception coverage in workers' health care plans, although it would be up to federal agencies to determine how that would happen.\nVowing to fight what he called discrimination against religious people and institutions, Trump said, \"We will not allow people of faith to be targeted, bullied, or silenced any more.\"\nYet even as Trump promised his executive order makes it \"clear that the federal government will never, ever penalize any person for their protected religious beliefs,\" the activists were not convinced they would avoid punishment if they refused to provide services or benefits on religious or moral grounds.\nCiting an Agriculture Department order that required a Michigan meatpacking plant to remove literature objecting to same-sex marriage from a break room table in 2015, a senior counsel at the Alliance Defending Freedom, Gregory S. Baylor, said Trump's order offers \"no specific relief\" to people \"threatened with the effective closure of their family-run business for simply expressing a religious point of view on marriage that differed from that of the federal government.\"\nSome conservative religious groups praised the order's provision directing the IRS to exercise restraint in enforcing the Johnson Amendment's prohibition on church involvement in political campaigns. But Baylor said it doesn't go far enough. \"Americans cannot rely on the discretion of IRS agents, some of whom have abused that discretion for years to silence pastors and intrude into America’s pulpits,\" he said.\nAnd Ohio Rep. Warren Davidson, who led dozens of conservative lawmakers last month in a letter urging the administration to move forward with the more far-reaching executive order, said the final version fails to roll back \"some of the worst progressive mandates from the Obama era.\"\nDavidson said protections are still needed for religious organizations, military chaplains, schools, federal contractors and schools with a religious mission, and promised to try to address that through legislation. For his part, Weber from the Family Policy Alliance wants to make sure health care entities are not obligated to provide gender transition therapies, and that women's homeless shelters are not required to admit transgender people.\nSome influential religious conservatives though, praised Trump for paying special attention to this issue while in the Oval Office. Tony Perkins, president of the Family Research Council who worked closely with the administration on this issue, called the order a \"good first step.\"\n“This is a multi-step process,” Perkins said after attending the ceremony.\nThe order says it's the administration's policy to \"vigorously enforce federal law's robust protections for religious freedom\" and directs the Justice Department to issue guidance interpreting religious liberty protections in the law. ​Perkins said that will set in place a process for \"not just protection, but promotion of religious freedom.\"\nMeanwhile, civil rights groups have vowed to file a legal challenge against any action they believe would allow people to deny benefits or services to those they oppose. “Donald Trump just let the fox into the hen house,” Sarah Warbelow, the legal director for the Human Rights Campaign. “We are watching and we will challenge any effort by [Attorney General] Jeff Sessions or other agencies of Trump’s administration to license discrimination.”\nAmong the issues the group will be watching include any changes to 2011 rules that ensure same-sex spouses can visit a partner in a hospital, and that people can’t be barred from federally-funded housing on the basis of their sexual orientation or gender identity.\nAfter initially threatening to sue the administration for undermining the country's “longstanding commitment to the separation of church and state,\" the American Civil Liberties Union said it would back off – for now – because it found the order to be more flash than substance. “Today’s executive order signing was an elaborate photo-op with no discernible policy outcome,\" said ACLU executive director Anthony D. Romero. “The directive to federal agencies to explore religious-based exceptions to healthcare does cue up a potential future battle, but as of now, the status quo has not changed.\nTrump views his actions as the fulfillment of campaign pledges. He sees the Johnson amendment as a violation of free speech rights. \"I spoke about it a lot\" during last year's presidential campaign, and \"promised to take action,\" he said.\n\"We're a nation of believers,\" Trump told supporters. \"Faith is deeply embedded into the history of our country... No American should be forced to choose between the dictates of the federal government and the tenets of their faith.\"\nThings appear to be moving quickly. Right after the order was signed, Health and Human Services Secretary Tom Price promised to take action “in short order” to \"safeguard the deeply held religious beliefs of Americans who provide health insurance to their employees.”\nAt the ceremony, Trump gave a special callout to members of the Little Sisters of the Poor, an order of nuns which runs homes for the elderly which was one of the groups that challenged Obamacare's requirement that insurance plans cover birth control. The group objected to the Obama administration’s policy that while religious organizations don’t have to directly provide birth control to employees through their plans, workers could still get it through a third party.\n\"Your long ordeal will soon be over,\" he promised.\nEven as some faith leaders say the order does not go far enough, others say the order is too extreme and would do more harm than good.\nRabbi Jack Moline, president of the Interfaith Alliance, called the steps to ease enforcement of the provision a \"payment to religious extremists for their support\" which will \"do more to compromise religious freedom than any action in recent memory.\"\n\"That minority of clergy – almost all from the Religious Right – who want to impose their private partisanship on their congregations will be emboldened to turn worship into campaign rallies,\" Moline said.\nWhat's more, while the order does not repeal the Johnson Amendment – only Congress can do that – some religious organizations oppose tampering with it at all.\nA coalition of 99 religious groups sent a letter to Congress calling for the retention of the Johnson Amendment, noting that religious leaders can speak out on political issues in their private capacities, and often do so, despite the Johnson Amendment.\nPassed in 1954 – and named for then-Texas Sen. Lyndon Johnson, the future president – the Johnson Amendment says that churches and other non-profit institutions that are exempt from taxation \"are absolutely prohibited from directly or indirectly participating in, or intervening in, any political campaign on behalf of [or in opposition to] any candidate for elective public office.\"\nThe IRS says that \"violating this prohibition may result in denial or revocation of tax-exempt status and the imposition of certain excise taxes.\"\nYet the Johnson amendment only prohibits them from using tax-exempt houses of worship to endorse candidates or make campaign contributions – as the religious groups point out in their letter.\nThe last time the IRS investigated a house of worship for violating the restriction was 2009, according to advocacy group Americans United for Separation of Church and State.\n\"It is clear that churches and church leaders already have robust free speech rights,\" Maggie Garret, the group's legislative director, said in prepared remarks for a congressional hearing Thursday on the issue.\nAdding fuel to the fire, a coalition of nearly 4,500 charitable, philanthropic and religious organizations sent a letter to Congress opposing weakening federal tax law restrictions on political activity by nonprofits. The groups said that would \"would damage the integrity and effectiveness of all charitable organizations and spawn litigation.\"",
    "label": 3
}