{
    "index": 478,
    "text": "Trump names 10 conservatives for federal courts\nWASHINGTON — President Trump borrowed a page from George W. Bush's playbook Monday by announcing plans to nominate 10 federal court judges en masse, almost 16 years to the day that Bush named 11 appeals court judges — including a Washington lawyer named John Roberts who soon became chief justice of the United States.\nTrump's action represents the opening salvo in what will be at least four years of battles with Senate Democrats over the federal judiciary, one that the president intends to pack with conservatives after President Barack Obama spent eight years tilting nearly every circuit court to the left.\nIt also elevates some rising legal stars who made it on to Trump's original list of 21 potential Supreme Court justices last year, putting them closer to the nation's high court at a time when Justice Anthony Kennedy, the court's swing vote, is contemplating retirement and two liberal justices, Ruth Bader Ginsburg and Stephen Breyer, are long past the average retirement age.\nTwo judges from that list were among the 10 nominees named Monday. Joan Larsen, 48, a Michigan Supreme Court justice, was nominated to serve on the U.S. Court of Appeals for the 6th Circuit. David Stras, 42, a Minnesota Supreme Court justice, was nominated for the 8th Circuit. Previously, federal district court Judge Amul Thapar of Kentucky, who also made Trump's high court list, was nominated to the 6th Circuit.\nOthers in line for federal appeals courts are Notre Dame law professor Amy Coney Barrett, Kentucky lawyer John Bush and former Alabama solicitor general Kevin Newsom. Those in line for district courts are Dabney Friedrich, Terry Moorer, David Nye and Scott Palk, while Damien Schiff was in line for the U.S. Court of Federal Claims.\nRead more:\nConservative legal activists applauded the list of nominees, just as they had Trump's selection in January of federal appeals court Judge Neil Gorsuch for the Supreme Court seat vacated a year earlier by Justice Antonin Scalia. Gorsuch, 49, was confirmed last month.\n\"When it comes to fulfilling his campaign promise to appoint strong, principled judges, Trump is knocking it out of the park,\" said Carrie Severino, chief counsel of the conservative Judicial Crisis Network, which spent millions of dollars to help win Gorsuch's confirmation.\nCombined with Thapar's earlier nomination, Trump now has named six people to serve on federal appeals courts, the traditional stepping stones to the Supreme Court. That's one-fourth of the total number of vacancies on those regional courts.\n\"The large number of judicial vacancies gives President Trump a historic opportunity to move the federal courts in the right direction -- towards constitutionalism and away from judicial activism -- in just four years,\" said Curt Levey, president of the conservative Committee for Justice.\nIt took Obama eight years to liberalize a majority of federal appeals courts. At the end of Bush's presidency, 10 of the 13 circuit courts had a majority of judges nominated by Republican presidents. Today, nine of them have a majority of Democratic presidents' nominees — including the U.S. Court of Appeals for the 4th Circuit in Richmond, which will hear oral arguments Monday on the administration's effort to impose a travel ban on immigrants from six predominantly Muslim countries.\nTrump can reverse that advantage in just one term, establishing Republican control over nine appeals courts and leaving three others deadlocked, based on current retirement trends. Only the special appeals court created in 1982 to hear patent and trademark cases would retain a majority of Democratic appointees.\nThe projected reversal is crucial, because while the Supreme Court hears only about 75 cases each term, the appeals courts hear some 30,000. Only the most significant or divisive find their way to the high court, which has slashed its caseload in recent decades.\nFederal appeals courts have played a particularly crucial role in the past year. Scalia's death in February 2016 left the Supreme Court with only eight members. Republicans' refusal to confirm Obama's nominee — Merrick Garland, the chief judge of the D.C. Circuit court — forced the justices to leave lower court rulings on Obama's immigration plan and the power of labor unions intact following 4-4 votes. Only last month did Gorsuch win confirmation and assume Scalia's seat.\nSenate Republicans and Democrats view the appeals courts as so important that confirmation battles have stretched longer than two years and led some nominees to withdraw from consideration. One of those nominated by Bush on May 9, 2001, was Miguel Estrada, considered at the time a potential future Supreme Court nominee. He was blocked by Senate Democrats for more than two years and ultimately withdrew.\nThe impact of appeals court judges is clear. Judges named by Obama to federal appellate and district courts overseeing North Carolina, Texas, Michigan and Wisconsin voted during the recent political campaign season against restrictions on voting imposed by Republican legislatures. In states where Obama's judges had less influence, such as Ohio and Virginia, courts left restrictions on voting in place.\nLooking ahead, Trump's appeals court judges could play major roles in cases testing the ability of religious objectors to sidestep government regulations, as well as cases involving the rights of criminal defendants. The Supreme Court's decision in June striking down abortion restrictions in Texas still leaves appeals courts with the job of deciding which types of limits to permit.\nAnother major impact Obama had on lower federal courts could be tested under Trump: the increased prevalence of women, minorities, gays and lesbians. About 43% of all his nominees were women and 36% minorities, surpassing previous records under Bill Clinton. Republican presidents have nominated less than half that number.",
    "label": 3
}