{
    "index": 440,
    "text": "Health care vote puts pressure on dozens of vulnerable GOP reps\nShow Caption Hide Caption Obamacare repeal passes in U.S. House: 217 yea, 213 nay House Republicans have passed legislation to repeal and replace the Affordable Care Act. USA TODAY\nWASHINGTON — Days after President Trump’s inauguration, Rep. Mimi Walters of California vowed to protect patients with pre-existing conditions in any plan to replace the Affordable Care Act.\nOn Wednesday she cast a vote for a plan allows insurance companies in some cases to charge higher premiums to people with cancer, diabetes and other common preexisting conditions — even pregnancy.\nIt’s a moment that could have significant consequences for the Republican Party, particularly House lawmakers like Walters. Her Orange County district is among a couple dozen that have just become more competitive for Democrats due to a vote on a Republican health care plan passed without a single Democratic vote, according to the nonpartisan Cook Political Report.\nThere’s no way GOP leaders could have gotten the bill approved without the support of vulnerable lawmakers like Walters, who sits in a district that Democrat Hillary Clinton won by six points in November. Republicans say the plan will eventually lower health care premiums, even if it results in fewer Americans being insured than under the current health system.\n“It’s called spending your political capital,” said David Wasserman, House editor of the nonpartisan Cook Political Report. “Elections have consequences and majorities tend to use their majority to do things that are unpopular,” said Wasserman, who told USA TODAY he is changing ratings on close to two dozen races to reflect the increased political liability.\n“It gives Democrats a really big vote to attack,” he said, citing members like Walters as well as fellow Californians Ed Royce and Dana Rohrabacher. Even before the vote, there were regular demonstrations outside all of their district offices.\nIn January, Walters tweeted that she is “committed to protecting patients w/ pre-existing conditions.”\nWe’re committed to protecting patients w/ pre-existing conditions to ensure their access to quality, affordable healthcare.It’s a #BetterWay https://t.co/XOSB6aRcAk — Mimi Walters (@RepMimiWalters) January 27, 2017\nIn a statement following the vote, she didn’t mention pre-existing conditions. “I gave the people of Orange County my word that I would work to ensure all Americans have access to an affordable, patient-centered healthcare system,” she said.\nProtecting sick Americans\nThe imperative of protecting sick Americans from the whims of a more capitalist, free market health care system was a key talking point for Democrats as well as Trump throughout the 2016 election. As recently as a few days ago, Trump even insisted such protections were part of his plan to replace the Affordable Care Act.\nThe current law does not and the original GOP bill would not allow insurers to set premiums based on health status. But an amendment would allow it for those who do not maintain continuous coverage, defined as a lapse of 63 days or more over the previous 12 months. Such policyholders could be charged higher premiums for pre-existing conditions for one year. After that, provided there wasn’t another 63-day gap, the policyholder would get a new, less expensive premium that was not based on health status.\nThe GOP vow to repeal and replace Obamacare was so central — both to Trump’s campaign and throughout the past seven years of Republican control of the House — that Republicans made a bet that doing nothing could be more costly if their base voters rebelled. Republicans say the legislation would bring down the price of premiums and stimulate more competition among insurers who are currently withdrawing from certain markets.\n“Donald Trump was elected president on the promise to repeal and replace Obamacare,” said Rep. Chris Collins, a Republican representing New York’s 27th district. “If we weren’t able to repeal and replace Obamacare, it would have been a bad midterm for us. I think we will at least hold our own, if not pick up seats,” he said.\nIndeed, conservative groups known for spending against Republicans who fail to back their agenda, including the Club for Growth, lauded the bill. “Republicans owe a debt of gratitude to conservatives for greatly improving the AHCA,” said Club for Growth president David McIntosh.\nThe legislation is unlikely to go anywhere in the Senate in its current form, with critical moderate Republicans, including Nevada’s Dean Heller, registering their disapproval within minutes after the vote. Yet members including Walters are now on the record supporting it going into the 2018 election cycle. It “is a serious problem for Republicans who come from Clinton districts who voted for this,” said Wasserman.\nIn all, there are 23 Republicans representing districts Democratic nominee Hillary Clinton won, and 14 of them supported the bill. Democrats need 24 seats to retake the House.\nYet the danger isn’t limited to these districts. According to an analysis by the New York Times’ Upshot, voters in districts that voted for Trump have the most to lose if the legislation were to become law. Those eligible for at least $5,000 less in tax credits supported Trump by a margin of 59% to 36%, according to the analysis based on the previous version of the bill.\nAt the same time, taxpayers in counties that backed Trump would see less of a gain in tax relief (about $6.6 billion) compared to counties that backed Clinton (about $21.9 billion), according to a Bloomberg analysis based on the initial bill.\nMoments after the vote, the Democrats’ official campaign organization blasted out an email announcing a digital ad campaign in 30 Republican-held districts, including those of some of the most vulnerable Republicans who were initially skeptical of the bill but supported it after a new amendment was added, including Reps. David Valadao and Jeff Denham of California. The amendment worth $8 billion was intended to offset some of the costs of high-risk patients.\nThe big question is whether the GOP health plan will be as big a liability for the party as Obamacare was for Democrats in 2010, when they lost control of the House. According to a Kaiser Family Foundation tracking poll, the number of Americans viewing Obamacare favorably was up to 48% by late April.\nDemocrats say they are targeting even vulnerable Republicans like Virginia’s Barbara Comstock who voted against the bill. “Every single House Republican owns this,” said Tyler Law, a Democratic Congressional Campaign Committee spokesman.\nHouse bill\nThe House bill would not fully repeal the 2010 Affordable Care Act, but it would kill major elements of that Democratic law. It would prune taxes, subsidies and mandates under the law and trim Medicaid. Current tax credits, which are based on income and the cost of health insurance in their local market, would be replaced with less generous tax credits based on age. It would create pools for high-risk patients but also allow insurance companies to opt out of \"essential benefits\" including maternity and emergency care. Prior to the Affordable Care Act, the majority of states did not have such coverage protections.\nDemocrats say allowing insurance companies to discriminate will inevitably hurt the sickest, oldest and most vulnerable. They cite opposition by major groups representing doctors, nurses, hospitals and seniors, including the AARP and the American Medical Association. The bill effectively creates an “age tax” on old Americans, Democrats say, and it will actually raise premiums in short term, according to CBO.\nRepublicans including Tim Walberg of Michigan cited a lot of “myths that are being spun,” citing a number of markets where insurers are withdrawing from Obamacare's individual exchange markets and arguing that more competition among insurance companies will bring down premiums. “We tried the Obamacare way. It is failing remarkably and the American people are demanding a change,” said Rep. Kevin McCarthy of California, the House majority leader.\nYet Republicans did not receive a score for the legislation from the nonpartisan Congressional Budget Office after a final amendment was added to draw more moderate Republican support. The amendment threw an extra $8 billion intended to offset the costs of high-risk patients.\nThe prior version would have resulted in 24 million losing insurance, according to CBO. The Center for American Progress estimated on Tuesday that the version the House voted on underfunds high-risk pools by $200 billion over 10 years.\nTown hall pressure\nWalters is among the Republicans already under significant pressure from her constituents, a number of whom have created a group called the California 45th Town Hall Group to pressure her to meet face-to-face with constituents.\nAccording to the group, it was formed because constituents have made “repeated, formal” requests for an open format town hall. She has declined and earlier told a radio station that the “whole goal is to try to get me to say something that they could use against me.”\nThat pressure is only likely to intensify over a congressional break that starts this weekend.\n“You have every provision of this bill tattooed on your forehead. You will glow in the dark,\" said Rep. Nancy Pelosi, the top Democrat in the House.\nRead more:",
    "label": 3
}