{
    "index": 474,
    "text": "At college commencement speeches in 2017, it's a no-Trump zone on most campuses\nShow Caption Hide Caption College commencement speeches expected to be a 'no-Trump zone' If you’re attending a college commencement address, you should probably leave the 'Make America Great Again' and pink hats at home. Nathan Rousseau Smith (@fantasticmrnate) explains why. Buzz60\nCaution: If you attend a campus commencement address this spring, you could be entering a no-Trump zone.\nMost college and university graduation speakers contacted by USA TODAY said they would not address the elephant in the stadium. And mention of the president and party politics has been conspicuously absent from the speeches that already have been given.\n“If they invited a politician to speak, they’d get what they expected. Since they didn’t, I’ll take that as a direction’’ and avoid the subject, said former NASA astronaut Kathryn Thornton, who may speak about space exploration at Sweet Briar College in Virginia.\n“Anybody whose commencement speech could be put on the editorial page of a newspaper doesn't understand the job,’’ said Anthony Esolen, an English literature scholar who will speak at Hillsdale College in Michigan. His advice: “Leave the shifting sand dunes of the day far behind.’’\nAs for Trump, he asked, “Why on earth should I mention the president? …. I have instead to decide whether I will talk about Milton or Dante or Dr. Johnson…’’\nThat seems like a sound approach to Cristina Negrut, a connoisseur of commencement speeches who founded the website graduationwisdom.com. Love Trump or hate him, “we already have enough people trying to label him, like Meryl Streep at the Golden Globes,’’ she said. “Another label – ‘liar’ or something -- is not helpful.’’\nThe talk at graduation is of everything but Trump, including memories of a graduation past (writing coach Roy Peter Clark at Providence College); indigenous American languages (2016 MacArthur genius grant winner Daryl Baldwin at Miami University in Ohio); mountain climbing (mountaineer Conrad Anker at the University of Utah).\nSpeakers cited tried and true rules for commencement speeches to explain why they will not talk about the man everyone else is talking about.\nIt’s about the graduates, not the speaker’s politics\nThe most common piece of advice a first-time graduation speaker receives may be “it’s not about you.’’ It’s good counsel, said CNN political analyst Fareed Zakaria, who has delivered commencement addresses at Harvard, Sarah Lawrence and the University of Oklahoma, and this year speaks at Bucknell. “My views on Donald Trump are well known and easily discoverable. There’s no need for me to impress them on students and their families.’’\nBut it’s not all about the graduates\nEven if the graduate would enjoy hearing the speaker trash the president, Grandpa or Grandma – who keeps Fox News on all day – might not. And it’s his day, too.\nAccentuate the positive\n“You want to strike a celebratory note,’’ Esolen said, and an optimistic one. These days, that pretty much rules out politics. “I’ll leave notions of ‘American carnage,’ for another venue,’’ Thornton said – a dry allusion to the signature phrase in Trump’s inaugural address\nEliminate the ephemeral\nEsolen said politics is fine in a commencement speech – “if you are talking about Edmund Burke or Tocqueville or Aristotle.’’\nThe writer Anna Quindlen, who estimates she’s given three dozen commencement speeches over the years, plans to strike a similar note at Washington University in St. Louis: “I prefer to try something that will stand the test of time.’’\nJonathan LaPook, CBS News’ medical correspondent and an NYU professor of medicine, said he doesn’t plan to touch on the Affordable Care Act debate when he speaks at the Quinnipiac University Medical School: “This is their first graduating class, so I have to be a little evergreen.’’\nMake ‘em laugh\n“Funny speeches are best,’’ said Negrut, the speech maven. She points approvingly to Modern Family sitcom creator Steve Levitan’s You Tube video previewing his speech this month at his alma mater, the University of Wisconsin-Madison. It features MF’s Phil Dunphy (Ty Burrell) announcing Levitan as the speaker, but claiming never to have heard of him.\nZakaria said that if he mentions Trump at all, he will probably do so humorously, because “there is so much about him that lends itself to humor.‘’ But that also is tough, he said: “There is so much competition.’’\nClark, founder of the National Writers Workshop, recalls the uses of humor from his own graduation from Providence in the grim Vietnam War year of 1970, when spring classes ended early because of student anti-war protests.\nThe speaker was the political humorist Art Buchwald. He didn’t attack President Nixon by name, but let the graduates – some of whom who’d be drafted – know he understood their concerns about Nixon and the war. Clark never forgot how Buchwald ended: “Years from now, when people ask you what you did at your graduation, you can say you laughed.’’\nSincerity and levity\nSome speakers will talk about Trump. Maz Jobrani, the Iranian-American stand-up comedian, is giving the speech at his alma mater, UCal-Berkeley. “I have to talk about him, because I’m an immigrant,’’ he said. “The best graduation talks are sincere, and I have a lot of sincere feelings about his impact. He needs to take responsibility for his words.’’\nSome audiences want a political message. On a campus like Berkeley, which has become a battleground over political speech, an anti-Trump message presumably would resonate. A place like Liberty University in Virginia, where Trump himself will deliver the commencement, is another story.\n“How to handle the national zeitgeist at this particular moment is a struggle,’’ Quidlen said. “I'm hoping to speak to the graduates about who we are as individuals and as a nation, and who we hope to be, in a way that is informed at some level by the tone in Washington.’’\nDuring commencement season 2016, when Trump was the presumptive GOP nominee, he was the target of several high-profile attacks. At Stanford, documentarian Ken Burns accused Trump (without mentioning his name) of nurturing “an incipient proto-fascism’’ as well as “jingoistic saber rattling’’ and “dictatorial tendencies.’’\nHe acknowledged that it was an unusual setting for such a polemic, but said, “There comes a time when I -- and you -- can no longer remain neutral, silent.’’ He got a standing ovation.\nAt Johns Hopkins, director Spike Lee worried Trump would start World War III. At MIT, actor Matt Damon asked why, if our world is one of many simulations run by a superior civilization, “we're in the one where Donald Trump becomes the Republican nominee? Can we, like, transfer to a different one?'’\nThis year, many campus speakers are politicians – Joe Biden at Cornell, Colby and Harvard, Hillary Clinton at Wellesley and Medgar Evers College in New York City, Bernie Sanders at Brooklyn College, Sen. Elizabeth Warren at UMass-Amherst and Wheelock College, Vice President Mike Pence at the Naval Academy and Notre Dame and Trump as the Coast Guard Academy.\nIt’s not clear if their speeches will be partisan. One early return: House Democratic Leader Nancy Pelosi, speaking May 1 at Fisk University in Nashville, did not mention Trump, saying only that \"The election showed how much work needs to be done to rid our nation of negative attitudes…’’\nThornton, who teaches at the University of Virginia, said speakers should understand that the world will not long remember what they say: “I’ve been going to graduations for over 20 years and I can’t remember a word, or who gave it. I’m speaking on Saturday; by Sunday they’ll have forgotten everything. So I figure the pressure is off.’’",
    "label": 3
}