{
    "index": 175,
    "text": "Hillary Clinton on Monday launched her anticipated political action group, Onward Together, which will collaborate with and fund political organizations supporting the Democratic Party.\nIn an email announcing the nonprofit's installation, the former Democratic presidential encapsulated her broader mission, saying that a healthy democracy depends upon strong citizen engagement.\n\"To support this wave of grassroots organizing, we're launching Onward Together, an organization dedicated to advancing the progressive vision that earned nearly 66 million votes in the last election,\" read the statement, which also appears on the group's website. \"Onward Together will work to build a brighter future for generations to come by supporting groups that encourage people to organize and run for office.\"\nOnward Together will aid Indivisible Guide, a progressive organization adopting strategies from the Tea Party Patriots movement; Swing Left, an action group devising strategies for a Democratic House takeover in 2018; Color Of Change, an online organization for racial justice; Emerge America, an advocacy alliance for involvement of women in politics; and Run for Something, an organization aiding millennials seeking public office.\nWith guidance from former Democratic Chairman and Vermont Gov. Howard Dean, the group hopes to gain support, and donations, from the roughly 66 million voters who cast their ballots for Clinton in November.\nIn the email, Clinton praised political organization efforts such as the Women's March in January and credited them with paving a way forward for Democrats.\n\"From the Women's March to airports where communities are welcoming immigrants and refugees to town hall meetings in every community, Americans are speaking up and speaking out like never before,\" the statement read.\n\"The challenges we face as a country are real. But there's no telling what we can achieve if we approach the fights ahead with the passion and determination we feel today, and bring that energy into 2017, 2018, 2020, and beyond.\"\nClinton also promoted Onward Together in a series of eight tweets, adding that the group will continue to reach out to additional political organizations in the future and that supporters should \"stay tuned for more to come.\"\nWe're launching Onward Together to encourage people to get involved, organize, and even run for office. https://t.co/8exooosvZ5 — Hillary Clinton (@HillaryClinton) May 15, 2017\n.@IndivisibleTeam @swingleft .@ColorOfChange is organizing for criminal justice reform, voter freedom, fairness and accuracy in media, and other racial justice issues. — Hillary Clinton (@HillaryClinton) May 15, 2017\nA Clinton quote from March that reads \"resist, insist, persist, enlist\" greets visitors on the website's front page. Arrow graphics, similar to those used in Clinton's presidential campaign, line the bottom half of the page.\nThe website's design features play off of the Clinton campaign's bold, clean aesthetics, but its main difference lies in its renewed message of citizen engagement.\nCBS News reported earlier in May about reporting and speculation of the group's launch.\nAccording to a report by Politico, over the course of her travels and public speaking engagements in previous months, Clinton met with potential donors, strategists and advisers for the nonprofit.\nThose included Clinton's former campaign finance director Dennis Cheng, former Under Secretary of State for Public Diplomacy and Public Affairs at the U.S. State Department Judith McHale and longtime family adviser Minyon Moore.\nAs the Democratic Party revises its strategy in response to Mr. Trump's unexpected win and Republican control of both the House and the Senate, Clinton's group says it will play a role is assisting progressive groups in the lead up to the 2018 midterms.\n\"This year hasn't been what I envisioned,\" Clinton's sign-off tweet read, \"but I know what I'm still fighting for: a kinder, big-hearted, inclusive America. Onward!\"",
    "label": 3
}