{
    "index": 453,
    "text": "Richard Burr and Mark Warner seek records from Trump associates in Russia probe Senate committee is investigating Russian meddling in 2016 presidential race\nWASHINGTON — The Senate intelligence committee is asking at least four former Trump campaign associates to disclose any meetings they had with “any Russian official or representative of Russian business interests” by next Tuesday.\nThe committee is in the midst of investigating Russian meddling in last year’s presidential election and possible collusion by Trump campaign officials or associates.\nThe written requests, first reported by The Wall Street Journal and The New York Times Friday afternoon, also ask the former associates to make themselves available for committee staff interviews at mutually agreeable times. They also seek all communications records they have, including email and text messages, with Russian officials or business interests and any information regarding their “financial and real estate holdings related to Russia” between June 15, 2015 and Jan. 20, 2017.\nThose dates bracket the dates of Donald Trump’s announcement that he would seek the presidency and his inauguration.\nThe Times said the letters were sent to Trump associates Roger J. Stone, Carter Page, former National Security Adviser Michael T. Flynn and former Trump campaign manager and chairman Paul J. Manafort Jr. and were signed by Sens. Richard Burr, R-N.C., the committee’s chairman, and Mark Warner, D-Va., its ranking member.\nStone appears to have had prior knowledge of Wikileak’s plans to release email messages hacked from the Democratic National Committee that is now widely believed to have been the work of Russian intelligence. Page was the target of a Foreign Intelligence Surveillance Act warrant last year after officials concluded he was working as a Russian agent after leaving the Trump campaign.\nThe committee asked for all records of meetings by next Tuesday and of records of communication by May 19.\nUSA Today requests to Manafort Jr.’s lawyer, Reginald J. Brown, were responded to by his crisis communications spokesman, Jason Maloni, who declined to provide the committee’s letter.\nStaff interviews with the four, among others, have been anticipated since the Senate Committee began its probe. Parallel inquiries are being conducted by the House intelligence committee and the FBI. The Senate Judiciary Committee heard from FBI director James Comey on Wednesday in an open session and the House intelligence committee heard from him on Thursday in a closed session. Comey has confirmed the FBI is looking into the Russian meddling.\nThe Senate Judiciary Committee’s crime and terrorism subcommittee is scheduled to hear from Former Acting Attorney General Sally Yates on Monday who can expect to be asked about how she learned about Flynn’s communications with Russian Ambassador Sergey Kislyak during the transition. Those contacts led to Flynn’s subsequent firing.\nRead more:",
    "label": 2
}