{
    "index": 454,
    "text": "Iowa high court halts state's new abortion constraints\nShow Caption Hide Caption Discussion of lawsuit to block Iowa abortion restrictions Rita Bettis of ACLU-Iowa and Suzanna de Baca discuss lawsuit aimed at blocking 72-hour wait for abortions William Petroski/The Register\nDES MOINES — The Iowa Supreme Court issued an emergency order Friday stopping enforcement of a new state law that imposes a 72-hour wait on abortions at any stage of pregnancy.\nGov. Terry Branstad signed Senate File 471 at 8:30 a.m. CT Friday, and the state's highest court responded less two hours later by granting a temporary injunction at the request of Planned Parenthood of the Heartland and the American Civil Liberties Union of Iowa. Justice David Wiggins signed the order.\nThe drama over the new abortion restrictions followed the Thursday denial of a request for a temporary injunction from Judge Jeffrey Farrell in Polk County District Court. Planned Parenthood's lawyer said the organization had 44 patients scheduled for abortions in Iowa, including 33 medication abortion patients.\nPlanned Parenthood had contended that provisions of the new state law violate the Iowa Constitution, citing a lack of due process and equal protection rights. Besides a 72-hour waiting period, the law will require women to make two trips to a doctor to obtain an abortion, she said.\n► Thursday: Judge won't block Iowa law on 3-day wait for abortions\n► Thursday: Planned Parenthood asks to join suit against Kentucky abortion law\n► Wednesday: Tennessee lawmakers pass 20-week abortion ban\n\"This order immediately and temporarily blocks the challenged provisions of the law: the 72-hour minimum waiting period and medically unnecessary additional appointment,\" said Rita Bettis, ACLU-Iowa's legal director.\nTwenty-seven other states have some kind of waiting period though most are a single day, according to the Guttmacher Institute, a private research group that supports abortion rights. Missouri, North Carolina, Oklahoma and Utah have 72-hour wait periods; South Dakota's 72 hours specifically do not include weekends and state holidays.\nSuzanna de Baca, chief executive officer of Planned Parenthood of the Heartland, said the Supreme Court's temporary injunction allowed dozens of women to access the care they needed.\nHowever, in the two hours from Branstad's signing of the law to the injunction, havoc was wreaked on many patients’ lives, she said.\n\"One woman had driven seven hours to her appointment only to be told she couldn’t have the procedure today. Others were angry and upset at the intrusion into their lives,\" de Baca said. \"Our staff had to call some patients back who had just been told they would be unable to have a procedure today.\"\nWiggins' order said the temporary injunction prohibits enforcement of the provisions until the high court has an opportunity to review a response from the Iowa Attorney General's Office. The response is due by noon Monday.\nThe Iowa Supreme Court then will consider whether the injunction should remain in effect. Geoff Greenwood, a spokesman for Attorney General Tom Miller, said Friday that a response was being prepared.\nEarlier Friday morning, more than 50 Iowans opposed to abortion applauded as Branstad signed the legislation, which also will ban most abortions in Iowa 20 weeks after conception.\n► April: Kentucky's last remaining abortion clinic won't close ... for now\n► March: Iowa Republicans reverse course on 'fetal heartbeat' abortion bill\nFourteen other states — Alabama, Arkansas, Georgia, Indiana, Kentucky, Louisiana, Nebraska, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Texas and Wisconsin — also have codified that restriction in recent years, according to Guttmacher Institute research. Two additional states, Mississippi and North Carolina, have 20-week bans that calculate fetal age from a woman's last period, effectively shortening gestation by two weeks, and Tennessee's governor has a similar bill on his desk.\nBranstad praised Iowa's new law as one of the \"most pro-life bills\" to pass the Iowa Legislature in recent years.\n\"I have been fighting for the unborn since I ran for the Legislature in 1972, and I have not stopped. I am really pleased with this General Assembly and the progress that was made,\" Branstad said. \"I think that this year was really a banner year for the pro-life movement. History was made this session.\"\nGroups opposed to abortion celebrated the enactment of the new law, which took effect immediately, and predicted it will withstand a court challenge.\nJenifer Bowen, a leader of Iowa Right to Life, said signing of the legislation marked an \"amazing, historic day\" for groups dedicated to protecting the sanctity of life.\n\"We are seeing for the first time, quite possibly in Iowa history, a bill that will actually save lives,\" Bowen said. \"Babies 20 weeks in the womb will now be protected. We are incredibly excited about this opportunity and we are energized to continue to educate Iowans.\"\nBob Vander Plaats, president and chief executive of a conservative Christian group called The Family Leader, said his organization was part of a coalition during the 2017 Legislature's session that sought laws declaring life begins at conception and to stop taxpayer financing for abortion providers. While the legislation Branstad signed doesn't prevent all abortions, he believes that it represents a step forward.\nVander Plaats also said he is optimistic Iowa's courts will uphold the constitutionality of the new law against detractors' claims that it violates women's rights.\n\"We believe the very same constitution protects the sanctity of life,\" he said.\n► March: Is abortion pill reversal a 2nd chance or just chance?\n► March: Women wear 'Handmaid's Tale' robes in Texas Senate\nDuring the bill-signing ceremony, four Drake University students stood silently in protest, wearing white bonnets and red capes. They were portraying characters described in the novel The Handmaid's Tale by author Margaret Atwood, in which some women are kept for reproductive purposes by the ruling class in an era of declining births.\n\"We feel that the legislation that Branstad is signing puts us in the same position as the handmaids,\" said Drake junior Hannah Van Zee, 21, of Des Moines. Phoebe Clark, 20, a Drake junior from Lawrence, Kan., said she views the Iowa law as state-sponsored reproductive coercion.\n\"This is blatantly unconstitutional,\" she said. \"It completely disregards the needs of women in Iowa and completely ignores the reason why anyone would need or want an abortion after a 20-week mark.\"\nFollow William Petroski on Twitter: @WilliamPetroski",
    "label": 3
}