{
    "index": 984,
    "text": "The Trump administration has temporarily suspended the publication of weekly reports detailing cities and counties that refuse to honor federal immigration detainers over concerns about the accuracy of those lists.\nU.S. Immigration and Customs Enforcement, which began making the lists public last month, is reviewing its reporting methodology after several law enforcement agencies complained that they were erroneously included in the report.\n“While this analysis is ongoing, the publication of [the report] will be temporarily suspended,” said Sarah Rodriguez, a deputy press secretary at ICE. She added that the agency expects to resume publication after the review is completed, but she did not specify a time frame.\n“ICE remains committed to publishing the most accurate information available regarding declined detainers across the country,” she said in a statement.\nICE began publicizing the list of jurisdictions after President Trump signed a pair of executive orders in January to ramp up immigration arrests and deportations at the southern U.S. border and inside the country.\nTo that end, Trump directed federal officials to publish a weekly list of declined detainers and the immigrants who were released by so-called sanctuary cities. He also threatened to block some federal grant funding to those cities that fail to comply with federal detainer notices for immigrants subject to deportation. Administration officials have said immigrants who commit crimes but are released pose a serious threat.\nBut the weekly lists included in the Declined Detainer Outcome Report contained several errors that rankled local law enforcement officials. For instance, one report incorrectly claimed that Franklin County in Iowa, Franklin County in New York, Franklin County in Pennsylvania and Montgomery County in Iowa had ignored immigration detainers they had never received.\nWilliamson and Bastrop counties in Texas, Chester County in Pennsylvania and Richmond County in North Carolina were also incorrectly included in the list.\nOn Tuesday, an official said the errors were a main reason they suspended the report.\n“We’ve identified that there have been some data-processing errors,” said David Lapan, a spokesman for the Department of Homeland Security, which oversees ICE. “That’s why the decision was made: Let’s take a pause and make sure that we look at this holistically and make sure that we’re getting it as accurate as possible.”\nA spokesman for Attorney General Jeff Sessions said the report’s suspension would not affect the Justice Department’s plans to withhold federal grant money from sanctuary cities.\nBut that timeline is unclear, Lapan said, because the agencies have not agreed on a definition of the term “sanctuary.”\nMark Krikorian, executive director of the Center for Immigration Studies, which favors restrictions on immigration, said the report could be a valuable tool for Trump.\n“I think they got out of the gate quicker and they weren’t quite ready yet,” he said. “They’ve got to go back and set up a more systematic way of gathering the information. I don’t have any doubt they will. It just will take a while.”\nBut the American Civil Liberties Union, which considers immigration detainers unconstitutional, said it hoped that ICE would not issue the report again.\n“The ACLU is pleased the administration has halted these deeply flawed and misleading reports,” staff attorney Cody Wofsy said in a statement. “It should reconsider its entire campaign of bullying localities for their lawful and responsible choices.”\nSome cities have passed laws that restrict the collection of citizenship status by local law enforcement, citing concerns that immigrants who have committed relatively minor infractions, such as traffic violations, could be harassed or deported.\nThe Trump administration has listed scores of jurisdictions — including in Virginia, Maryland, California and Texas — that have allegedly not cooperated with federal authorities.\nBut last month, Seattle sued the administration over Trump’s executive order on sanctuary cities, calling it unconstitutional.\nRodriguez said the publication of weekly lists “has already sparked important conversations between ICE and law enforcement agencies across the nation, and the revised report will add to this discussion.”",
    "label": 3
}