{
    "index": 220,
    "text": "Washington (CNN) President Donald Trump may be a new face on the international stage, but visiting foreign leaders from around the globe have quickly embraced a strategy for currying favor: flattery.\nBritish Prime Minister Theresa May cribbed some of Trump's own talking points about himself, lauding his 2016 election win as \"stunning\" during her visit in January and saying Trump, like her, was a president for the \"ordinary working people.\"\nAnd Israeli Prime Minister Benjamin Netanyahu name-checked Trump's seminal book -- \"The Art of the Deal\" -- while casting him as a stronger leader than his predecessor: \"Our alliance has been remarkably strong, but under your leadership, I'm confident it will get even stronger.\"\nMost recently, Palestinian President Mahmoud Abbas told Trump Wednesday that his \"great negotiating ability\" will make peace with Israel more likely.\n\"I believe that we are capable, under your leadership and your courageous stewardship and your wisdom, as well your great negotiating ability,\" Abbas said through a translator. \"I believe with the grace of God, and with all of your effort, we believe that we can be partners, true partners to you, to bring about a historic peace treaty.\"\nJUST WATCHED Abbas: With Trump's wisdom, peace is possible Replay More Videos ... MUST WATCH Abbas: With Trump's wisdom, peace is possible 00:46\nFlattery plays to Trump's ego\nForeign flattery plays directly into Trump's view of himself, something the world leaders hope will win them affection with the United States.\nAsked about Trump's diplomatic style and what makes the situation between Israelis and Palestinians different under his administration, White House press secretary Sean Spicer responded bluntly: \"The man is different.\"\n\"The President's diplomacy style is paying dividends,\" Spicer said. \"The relationships and the foundation that the President is building are going to pay huge dividends for this country ... This President's style is one to develop a personal bond with individuals.\"\nTrump has not hidden his ego throughout his decades-long business career. His name is his brand and it's plastered on buildings around the world. His campaign regulatory filing valued it at $3.32 billion. Trump has also fashioned himself a dealmaker of historic proportions since his earliest days on the New York real estate scene, someone who knows when to push the person across the table because he understands people.\nHe has even mentioned his history as a dealmaker to seemingly explain why flattery could work well on him.\nTrump called the comments a \"great honor.\"\n\"I know people, because deals are people. If Putin respects me, and if Putin wants to call me brilliant, and other things that he said which were, frankly, very nice, I'll accept that,\" Trump said. \"And I'll accept that on behalf of our country, because if we get along well with Russia, that's a positive thing.\"\nJUST WATCHED Netanyahu, Trump to rekindle US-Israel bond Replay More Videos ... MUST WATCH Netanyahu, Trump to rekindle US-Israel bond 02:00\nMore than cosmetic\nThe flattery hasn't just been cosmetic; it has also been substantive.\nWhen NATO Secretary General Jens Stoltenberg visited the White House, he told reporters -- alongside Trump -- that the President's advocacy for greater contributions to defense funding from member nations has led to action among other NATO countries.\n\"We are already seeing the effect of your strong focus on the importance of burden-sharing in the alliance,\" Stoltenberg said. \"We agree that allies need to redouble their efforts to meet the pledge we all made in 2014 to invest more in our alliance.\"\nThe flattery also steals a page from the former business leader's own playbook.\nTrump was a prolific letter writer in the early stages of his career, routinely ripping out magazine articles about a person, sending it to them with fawning words. More recently, reporters, like The Irish Times' Simon Carswell, have written about how positive articles about Trump or his properties have been received warmly.\n\"Thanks to you and the wonderful Simon Carswell for the great story on Trump International Golf Links, Ireland. It will be great,\" Trump tweeted in 2014.\n@IrishTimes Thanks to you and the wonderful Simon Carswell for the great story on Trump International Golf Links, Ireland. It will be great — Donald J. Trump (@realDonaldTrump) May 10, 2014\nThose tendencies have followed Trump to the White House.\n\"Strong hands,\" Trump said in the Oval Office about Japan's Abe, mimicking a golf swing in the process.\nAbe, visibly taken aback by the comment, responded with a laugh.",
    "label": 3
}