{
    "index": 26,
    "text": "— -- FBI Director James Comey endured tough questioning today on Capitol Hill over the FBI’s handling of the investigation into Hillary Clinton’s private email server and his controversial decision – just days before the November election – to send a letter to Congress, which later became public, notifying lawmakers that the FBI was going to reopen the probe into Clinton’s emails.\nComey testified in front of the members of the Senate Judiciary Committee for nearly four hours in what was an annual oversight hearing.\nHere are some key takeaways from Comey’s hearing today:\nComey explains thought process behind his Oct. 28 letter\nSen. Dianne Feinstein, D-Calif., asked Comey about his decision to send a letter to Congress on Oct. 28. Before sending the letter, Comey said the investigation into Clinton's use of a private email server while she was secretary of state had been completed.\n\"I've lived my entire career by the tradition that if you can possibly avoid it, you avoid any action in a run-up to an election that might have an impact, whether it's a dog catcher election or president of the United States, but I sat there that morning, and I could not see a door labeled 'no action here',\" Comey said today during the hearing. \"I could see two doors. One was labeled 'speak,' the other was labeled 'conceal.'\"\nHe went on, \"Concealing in my view would be catastrophic, not just to the FBI but well beyond.\"\nClinton's classified emails\nThe emails Comey was referring to in his Oct. 28 notification he sent to Congress were found on former New York Rep. Anthony Weiner's laptop - former Clinton State Department aide Huma Abedin's estranged husband.\nComey revealed today that Abedin appeared to have a \"regular practice\" of forwarding classified emails to Weiner.\nAccording to Comey, Abedin would send them to Weiner so he could print them out as \"a matter of convenience\" and then she could deliver them to Clinton.\nComey said the FBI completed the investigation into Abedin and couldn't prove there was any criminal intent.\n\"We didn't have any indication she had a sense what she was doing was in violation of the law,\" Comey said.\n'Mildly nauseous' to think FBI might have impacted election\nThe Oct. 28 letter Comey sent to Congress led to criticism from Democrats who felt his actions cost Clinton the election and from former Justice Department officials for his breaking with the department's long-standing practice of avoiding commenting on investigative actions close to an election that could influence the outcome.\nComey said today it makes him \"mildly nauseous\" to think the bureau might have influenced the 2016 presidential election.\n\"It makes me mildly nauseous to think that we might have had some impact on the election, but honestly, it wouldn't change the decision,\" a very animated Comey said in his testimony.\nComey called it a \"hard choice\" and \"one of the most painful decisions\" he's had to make.\nComey thinks he handled both Clinton and Trump probes \"consistently\"\n\"I think I treated both investigations consistently under the same principles,\" Comey said of the probe into Clinton's private email server and the investigation into any possible contact between Trump campaign associates and the Russian government.\nComey said the FBI confirmed the investigation into Clinton's email server in October 2015, and then \"said not another word, not a peep about it until we were finished.\"\nComey said the FBI is treating the Trump-Russia investigation the same way.\n\"I don't know what we'll say when we're done, but that's how we handled the Clinton investigation, as well,\" Comey said.\nDon't expect any updates to come on Trump-Russia investigation\nComey was asked if the FBI would be providing any updates to the American people about the ongoing investigation into Trump campaign associates and any potential collusion with the Russian government.\n\"Certainly not before the matter is concluded,\" Comey said. \"And then depending upon how the matter is concluded, some matters are concluded with criminal charges and then there's a public accounting and a charging document. Other matters as was the case with the e-mail investigation end with no charges but some statement. Others end with no statement. I don't know yet. Obviously I would want to do that in close coordination with the department.\nComey has been interviewed by DOJ IG\nThe head of the FBI director said he's been interviewed by the Department of Justice inspector general as part of the DOJ's independent investigation into the FBI's handling of the Clinton email probe.\n\"I want that inspection because I want my story told because some of it is classified but also if I did something wrong, I want to hear that,\" Comey said.\nComey added that he's sure he'll be interviewed again.\nAny Regrets? No.\nSen. Richard Blumenthal, D-Conn., asked Comey if he had any regrets in announcing last July that the FBI had closed the Clinton investigation and then in his Oct. 28 letter said the FBI was taking additional steps.\n\"The only thing I regret is answering the phone when they recruited me to be FBI director and I was living happily in Connecticut,\" Comey said, getting some laughter from the room.\nComey drove home again that he wouldn't have handled things any differently.\n\"I've gotten all kinds of rocks thrown at me,\" Comey said. \"This has been really hard but I think I've done the right thing at each turn.\"\n\"Somehow I would have prayed away, wished I was on the shores of the Connecticut sound but other than that, I don't have any regrets,\" Comey admitted.\nABC News' Mike Levine contributed to this report.",
    "label": 2
}