{
    "index": 421,
    "text": "Sen. Bob Casey's attempt to stop mother, 5-year-old's deportation fails\nCorrections & Clarifications: An earlier version of this story named the woman. USA TODAY will not name her at the request of her attorneys out of concern for her safety.\nSen. Bob Casey mounted a campaign Wednesday to stop the deportation of a mother and her 5-year-old daughter to Honduras, where he says they will be targeted by gangs.\nThe Department of Homeland Security reported Thursday that his campaign was unsuccessful and the woman has been deported. Because of privacy laws, department spokesman David Lapan was unable to provide information in regards to Casey's claims about the minor.\nOn Wednesday, Casey tweeted a stream of information about the situation and made an appearance on MSNBC. According to tweets, the deportation was in progress Wednesday afternoon.\nTwitter: it's urgent. I just found out that a young child & her mother who came to U.S. seeking refuge will be sent back to Honduras today. — Senator Bob Casey (@SenBobCasey) May 3, 2017\n\"This 5yr old and his mother aren't 'bad hombres.' They aren't in a gang, they're running from death- vulnerable and scared ... The child is potentially eligible for Special Immigrant Juvenile Status,\" tweeted Casey.\nCasey also claimed that the Department of Homeland Security was aware the mother and child had \"had secured paperwork to protect them\" and had rushed removal to prevent the protection.\nLapan, of the Department of Homeland Security, told the York (Pa.) Daily Record by email that FMH was detained on Dec. 18, 2015, one day after unlawfully entering the United States. She was removed on Wednesday \"after having exhausted all legal remedies available to her.\"\nThose \"legal remedies\" ran the whole way up to the U.S. Supreme Court, which unanimously denied the petition after her case was heard in the U.S. Court of Appeals for the Third Circuit.\nLapan said the woman was removed without incident and that Immigration and Customs Enforcement officials have been in direct contact with Casey's office, providing information as it became available.\nCasey said Wednesday that Department of Homeland Security contacts informed him that only the Trump administration could stop the deportation Wednesday afternoon.\nFollow Joel Shannon on Twitter: @JoelShannonYDR",
    "label": 3
}