{
    "index": 413,
    "text": "Drug makers use co-pay coupons to help mask their rising drug prices\nDrug maker-funded coupons and patient assistance programs are proving to be an uncertain and often questionable way for patients to afford what a new report shows are increasingly expensive specialty and other brand name drugs.\nGrowth in drug spending by commercial and government insurance plans slowed last year to 5.8% -- less than half the growth rate in 2014 and 2015, a report by the QuintilesIMS Institute showed. Much of the slowing was due to lower sales of Hepatitis C drugs.\nStill, a report out Wednesday by the Blue Cross Blue Shield Association (BCBSA) found cumulative spending on drugs that are still under patent is rising at an average annual rate that's more than double the rate of increase in spending for all drugs and was up 285% between 2010 to 2016. During the same period, overall spending on brand name and generic drugs with competition dropped by 47%, the analysis of 30 million BSBSA commercial insurance claims showed.\nUnderscoring the needs for the coupons, patients who account for 2% of the prescriptions are responsible for 32% of total out of pocket costs, the QuintilesIMS report shows.\nSome patients and advocates say co-pay assistance enhances the drug maker’s public image while it obscures their high prices. One patient advocate says the companies can often write off their assistance on their taxes, which gives them another financial benefit.\nThe new QuintilesIMS report found the percentage of prescriptions filled using a coupon increased from 13% to 19% between 2013 and 2016.\n\"It's become a little bit of a war between the health plans and the pharmaceutical manufacturers,\" says Murray Aitken, executive director of the QuintilesIMS Institute.\nBy limiting a patient's out-of-pocket costs for drugs, drug companies thwart the most effective tool insurers have to control drug costs. After commercially insured patients meet their deductibles or out-of-pocket premiums, the insurers pay the higher drug costs, which get passed along in higher premiums.\nMedicare patients are prohibited from using co-pay coupons, but are often eligible for drug makers' patient assistance programs.\n\"The higher the co-pay, the more it's supposed to make you wonder, 'Do I really want that drug?,'\" says Salisbury, Md., pharmacist Matthew Balish.\nOne of Balish's customers, however, says she really appreciates the Xarelto zero co-pay card. Starlin Weaver, a science education professor at Salisbury State University, takes the blood thinner to prevent blood clots like the one that nearly killed her in 2004. She tried competing drugs before her insurer agreed to pay for Xarelto, but says they didn't work as well.\n\"I'll pay whatever I have to pay,\" Weaver says, because her doctor told her Xarelto is the drug most likely to prevent another clot.\nCoupons didn't match price hikes\nThere was widespread public outcry over high EpiPen prices last summer when co-pay coupons didn't offset huge price hikes, especially for those with high-deductible insurance plans. Now, reductions in the level of drug maker assistance is driving home just how pricey some patients' drugs are, but for a far more broader swath of patients.\nMore than half of commercially insured patients’ out-of-pocket spending for brand medicines is based on the full list price rather than the discounted price the insurer or pharmacist pays, according to an analysis by Amundsen Consulting commissioned by the Pharmaceutical Research and Manufacturers of America (PhRMA). Co-pay coupons help offset this, says PhRMA spokeswoman Holly Campbell.\nDrug makers use their marketing budgets to pay for co-pay coupons, while patient assistance for Medicare patients (who are prohibited fro using coupons) comes directly from drug companies' foundations or outside \"charities.\" Multiple myeloma patient David Mitchell, who founded the group Patients for Affordable Drugs in February, decries drug makers' ability to get tax deductions for something they bill as charity but that's really marketing money that's largely returned to their coffers.\n\"They say they're doing this to help patients,\" says Mitchell. \"But they know their market share and how much will come back to them. If they have the only drug, they know every penny is coming back to them.\"\nBalish agrees: \"It's a shame that drug makers have to price the products so exorbitantly that they must then offer assistance programs as a form of charity.\"\nAs prices continue to rise, the coupons and other patient assistance affect patients in different ways;\n• Donut hole. Medicare patients seldom realize that the often-hefty help they're getting from drug companies counts as if it were their own contribution. That means they hit the coverage gap known as the \"donut hole\" faster, says Phoenix pharmacist Teresa Stickler. Some of her patients on high-priced cholesterol drugs, including Repatha and Praluent, simply stop taking these medications until their cost sharing goes down when they hit Medicare's catastrophic coverage. At that point, when they've spent $4,950 out-of-pocket in 2017, their cost sharing for covered drugs drops significantly for the rest of the year. .\n• Co-pay card changes. Drug maker Janssen Pharmaceuticals, which makes Xarelto, changed its co-pay card policy early this year for some patients from a zero co-pay to a set $200 a year off. Customers are often shocked to learn that their co-pay assistance went away. One of Balish's customers, a retiree, was shocked to find he suddenly owed about $180 a month for Xarelto, up from nothing.\n• Limited assistance. When new patient assistance funds become available for different drugs, pharmacists and patient groups say they alert their customers, but many of them lose out. \"There is such high demand and then they close down again,\" after two or three days, says Tim Coetzee, chief research officer for the National Multiple Sclerosis Society. \"It speaks to the broader issue deal with the economics. Our view is medications need to be affordable and accessible in the system to get them.\"\nAbout a quarter of people taking either brand name or specialty drugs simply stop taking them when they have a deductible to meet, according to the new Quintiles/IMS report. For those with deductibles, the rate of this \"abandonment\" of prescriptions was higher for specialty drugs - or 27% - compared to other brand name drugs which got abandoned at the drug stores about 23% of the time.\nAmong BCBSA's top 25 patent-protected drugs in 2015 spending, the multiple sclerosis (MS) drug Gilenya increased 30,257% over a seven-year period. Such price increases have led some MS patients and the National MS Society to be very critical of drug pricing and patient assistance.\nFinancial assistance from industry amounts to \"a dirty, infected Band-Aid\" for the problem of high drug prices, MS blogger and author Trevis Gleason wrote recently.\nThree MS drugs were on the market when Gleason was diagnosed with MS 15 years ago when he was 35. Now there are 14, and when a newer more expensive drug hits the markets, all drug makers raise their prices. Gleason, who wrote the memoir Chef Interrupted, is not taking a disease modifying drug for his MS currently because it would cost him $900 a month.\nRead more:\nPossible solutions include requiring drug makers to offer similar co-pay assistance to all patients and prohibiting coupons that don't cover the length of the prescription, says physician Peter Bach, director of Memorial Sloan Kettering Cancer Center's Center for Health Policy and Outcomes. If pharmacies had to report co-pay assistance to insurers separately from patients' cash payments, Bach says that would temper price inflation.\nDrug makers are \"doing it to manipulate the market,\" says Bach. \"And the patient pays one way or another,\" whether it's with their tax dollars for Medicare or higher premiums in commercial insurance.\nDrugmakers say money for co-pay assistance is not unique to its industry. As Campbell noted in an emailed statement, \"hospitals and providers often have charity programs to forgive medical bills for patients who cannot afford their cost-sharing associated with their treatment and care.\"\nTrue, says Mitchell, \"except that (the pharmaceutical industry) uses coupons the same way Clorox does - to incentivize people to buy the product.\"\nTell us your drug price story at healthinsurance@usatoday.com",
    "label": 3
}