{
    "index": 261,
    "text": "For President Donald Trump and Republican lawmakers, passing a bill to dismantle Obamacare was a trying and at times exasperating exercise.\nThe fits and starts of legislating that culminated in the House passing health care legislation Thursday revealed a lot both about the President and his GOP colleagues on Capitol Hill. It also sets up the foundations of a working relationship between the White House and Congress, as Republicans now look to tackle other priorities like tax reform.\n\"We've developed a bond,\" Trump said at the White House. \"This has really brought the Republican Party together.\"\nHere's what we learned leading up to Thursday:\nThis was why Trump chose Pence as his VP\nWhen Trump chose Pence as his running mate last summer, it seemed an unlikely choice: They hardly knew each other and their personalities appeared to be polar opposites.\nBut the health care exercise appeared to validate precisely why Trump ultimately chose Pence. He wanted someone who understood Congress.\nTrump and his top advisers knew that the nominee's lack of knowledge about the ins and outs of Capitol Hill was a significant handicap. Pence, a former Indiana governor and congressman, was just the Washington creature to make up for Trump's weak spot.\nOver the past few weeks -- and particularly in the final days leading up to Thursday's vote -- Pence has been a constant presence in the House. He lobbied and corralled Republicans to get behind the legislation as he navigated the various factions within the GOP conference.\nThe morning of the health care vote, a CNN reporter walking into the House overheard one Capitol Police officer lamenting to a colleague about the challenges of protecting Pence.\n\"Pence is difficult,\" the officer said, \"because he likes to mingle with everybody.\"\nThe House Freedom Caucus may hold the keys to all future deals\nAfter the Republican health care bill went up in flames in March, it became clear that Trump would have to choose between the moderate Tuesday Group and the conservative Freedom Caucus.\nTrump chose the Freedom Caucus.\nNot long after House Speaker Paul Ryan declared that \"Obamacare is the law of the land,\" the White House started trying again, desperately looking for a victory. Senior administration officials began furiously courting members of the Freedom Caucus, looking to strike a deal that would bring stubborn lawmakers on board.\nThose negotiations produced an amendment that would allow states to apply for waivers from key Obamacare requirements. The Freedom Caucus, led by Chairman Mark Meadows, endorsed it; members of the Tuesday Group balked. In the end, 16 of the 20 Republicans who voted against the health care bill were members of the Tuesday Group.\nIn an already fractured conference, Thursday's vote could set up significant precedent for conservative Republicans to roll over their moderate counterparts in future battles.\nPolicy is not Trump's forte -- and that's not fun for his colleagues in Congress\nOne thing has become painfully apparent over the past few months: Trump doesn't understand the nuances of health care policy.\nIn public remarks, interviews and conversations with colleagues on the Hill, the President demonstrated a striking lack of knowledge about what exactly was in the health care bill that he was personally vouching for.\nMore than once, Trump only made things more difficult for GOP lawmakers by speaking out of turn and making promises that were not in line with his party's priorities on Obamacare repeal and replacement. This past weekend, for example, Trump vowed that the GOP bill would do more to protect people with pre-existing conditions than Obamacare -- comments that were widely panned.\nIn a telling moment in February, an exasperated Trump said: \"Nobody knew health care could be so complicated.\"\nAll of this doesn't bode well for the GOP's upcoming legislative battles, as lawmakers look to tackle items like tax reform and infrastructure.\nWhen in doubt, punt to the Senate\nIn the end, Republican infighting and internal disagreements about health care policy were overcome by one shared desire: send something to the Senate and move on.\nThe rallying cry to move the bill to the upper chamber became a key argument for whips hoping to convince moderates on the fence that the bill's shortcomings might be repaired at a later date if they only voted it out of the House.\nEven Republicans who had deep concerns about the House legislation walked the plank and voted \"yes\" in the hopes that the more moderate Senate might change the bill to their liking.\nRep. Peter King told reporters off the House floor earlier in the week that he planned to vote yes (and he did) -- because it was time to let the Senate have a whack at it.\n\"If it goes to the Senate and comes back like this, I'd probably vote 'no,' but to move it along, I'd probably vote yes only for that reason,\" the New York Republican said.\nDon't tell the House what to do\nThe White House repeatedly applied pressure to the House leadership to bring a health care bill to the floor. But over and over again, Republican leaders, aides and rank-and-file members had to remind their new President that it was the House that sets the floor schedule -- not the White House.\nAfter Republicans were forced to pull their health care legislation from the floor in March because they were short of the votes, the White House doubled down. White House officials regularly leaked to reporters about what they said were imminent votes.\nAll the while, Republican leadership aides repeated a common refrain: they weren't voting until they got to 216 -- the threshold needed to pass a bill.\nA few weeks later, the White House's desire to mark some progress culminated in a made-for-TV moment, with Ryan announcing a relatively small amendment to the underlying health care bill.\nThat pressure only intensified in the days leading up to Trump's first 100 days. Short on a major legislative achievement, it was clear that the Trump administration was ready to see something on the floor, but once again leadership held off, deciding not to risk it until they knew they could deliver.\nIn the end -- when House Majority Leader Kevin McCarthy finally announced a vote ‪Wednesday night -- Republican leadership was finally able to give Trump what he wanted.\nMore transparency never hurts\nOne of the key criticisms Republicans have repeated on the campaign trail about Obamacare is that Democrats had negotiated the law in closed-door meetings and with backroom deals.\nIn the end, some Republicans admitted they hadn't learned any lessons from the very thing they had been complaining about for years.\nFrom the start, Republican leaders were hit from their own members that the process had been too rushed and secretive. Sen. Rand Paul, a Republican from Kentucky, led the Capitol Hill press corps on a frantic tour through the halls of Congress looking for the House's health care bill he argued they were keeping under lock and key.\nPerhaps the most stinging accusation: Passing the bill in the House Thursday without an updated score from the non-partisan Congressional Budget Office, which said in March the bill would leave 24 million fewer people insured by 2020 than under Obamacare.\n\"This could have been a heroes' bill if you said in January, 'We're going to have the best health care bill you've ever seen in September' and taken that period of time and worked this thing,\" said Rep. Walter Jones, a North Carolina Republican who voted \"no\" on Thursday.\n\"I think they could have had an excellent bill. It wouldn't be perfect, but it would be a hell of a lot better than this thing is.\"",
    "label": 3
}