{
    "index": 470,
    "text": "President Trump seizes on election rules to push his agenda in new ways\nShow Caption Hide Caption Trump 100 Days: A look at moments that mattered Donald Trump promised to shake up Washington and in many ways, he's lived up to his promise. From his Day One battle over inaugural crowd size to claims of wiretapping by his predecessor, AP looks at some key moments of Trump's first 100 days. (April 27) AP\nWASHINGTON — President Trump has headlined four big rallies in the first months of his presidency to tout his agenda and savage his foes. A new $1.5 million television ad campaign promotes his accomplishments and attacks the media.\nThe flurry of activity to build support for Trump’s policies isn’t organized by the White House but springs from his re-election campaign, which filed paperwork allowing him to begin raising and spending money on Jan. 20 — the same day he took the oath of office. By contrast, both President Obama and President George W. Bush had been in office for more than two years before they filed for re-election.\nTraditionally, presidents use federal money to push their policies and refrain from overtly political activity until later in their terms. But Trump’s unorthodox move to immediately start fundraising allows him to capitalize on federal election laws to push his agenda in new ways. He can rally his supporters, openly denounce his political enemies and pressure recalcitrant lawmakers in Congress — all without running afoul of rules that bar using taxpayer money for politics.\nTrump's perpetual campaign operation is another sign of the ways the billionaire president is upending political norms.\n\"I don't think it should surprise anyone that he's continuing to break the mold and come up with new and innovative ways to exercise the power of the presidency and run for re-election,\" said Michael Glassner, a longtime campaign aide whom Trump tapped to serve as executive director of the re-election effort. \"It's a continuation of his reinvention of the American political system.\"\nCampaign finance experts say operating as a candidate gives Trump the legal freedom to act in ways that he can't as president.\nAt a taxpayer-funded rally, for instance, it might be harder for Trump to toss out protesters. At campaign events, Trump can and does. At a recent Harrisburg, Pa., rally to mark his 100th day in office, the president yelled “get him out of here” as police removed a protester, who had waved a Russian flag and called Trump a “traitor.”\nTrump’s strategy helps him “make sure the audience is friendly, and it frees him up to say what he wants,” said Larry Noble, a former Federal Election Commission official who works for the Campaign Legal Center watchdog group.\nBut by legally declaring his candidacy on his first day in office, “he made it very partisan immediately,” Noble added. “We didn’t have any period when we could look at the president as the president of the whole country.”\nGlassner said the campaign doesn't restrict attendance at Trump events.\nParticipants need tickets to attend, however. That ticketing allows the campaign aides to grow Trump's already massive database of supporters and their addresses — another way to solicit campaign donations and to mobilize Trump-friendly voters for policy battles he' s waging in Washington.\nGlassner estimates that roughly 55,000 people have attended Trump's rallies so far this year.\nLew Oliver, chairman of the Orange County Republican Party in central Florida, said Trump seems to draw energy from the rallies. They also have the added benefit of reminding the federal lawmakers up for re-election in 2018 of the support he enjoys among Republican voters outside Washington. Two of Trump’s recent rallies — in Melbourne, Fla., and Harrisburg — underscore his victories in those crucial swing states.\n“Keeping constituents in campaign mode is … a way of keeping the base energized to put pressure on Republicans in Congress,” Oliver said.\n\"I think everything he does projects the power and authority of the presidency, and this is part of that,\" Glassner said of the rallies.\"It is a way to exhibit to Democrats and Republicans that he is a force to be reckoned with and that the enthusiasm for him outside the Beltway has not diminished.\"\nBecause television networks carry the events live \"it's really an uncensored, unfiltered way for him to communicate with Americans,\" Glassner added.\nThe campaign also communicates with more than 22 million supporters via Facebook. One post celebrated Friday's House passage of a health-care bill to repeal and replace Obamacare. Another accuses television networks of censoring Trump. Several networks, including CNN, declined to run the campaign's 100-day ad because it attacks the media as \"fake news.\"\nRead more:\nThe early activity already appears to be paying off financially for Trump’s campaign and the Republican Party.\nDonald J. Trump for President Inc.raised $7.1 million in the first three months of the year, far surpassing the $1.15 million that Obama's campaign committee brought in during the first quarter of his presidency. Altogether, the Republican National Committee, Trump and their joint fundraising committees topped $53 million during the first quarter of 2017, much of it fueled by the same kind of small-dollar donors who flocked to Trump's 2016 campaign.\nIf Team Trump maintains that pace, fundraising could surpass $400 million by the end of 2018, shooting past the $343 million the RNC took in during the 2016 presidential election cycle.\nGlassner would not discuss the campaign's fundraising goals, but said it's not too soon to prepare for the \"tremendous monetary costs\" ahead.\nTrump’s go-early approach could fundamentally alter how campaigns are financed for years to come, said Michael Toner, a Republican election lawyer and former Federal Election Commission chairman.\nTrump's move to raise money from Day One on the job could emerge as “the new blueprint for presidents,” Toner said. “And you have to wonder: Does this accelerate the decision-making for the people who are thinking about challenging him?”",
    "label": 3
}