{
    "index": 345,
    "text": "House Republicans narrowly passed legislation Thursday to roll back the Affordable Care Act, the first step toward delivering on a years-long campaign promise despite mounting concerns from healthcare groups that the legislation would strip protections enjoyed by millions of Americans.\nThe tight vote, 217-213, with all Democrats opposed, underscored the limited appeal of the American Health Care Act, which passed thanks to last-minute deal-making and the personal intervention of President Trump. Even so, 20 Republicans defected to vote against the measure.\nAfter House GOP leaders had shelved previous attempts to advance the bill because of a lack of support from their own party, Thursday’s vote provided a major legislative victory to Trump, which may give momentum to his other priorities and bolster his efforts to be seen as a leader who can govern with the Republican majority in Congress.\n“Make no mistake, this is a repeal and replace of Obamacare,” a buoyant Trump said at a Rose Garden reception for Republicans at the White House immediately after the vote. “It’s essentially dead.\n“It’s going to be an unbelievable victory when we get it through the Senate,” he added.\nAdvertisement\nBut the future of the bill remains highly uncertain as Senate Republicans expressed deep reservations about the potential that Americans will lose their healthcare coverage under the measure.\nSeveral Senate leaders, including health committee Chairman Lamar Alexander (R-Tenn.), indicated Thursday afternoon they wanted to take a very different approach, proceeding slowly with a new bill that would not jeopardize coverage for as many people as the House measure.\nThat means that any Senate progress on health legislation will probably take weeks, if not months, and could pose a serious challenge if it must be reconciled with the House version, which was crafted to win over the most conservative wing of the party.\nLonger term, the narrow passage of the House bill — which was uncertain until the final votes were cast — and the prospect that the debate will drag into the summer or beyond virtually ensures that healthcare once again will be a dominant issue in the midterm election.\nNeeding every vote they could get, Republican leaders pressed many of their members from swing districts — including all California Republicans who represent areas Trump lost last year — to support the bill. Democrats are likely to use those votes against Republicans when they run for reelection, just as Republicans did in ousting Democrats after Obamacare was passed in 2010.\nDemocrats sang, “Hey, hey, hey, goodbye,” on the House floor as the bill was being approved, predicting voters would boot Republicans from office as a result.\nProtesters chanted, “Shame on you!” outside the Capitol as Republicans boarded buses to whisk them to the White House.\nHouse Minority Leader Nancy Pelosi (D-San Francisco) orchestrated a full-scale floor opposition Thursday against what she called the “moral monstrosity of Trumpcare,” but in the end, Democrats were unable to block the measure.\nHouse Speaker Paul D. Ryan (R-Wis.), whose political reputation was riding on the outcome, told lawmakers this was their moment to make good on their promise to voters.\n“Are we going to be men and women of our word? Are we going to keep the promises we made? Or are we going to falter?” Ryan said in an unusually fiery speech ahead of the vote. “Let us pass this bill to take the next step to put Obamacare behind us.”\nDespite the risk of a voter backlash against the bill, many Republican strategists believe their candidates would face even bigger peril by failing to fulfill the party’s repeated promises to repeal Obamacare.\nThe full cost and impact of the bill remain unclear because GOP leaders called the vote without first waiting for a new analysis from the nonpartisan Congressional Budget Office. A previous assessment, before amendments were made to appease both conservative and centrist factions of the party, estimated the GOP plan would leave 24 million more Americans without healthcare coverage by 2026.\nThe legislation cuts more than a $1 trillion in federal healthcare assistance to low- and moderate-income Americans, primarily through a landmark retrenchment in Medicaid, the half-century-old government health plan for the poor.\nIt stands to reverse an expansion of healthcare under Obamacare that has brought the nation’s uninsured rate to the lowest level recorded — an additional 20 million Americans have gained coverage.\nAnd even though Republicans said their bill would lower premiums and protect vulnerable Americans, the vote was swiftly condemned by a wide range of patient advocates, physicians and other healthcare groups.\n“American lives are at stake,” warned Dr. Georges C. Benjamin, executive director of the American Public Health Assn., who urged Senate leaders not to be as “reckless, shortsighted and heartless” as the House.\nPotentially faring best in the House bill would be wealthy Americans and the insurance industry. Both would benefit from the elimination of as much as $600 billion in taxes enacted under Obamacare to help pay for the coverage expansion.\nSeveral studies have shown that Trump’s own supporters, living in conservative, rural areas, would fare the worst, paying higher premiums or losing benefits.\nA key change from the original bill that was sought by the conservative House Freedom Caucus allows states to apply for waivers from some of Obamacare’s most popular requirements, including the ban on insurers charging more for patients with preexisting medical conditions.\nAdvocates for patients with cancer, diabetes and other serious illnesses fear that would allow insurers to once again bill people with these diseases thousands of dollars more for insurance, making coverage unaffordable in many cases.\nLate Wednesday, another amendment was added to win back centrists worried about the effect of those state waivers. That change poured an additional $8 billion into high-risk insurance pools to cover patients with preexisting conditions who can’t obtain traditional coverage.\nThe additional money did little to convince healthcare professionals, who have cautioned that these pools, common before Obamacare, have proved woefully inadequate to cover the medical needs of sick patients shut out of commercial health insurance.\nDr. Andrew W. Gurman, president of the American Medical Assn., said the changes only “tinker at the edges without remedying the fundamental failing of the bill — that millions of Americans will lose their health insurance as a direct result of this proposal.”\nNeither did the amendments allay the concerns of many Senate Republicans, who have openly criticized the legislation and the rushed process that House leaders used to advance it.\nSen. Rob Portman (R-Ohio), whose state has expanded Medicaid coverage through Obamacare, cautioned that any changes to the current law “must be made in a way that does not leave people behind.”\n“I continue to have concerns that this bill does not do enough to protect Ohio’s Medicaid expansion population, especially those who are receiving treatment for heroin and prescription drug abuse,” Portman said.\nSen. Lindsey Graham (R-S.C.), a fierce critic of Obamacare, said on Twitter that the House replacement plan “should be viewed with caution,” noting that it had been passed without an analysis from the Congressional Budget Office and with only three hours of debate.\nSenate Majority Leader Mitch McConnell (R-Ky.) called House passage an “important step” and promised that Congress would continue work on the issue.\nThe vote turned out to be far more difficult than initially thought, particularly since the GOP-led House had voted more than 50 times over the years to repeal Obamacare. But those votes were largely symbolic because lawmakers knew then-President Obama would veto any such bill that reached his desk.\nWith the prospects that their legislation might actually become law and as public opinion polls showed Obamacare’s popularity rising, lawmakers weighed the decision much more carefully.\nMany Republican lawmakers appeared to be resigned to punting the bill to the Senate, where they acknowledge it will be changed or stall.\n“It’s not that I’m happy with this bill. I am not,” said Rep. Mario Diaz-Balart (R-Fla.), who represents a more centrist district and voted for the bill. “But there’s a long way to go.”\nAhead of the vote, Republicans huddled in the Capitol basement, playing the “Rocky” movie theme song and “Taking Care of Business” as an inspirational soundtrack.\nRep. Mark Meadows (R-N.C.), the chairman of the House Freedom Caucus, who was instrumental in brokering changes to bring conservatives on board, said he called Trump earlier Thursday to touch base before the vote.\nTrump asked him two questions, he said: Have we made the bill better? Does it cover preexisting conditions? Meadows said yes to both.\n“Great, let’s get it done,” he said Trump told him, “and make it better in the Senate.”\nObamacare 101 is a primer on the debate over repealing and replacing the Affordable Care Act »\nlisa.mascaro@latimes.com\n@LisaMascaro\nnoam.levey@latimes.com\n@noamlevey\nALSO\nTrump wants a border wall, but few in Congress want to pay for it\nGOP dreams of repealing Obamacare collapse as Trump relents, halting vote on House bill\nTrump’s election has mobilized a resistance like no other, but will Democrats’ answer to the tea party divide the ranks?\nMore coverage of Congress\nMore coverage of politics and the White House\nUPDATES:\n3:30 p.m.: This article was updated with additional background and analysis.\n12:40 p.m.: This article was updated after Trump’s comments.\n11:15 a.m.: This article was updated after the House vote.\n8:10 a.m.: This article was updated with additional background information.\nThis article was originally published at 6:05 a.m.",
    "label": 3
}