{
    "index": 173,
    "text": "Lawmakers react to report that President Trump revealed classified information to Russians\nPresident Trump revealed \"highly classified\" intelligence to Russian Foreign Minister Sergey Lavrov and Ambassador Sergey Kislyak last week, according to a report in The Washington Post.\nThe extremely sensitive information was gathered by a U.S. ally united in the fight against the Islamic State in Iraq and Syria (ISIS) and given on the basis that it remain private between the two parties. According to U.S. officials who spoke to the Post, Mr. Trump potentially jeopardized that relationship while also disclosing key ISIS-related intelligence.\nIn a briefing Monday evening, National Security Advisor H.R. McMaster denied on behalf of the White House that Mr. Trump shared the reported classified intelligence.\nMORE: \"At no time, at no time, were intelligence sources or methods discussed,\" H.R. McMaster says, denying report: https://t.co/6XEQ0A2tDF pic.twitter.com/HzSkSm7Rkb — CBS News (@CBSNews) May 15, 2017\nThe Post's report sent shockwaves through Capitol Hill on Monday, shaking up lawmakers who last week called into question Mr. Trump's relationship with Russia after he fired FBI Director James Comey.\n\"[O]bviously they're in a downward spiral right now, they've got to figure out a way to come to grips with all the that's happening,\" Sen. Bob Corker, R-Tennessee, said when asked by asked by the story by reporters Monday evening.\n\"You know the shame of it is there is a real good national security team in place and there are good productive things that are underway through them and others. The chaos that is being created by the lack of discipline is creating an environment that I think makes, it creates a worrisome environment.\"\nSen. Bernie Sanders, I-Vermont, expressed concern for national security, saying in a tweet, \"a week ago Trump fired Comey. Now this.\"\nA week ago Trump fired Comey. Now this. It's vitally important that Trump make public any recordings he has of talks in the Oval Office. — Bernie Sanders (@SenSanders) May 15, 2017\nSen. Mark Warner, D-Virginia, called the situation \"a slap in the face to the intel community\" and Sen. Richard Blumenthal, D-Rhode Island, said if true, Mr. Trump is \"sabotaging our war against ISIS.\"\nIf true, this is a slap in the face to the intel community. Risking sources & methods is inexcusable, particularly with the Russians. https://t.co/CRiSC024F7 — Mark Warner (@MarkWarner) May 15, 2017\nThis bombshell report is astonishing & appalling - betraying our allies, endangering safety of sources, & sabotaging our war against ISIS. — Richard Blumenthal (@SenBlumenthal) May 15, 2017\nSen. Martin Heinrich, D-New Mexico, drew comparisons between Mr. Trump's own alleged handling of the classified information and Mr. Trump's criticism of 2016 Democratic presidential candidate Hillary Clinton's use of a private email server, also describing the behavior as part of \"a pattern of recklessness.\"\n“And then I criticized her for using a personal email server!” pic.twitter.com/IgAjGYsp7p — Martin Heinrich (@MartinHeinrich) May 15, 2017\nSen. Sheldon Whitehouse, D-Rhode Island, made a similar joke on Twitter.\nHillary emails have harmless \"classified\" info; Republicans chant \"lock her up.\" Trump reveals real secrets to Russians; Rs say what?? — Sheldon Whitehouse (@SenWhitehouse) May 15, 2017\nHouse Minority Leader Nancy Pelosi, D-California, also commented on the Post's report.\n\"Even if President Trump unwittingly blew a highly classified code-word source to the Russians, that would be dangerous enough,\" she said in a statement. \"If the President outed a highly classified code-word source intentionally, that would be even more dangerous.\"\nSen. John McCain, R-Arizona, who also serves as chairman of the Armed Services Committee, tweeted of the report: \"If true, deeply disturbing,\"\nCBS News' Alan He contributed to this report.",
    "label": 2
}