{
    "index": 344,
    "text": "President Trump signed an executive order Thursday that he said would protect politically active churches from losing their tax-free status. But as has repeatedly been true during his young administration, the actual text proved more modest than his words.\n“For too long the federal government has used the state as a weapon against people of faith,” Trump said to an audience of conservative religious leaders gathered in the White House Rose Garden.\n“You’re now in a position to say what you want to say,” he added before signing the order, along with a proclamation. “We are giving our churches their voices back.”\nThe order was aimed at fulfilling a campaign promise Trump made to “totally destroy” a federal law known as the Johnson Amendment, which prohibits tax-exempt organizations, including churches, from actively supporting political candidates.\nThe ban, written by then-Sen. Lyndon B. Johnson of Texas in the 1950s, has seldom been used to remove a church’s tax exemption, although some religious groups, both conservative and liberal, have said that its existence constrains their speech on political issues. Its repeal has not been a top priority for most religious conservative groups, but Trump has often spoken about it.\nAdvertisement\nTrump’s order does not change the law; that would require Congress to act. And, despite his declaration, the order doesn’t necessarily change the way the Internal Revenue Service might enforce the law.\nThe text of the order, which the White House did not release until after Trump’s remarks, says only that the Treasury Department, “to the extent permitted by law” would not take “any adverse action” against individuals, houses of worship or other religious groups on the basis of speech “about moral or political issues from a religious perspective” that does not amount to “participation or intervention in a political campaign” in favor of or in opposition to “a candidate for public office.”\nIt’s not clear whether that would change any IRS rules.\nBefore the signing ceremony, an administration official said the order would direct the IRS to “exercise maximum enforcement discretion” in applying the Johnson Amendment. But the text does not include that language.\nThe new order contains a more vague, blanket statement that the administration is committed “to protect and vigorously promote religious liberty.”\nThe gap between Trump’s language and the actual order follows a pattern: The president’s descriptions of his executive actions often go considerably beyond the reality of what they do.\nSarah Huckabee Sanders, the White House deputy press secretary, said the administration’s legal staff believes the order does protect clergy from IRS sanctions if they make political endorsements from the pulpit, though a church would still be subject to losing its nonprofit status if it placed political advertisements. The IRS in the past has told religious groups that open endorsements of candidates from the pulpit could violate the law.\nWhite House officials pointed to an IRS document that said from 2010 through 2013, there were 99 cases nationwide alleging violations by churches that “merit a high priority examination.” How many actually were investigated is not clear.\nTrump’s order, timed for Thursday’s National Day of Prayer, included no mention of a much broader religious liberty provision leaked in February that could have allowed business owners to discriminate based on sexual orientation or other circumstances that involve moral objections. That proposal, actively pushed by social conservatives, has been the subject of internal debate at the White House and appears to have been shelved, at least for now.\nSanders, asked why Trump did not include the language that had been in the February draft, said executive orders go through many revisions before the president signs them and that this one fulfilled his goal of protecting religious liberty.\nEvangelicals supported Trump strongly during his election and had been pressuring the administration to go further in giving businesses discretion to assert morality clauses without running afoul of anti-discrimination laws.\n“It’s not a disappointment; 80% is better than nothing,” said the Rev. Franklin Graham, a leading evangelist who attended Thursday’s ceremony at the White House and spoke at Trump’s inauguration, in an interview. “This is a political world and you don’t always get everything you want.”\nGraham said that he hoped Congress would overturn the Johnson Amendment and Trump would return to craft a morality exemption for business owners, but that he believed the new order “does for the time being open up the opportunity for pastors to speak out.”\nGay rights groups had been on guard against a broader religious liberty order, and other liberal groups warned that Thursday’s narrower executive order could infringe on the separation between church and state and weaken campaign finance regulations.\n“Today’s Executive Order is payment to religious extremists for their support,” said Rabbi Jack Moline, president of Interfaith Alliance, in a statement. “It is not in the interests of American citizens, including those who voted Mr. Trump into office. It is a betrayal of the First Amendment.”\nThe order does aim to allow religious groups to avoid a mandate to provide contraception coverage under President Obama’s healthcare law, the Affordable Care Act, potentially expanding an exemption that had been carved out in the courts.\nThat part of the order may become moot if Congress passes legislation to repeal the healthcare law. In the meantime, however, a senior administration official who briefed reporters Wednesday night said unspecified “regulatory relief” would come later.\nTrump met with evangelical leaders Wednesday night and with Catholic leaders Thursday morning before signing the order at the Rose Garden ceremony.\nStaff writer Jaweed Kaleem in Los Angeles contributed to this report.\nnoah.bierman@latimes.com\nTwitter: @noahbierman\nALSO\nSenate votes to block California-led effort on retirement security for low-income workers\nWhy Trump is reaching out and even praising dictators: It’s strategy\nHow Maxine Waters became ‘Auntie Maxine’ in the age of Trump",
    "label": 3
}