{
    "index": 467,
    "text": "White House defends lack of women at health care event\nWASHINGTON – Trump administration officials defended Sunday the president’s victory lap over a health care bill far from completion, and the fact that the Rose Garden news conference featured mostly men.\n“The president achieved something that no one thought he would,” White House Chief of Staff Reince Priebus said on “Fox News Sunday.” “I think we were right to give the Congress an attaboy in the Rose Garden. But we also know that this is just the beginning, it’s the first step.”\nFlanked by members of Congress and administration officials Thursday, President Trump celebrated the narrow House passage of a bill to rewrite major portions of the Affordable Care Act.\n“Women's health experts in action,” Planned Parenthood’s Cecile Richards tweeted about the fact that most attending were men.\nWomen's health experts in action. pic.twitter.com/aZl24AqJgx — Cecile Richards (@CecileRichards) May 4, 2017\nThe bill would cut federal funding to Planned Parenthood and allow states to scale back services insures have to cover, such as birth control and maternity care.\nNBC’s Andrew Mitchell asked Health and Human Services Secretary Tom Price why the group was “mostly all men and white men at that” when “women’s health issues arguably are going to be disproportionately affected.”\nPrice pointed out that Rep. Diana Black, who chairs the House Budget Committee, was there, as was Seema Verma, administrator of the Centers for Medicare and Medicaid Services.\n“Out of a group of dozens and dozens of people, you can cite two or three women?” Mitchell responded.\n“These are prominent individuals who are leading…in this area of health care,” Price said. “The goal, as I mentioned, is to make certain that every single American, men, women, rich, poor, old, young, have the kind of coverage that they want for themselves and for their families, not that government forces them to buy.”\nABC’s George Stephanopoulos asked Sen. Susan Collins, R-Maine, why neither she nor any other female senator is included in the Senate’s 13-member group working on the Senate’s version of the bill.\n‘Well, the leaders obviously chose the people they want,” said Collins, whose objections to the House version include the cuts to Planned Parenthood.\nCollins added she’s continuing to push an alternative approach she’s working on with Sen. Bill Cassidy. R-La., and others.",
    "label": 3
}