{
    "index": 358,
    "text": "Gov. Jerry Brown on Saturday vetoed nine bills that would have provided new tax credits to benefit California lawmakers’ priorities, including low-income housing, energy efficient appliances, seismic retrofits, small businesses, food bank donations and hiring.\nBrown reminded lawmakers that when he took office in 2011 the state faced a $26.6-billion budget deficit and estimated shortfalls of $20 billion and it has taken tough measures to turn around the state’s finances. He also said there are new budget issues on the horizon because lawmakers failed to deal with the expiration of a healthcare tax.\nSIGN UP for the free Essential Politics newsletter >>\n“Despite strong revenue performance over the past few years, the state’s budget has remained precariously balanced due to unexpected costs and the provision of new services,” Brown said in his veto message. “Now, without the extension of the managed care organization tax that I called for in special session, next year’s budget faces the prospect of over $1 billion in cuts.”\n“Given these financial uncertainties, I cannot support providing additional tax credits that will make balancing the state’s budget even more difficult,” he added.\nAdvertisement\nThe bills rejected by the governor include one that was especially important for Los Angeles County because it would have provided a credit for seismic retrofitting of buildings not safe for earthquakes.\nAssemblyman Adrin Nazarian (D-Sherman Oaks) proposed $12 million in annual credits that would cover 30% of qualified costs incurred in seismic retrofits.\nThe veto of tax credits for affordable housing was criticized as a missed opportunity by Ray Pearl, executive director of the California Housing Consortium.\n“Affordable home builders in the state are dismayed by this shortsighted decision, but we are resolute in our goal to make homes for California’s workforce a priority once again,” Pearl said in a statement.\nALSO\nCalifornia sets new rules for medical pot industry\nNew regulations don’t clear all the hurdles for pot dispensaries\nBrown vetoes transparency bills for troubled state utilities commission",
    "label": 2
}