{
    "index": 64,
    "text": "— -- As it became clear that the American Health Care Act would pass the House of Representatives on Thursday, many Congressional Democrats started chanting the well-known song, \"Na Na Hey Hey Kiss Him Goodbye.\"\nAfter the Republicans secured the 216th vote, enough to secure the passage of the legislation that received no Democratic votes, many in the chamber broke out singing the famous taunt, an apparent reference to their belief that Republicans will suffer politically as a result of the vote.\nAfter the vote, House Minority Leader Nancy Pelosi, D-Calif., said the GOP would “pay the price” for the bill’s passage during the 2018 elections. Senate Minority leader Chuck Schumer, D-N.Y., said \"this bill is going nowhere fast in the United States Senate.\"\nAs the final gavel came down announcing the bill’s passage by a 217-213 vote, the House Democrats belted out for a second time the famous refrain: \"Nah Nah Nah Nah, hey hey hey, Goodbye.\" For years, the chant has been a staple at athletic events to taunt the opposing team.\nWednesday’s jeer hearkened back to a similar political moment in 1993 after House Democrats secured the votes to pass then-President Clinton’s annual budget.\nAfter Democratic Rep. Marjorie Margolies-Mezvinsky voted to support that measure despite her home constituency skeptical of the measure, she was met with Republican heckles of “goodbye, Marjorie.”\nShe subsequently lost her re-election bid in 1994.\nA number of Republican lawmakers touted the House passing the AHCA.\n“Today, we made good on our promise to repeal and replace Obamacare,” said Congressman Darrell Issa, R-Calif. “Let's stop pretending Obamacare is going to fix itself or that somehow, someday, it’s going to get better. Today's vote gives a voice to the victims of Obamacare, the millions of Americans who are paying higher premiums, receiving less coverage and for whom the status quo offered no end in sight.\"\nAdditional reporting by Benjamin Siegel.",
    "label": 2
}