{
    "index": 409,
    "text": "Exclusive: Tony Blair sees dangerous times ahead for Western democracies\nShow Caption Hide Caption Tony Blair on the Western world's political changes Former U.K. Prime Minister Tony Blair speaks with USA TODAY Washington bureau chief Susan Page about the current political climate of many Western democracies. Video by Jasper Colt, USA TODAY\nWASHINGTON — Former British prime minister Tony Blair warns that political upheaval from Great Britain's Brexit vote in June to the collapse of the Italian government on Sunday signals the most dangerous time for Western democracies in decades.\n\"It does feel perilous, actually, because I think there are decisions that are being taken of vast moment in circumstances where systems are fragile,\" he told Capital Download on Monday. \"And that is troubling.\"\nIt has been a year of unexpected victories by populist and nationalistic forces that are challenging the establishment: passage of the referendum pulling Britain from the European Union, the election of Donald Trump as president in the United States, defeat of a measure in Italy that prompted the prime minister to announce his resignation.\nAnd in the Austrian election Sunday, the candidate representing the party founded by former Nazis lost — but after commanding 46% of the vote.\nBlair, who was in Washington to address a conference sponsored by the bipartisan group No Labels, announced last week the launch of a new organization that will try to help build a more muscular policy agenda for centrists and encourage networking among them across Europe, in the United States and elsewhere. Given the rise of extreme voices on the left and right, he said, \"I'm not sure we're asking the right questions right now, never mind giving the right answers.\"\nOf particular concern to him is a \"longing\" for an authoritarian leader.\n\"It's amazing how many people you will find who will reference a style of leadership of (Russian) President Putin in a positive way,\" he told USA TODAY's weekly video newsmaker series. \"I think people want their country moving and they think that if the present system is not moving it, and not making the changes that they want to see, then maybe someone who just says, 'I don't care what anyone thinks; I'm just going to go for it, and this is what I'm going to do' — that has a certain attraction.\n\"If the center isn't a place of strength and vitality, and it looks kind of flabby and just managing the status quo, then you're at risk of someone coming along and doing that.\"\nIn his speech to the No Labels conference, he faulted some centrist political leaders for failing to do enough to improve the economic prospects for workers disrupted by globalization and to ensure a sense of personal safety at a time, for instance, that Great Britain and other European countries have absorbed a wave of immigrants from Syria. \"People will only put aside prejudices if they think there are rules,\" he said.\nBlair sees a common thread from Brexit's passage to Trump's election to support for Philippine President Rodrigo Duterte, a provocative figure whose anti-drug campaign is blamed for thousands of deaths.\n\"There is immense amount of anger at established ways of doing things,\" Blair said. \"There is, I think, a whole group of people who feel ignored by those in power, that is for sure true. There is more anger around in politics than for a long time.\" While issues such as immigration aren't new, there is \"much greater skepticism towards globalization and the benefits of it.\"\nWhat's more, \"social media is a revolutionary phenomenon,\" he went on. \"It changes the way politics works. It changes the way the media works. If we're not careful, it locks people into conversations with people who just agree with them, and who then have a general conspiracy-theory view of the rest of the world.\"\nBlair has never met Trump and didn't criticize him.\nAsked about whether it was wise for Trump to accept a congratulatory telephone call from the president of Taiwan — the sort of conversation every American president since 1979 deliberately has avoided — Blair demurred. \"I'm not going to get into your politics,\" he began. \"To be honest, in the end, I'll tell you what I really think: Let's see how it works out.\"\n\"I'm less worried about America than I am about Europe; I'll be very frank with you,\" he said. \"America is such a strong country and you've got so many checks-and-balances and you've got such resilience in your economy and so on; you guys will do fine, I'm sure. In Europe, we have systems that are at a point of fragility that troubles me.\"\nBlair was just 54 years old when he moved out of 10 Downing Street after serving as prime minister from 1997 to 2007. His political appeal for a \"new way\" was akin to President Bill Clinton's \"third way\" for Democrats here, and he was a crucial ally for President George W. Bush during the Iraq War.\nNow he offers a bit of free advice for President Obama, who will move out the White House next month at age 55: Find a cause.\n\"When you've got young political leaders and then they leave office young, you've got to find something that really motivates you,\" he said. \"The reason I spent so much time on the Middle East is that I'm deeply motivated by it. But you've got to find something that gets you up in the morning with the same sense of purpose and excitement as happened when you were prime minister or president.\"",
    "label": 3
}