{
    "index": 808,
    "text": "First Read is your briefing from Meet the Press and the NBC Political Unit on the day's most important political stories and why they matter\nSound and Fury, But Not Much Action in Trump’s Noisy First 100 Days\nYesterday — President Trump’s 97th day in office — was maybe the most instructive yet of his early tenure. Consider all of the news from Wednesday:\nThe White House said it was unveiling the “biggest tax cut ever”;\nIt bussed over the entire U.S. Senate to the White House for a classified briefing on North Korea;\nPolitico reported that the Trump White House was considering an executive order withdrawing from NAFTA;\nThe conservative House Freedom Caucus said it was supporting the House health-care plan after the crafting of a new amendment to change the legislation;\nAnd Trump told the Washington Examiner he was “absolutely” considering splitting up the 9th Circuit Court of Appeals.\nBut here is the reality behind those developments:\nThat “biggest tax cut ever” was just a single sheet of paper with no details behind it (conservative economist Peter Morici told NPR that it’s what a 12-year-old Newt Gingrich would have asked Santa Claus for Christmas);\nSenate Foreign Relations Chair Bob Corker said the White House briefing on North Korea was just “OK,” per NBC’s Frank Thorp. (Corker: “It was an OK briefing.” Q: What do you mean, you didn’t really learn much? Corker: “I—it was OK…”);\nLate last night, the White House said that “Trump agreed not to terminate NAFTA at this time,” and that the leaders of Canada and Mexico said they would work to renegotiate the treaty;\nWhile House Republicans have picked up additional votes for their health-care legislation, it’s unclear whether they have the 216 needed for passage (and the Senate seems to be an even harder pull);\nAnd if you think Trump is going to be able to split up the 9th Circuit, we have a bridge to sell you…\nA lot of sound. A lot of fury. But so little real action (with the possible exception of the health-care news). And that’s so emblematic of Trump’s first 100 days — sizzle but little steak. Indeed, yesterday seemed like a Trump campaign speech (“I’m going to give you the biggest tax cut ever”; “Believe me, I’m tearing up NAFTA”; “Lock up the 9th Circuit”). Diehard supporters eat it up, and it makes it SEEM like the White House is bustling with real activity. For someone who said the first 100 days is a “ridiculous” benchmark, it’s pretty clear he cares a lot about the optics of these first three-plus months in office.\nWhite House drops opposition to Obamacare subsides\nAnd here’s another development as the White House and Congress work to keep the government open: “The White House has made a second major concession to Democrats in the final stages of negotiations on a critical spending bill, paving the way for a deal to avert government shutdown,” NBC’s Leigh Ann Caldwell writes. “The White House said Wednesday that it would drop its opposition to a subsidy for low-income people in the Affordable Care Act, known as Cost Sharing Reductions, a funding stream that the Trump administration had threatened to stop. The agreement removes a politically toxic issue that was threatening to hold up negotiations with only two days left until government funding runs out on Friday at midnight.”\nSeven takeaways on Trump’s tax proposal\nPer NBC’s Benjy Sarlin:\nIt’s only a loose outline It’s a lot like Trump’s campaign plan It’s big People like Trump would benefit a lot Trump’s tax returns will be an issue It drops a critical House GOP idea (the border adjustment tax) Procedural rules could make it hard to pass.\nMexico’s “Hillary Clinton” rips Trump over wall\nNBC’s Alex Seitz-Wald: “President Donald Trump's border wall may not be going anywhere right now and one of Mexico's leading candidates in the presidential elections told NBC News she wants to make sure the ‘useless’ wall stays that way. ‘It's a false solution to a false problem,’ Margarita Zavala said of the wall through a translator in a phone interview Wednesday. ‘The wall does not help in any way the relationship between the two countries. The wall is pulling us apart.’” More: “Zavala, a former member of Congress and ex-first lady (she is married to Felipe Calderon, a former president), is expected to be the nominee of one of Mexico's two main political parties, the center-right National Action Party (PAN), for the country's July 2018 presidential election. She has been referred to as the \"Hillary Clinton of Mexico\" in media reports.”\nWhat were other presidents doing on April 27?",
    "label": 3
}