{
    "index": 62,
    "text": "\"There seem to be more questions than answers,\" one of them said.\n— -- While House Republicans have already celebrated their passage of a bill that would replace the Affordable Care Act, several of their GOP colleagues at the other end of the Capitol have already said the House version of the legislation is untenable.\n“At this point, there seem to be more questions than answers about its consequences,” Sen. Susan Collins, R-Maine, said in a statement of the House bill.\nCollins and a group of other Senate Republicans had already expressed concerns about the original version of the House bill, initially floated in March. But the new version of the House bill, which contains added provisions that would ease requirements that insurers cover pre-existing conditions, does little to assuage the senators’ initial concerns.\nSenate leaders said Thursday that while they will review the House bill, they will also write their own version of a health care overhaul. But the differences among individual senators, and the fact that there can be no more than two Republican defections for the bill to pass – underscores the challenge the Senate has ahead of it in coming up with a bill that satisfies enough holdouts.\nConservative GOP Sens. Rand Paul of Kentucky, Mike Lee of Utah and Ted Cruz of Texas all tweeted after the original House bill’s introduction that they would oppose anything short of a full repeal of Obamacare. They also said the House bill's tax credit structure to help people pay for coverage amounted to a new entitlement, too similar to the subsidies available under Obamacare.\nThe latest House bill would provide tax credits between $2,000 and $14,000 a year for individuals who don’t get insurance coverage from an employer or the governments. The tax credits would be based on age instead of income, increasing as a person gets older.\nAfter the House vote Thursday, Paul said he opposed the House bill because it guarantees “the fundamental promise of Obamacare kept.”\nCruz told ABC News earlier in the week that he still has “a number of concerns” about the bill, “and I think many senators do.”\nIn addition to such conservative members, four GOP senators from states that expanded Medicaid under Obamacare expressed concerns about the lack of protections for expansion beneficiaries: Sens. Cory Gardner of Colorado, Lisa Murkowski of Alaska, Rob Portman of Ohio and Shelley Moore Capito of West Virginia.\nThe House bill would raise the bar for Medicaid eligibility among lower-income Americans and cap payments to states for the program through block grants, reducing federal spending on the program by $880 billion over the next decade. It would also allow states to impose work requirements for “able-bodied” adults.\n“I continue to have concerns that this bill does not do enough to protect Ohio’s Medicaid expansion population, especially those who are receiving treatment for heroin and prescription drug abuse,” Portman said in a statement after the House vote.\nCapito also could not support the bill in its current form, a spokesman said.\nFinally, Collins had originally expressed concerns about the bill’s revocation of federal funding for Planned Parenthood, barring Medicaid recipients from getting any reimbursements for visits to the family clinic, which many Republicans oppose because the organization provides abortions among its services.\nShe also raised concerns about the new additions to the House bill, asking in a statement, “Exactly how does the bill treat individuals with pre-existing conditions? There should be no barrier to coverage for pre-existing conditions as long as people enroll and pay their premiums.”\nCollins may be one of the only Senate Republicans who wants to keep Planned Parenthood funding, but she is one of only 52 Senate Republicans. If she can't come around to the eventual Senate version of the bill, only one other Republican can vote against the bill and have it still pass (Vice President Pence would come in to cast a tie-breaking vote for Republicans).\nSen. Bill Cassidy, R-La., predicted a long road ahead for his chamber as they work to corral the disparate groups of skeptics and come up with a bill that at least most of them can support.\n“We need 50 votes and there are 52 of us,” he said. “So it will be a collaborative process where everyone's concerns are heard.”",
    "label": 3
}