{
    "index": 965,
    "text": "— Just hours before North Korea fired a failed ballistic missile, President Trump spent his morning enjoying the blue skies and breezy weather here on Florida’s eastern coast Saturday, zipping around the greens of his private golf club.\nThe day before, the president also passed the morning playing golf at Trump International Golf Club, according to someone who saw him on the course.\nAnd in addressing North Korea’s latest provocation, Trump — who spent at least a portion of both evenings greeting guests at his private Mar-a-Lago Club in Palm Beach — deferred to his defense secretary, Jim Mattis, a retired four-star Marine Corps general.\n“The president and his military team are aware of North Korea’s most recent unsuccessful missile launch,” Mattis said in a ­two-sentence, emailed statement Saturday night. “The president has no further comment.”\nOn the question of North Korea, one of the United States’s most immediate geopolitical threats, Trump was uncharacteristically quiet over the weekend, instead leaving it to his team of deputies, as well as Vice President Pence, to articulate the administration’s policy toward the totalitarian regime.\n(Bastien Inzaurralde/The Washington Post)\n[N. Korea didn’t test a nuclear weapon, but it did try to launch another missile]\nIn addition to Mattis’s terse statement, the vice president — who arrived in Seoul for a 10-day trip through Asia shortly after the failed launch — briefly addressed North Korea’s latest action at a dinner for U.S. troops and their family members. A White House foreign policy adviser on the trip briefed reporters traveling with Pence as well.\n“This morning’s provocation from the north is just the latest reminder of the risks each one of you face each and every day in the defense of the freedom of the people of South Korea and the defense of America in this part of the world,” Pence said. “Your willingness to step forward, to serve, to stand firm without fear, inspires.”\nMattis’s statement, as well as Trump’s lack of comment Saturday night, stood in stark contrast with the president’s behavior just two months ago, when North Korea claimed in mid-February that it had successfully tested a new type of missile with nuclear capabilities.\nIn response then, Trump — who was again at Mar-a-Lago for a visit with Japanese Prime Minister Shinzo Abe — scrambled his traveling press corps to deliver an in-person statement that evening after he and his aides seemed to pore over the latest developments in full view of his club members.\nBut as tensions mounted earlier in the week between the United States and North Korea — which is forging ahead with its nuclear weapons program and is eager to build a missile that can reach the United States — the president departed the White House on Thursday for what he seemed to hope would be a quiet Easter weekend holiday.\nHe brought with him only three junior staffers and K.T. McFarland, a deputy national security adviser who Trump aides said may soon be nominated as ambassador to Singapore in a move many view as a demotion.\n1 of 83 Full Screen Autoplay Close Skip Ad × See what President Trump has been doing since taking office View Photos The beginning of his term has featured controversial executive orders and frequent conflicts with the media. Caption The beginning of the president’s term has featured controversial executive orders and frequent conflicts with the media. March 17, 2017 President Donald Trump, first lady Melania Trump and their son, Barron, walk to Marine One at the White House en route to Mar-a-Lago in Palm Beach, Fla. Jabin Botsford/The Washington Post Wait 1 second to continue.\n[Trump’s deputy national security adviser won’t say whether she’s being redeployed to Singapore]\nThe president was in touch, however, with Pence, Secretary of State Rex Tillerson and Mattis, with whom he spoke several times between Thursday and Saturday as the situation unfolded, according to a senior administration official.\nBut in the hours after the failed launch, Trump — who previously has said the United States is willing to intervene on its own if others in the region don’t step up — allowed his advisers, including McFarland and national security adviser H.R. McMaster, to outline the administration’s approach on the Sunday talk shows.\nMcMaster and McFarland offered a notable contrast to Trump’s previously bellicose statements. Both seemed to be calling for patience and tamped down the possibility of imminent military intervention.\nMcMaster, appearing on ABC’s “This Week,” said that the United States is exploring “a range of options” to respond to an increasingly provocative North Korea but that the administration would like “to take action short of armed conflict, so we can avoid the worst.”\nMcFarland, meanwhile, played down the significance of yet another failed North Korean missile launch, saying that the test early Sunday was “not a surprise.”\n“Even in the last year, President Kim of North Korea has launched over 30 missiles,” McFarland said during an appearance on “Fox News Sunday.” “Most of them have failed. So it didn’t come as a surprise to us. We were expecting something surrounding the birthday of his grandfather.”\nSaturday was the anniversary of the 1912 birth of Kim Il Sung, North Korea’s founder and the current leader’s grandfather.\nMcMaster and McFarland also talked up the role China could play in bringing North Korea to heel — and urged some patience on that front. About 80 percent of North Korea’s trade is with neighboring China, giving the country a good deal of leverage, they suggested.\nMcFarland said an array of strategies were discussed when Chinese President Xi Jinping recently visited Trump at Mar-a-Lago.\n“It’s like your kids in the back of the car on a long trip saying, ‘When are we going to get there?’” McFarland said. “Well, in this case, I think we should give the Chinese president some opportunities and some time, as well as pursuing the economic and diplomatic pressures that we have and that our allies have that we can bring to bear on North Korea.”\nTrump, who save for muscling Justice Neil M. Gorsuch onto the Supreme Court has no real achievements on Capitol Hill of which to boast, has weathered several national security and military crises fewer than 100 days into his presidency, and seems to enjoy both the process and the projection of strength such crises involve.\nAfter Syrian President Bashar al-Assad deployed chemical weapons against his own people, Trump worked with his military advisers and responded swiftly, firing 59 Tomahawk cruise missiles at a Syrian airfield.\nAides to the president said he enjoyed the orderly process, overseen by McMaster, which resembled the streamlined operations of a more traditional White House, with Trump requesting a range of responses and each adviser weighing in with their expertise before the president made a final decision.\nBut Trump seemed determined to avoid conflict of just about any sort this weekend — North Korea or otherwise. He spent his three days in Palm Beach shuttling between Mar-a-Lago and Trump International Golf Club, spending almost no time outside the cocoon of his two palm-tree-lined properties.\nOn Saturday, after golf, the president’s motorcade took a different, longer route than usual to return to his private club, coming back from the north and along the coast. The circuitous trip allowed Trump to avoid the protesters who had gathered along the main thoroughfare just west of Mar-a-Lago to call on him to release his tax returns.\nWhite House press secretary Sean Spicer said the route was determined by the Secret Service.\nTrump, a normally prolific — and brash — user of Twitter, also spent the weekend largely quiet on social media; his last tweet heading into the weekend concerned his enthusiasm about the White House Easter Egg Roll on Monday.\nOn Sunday morning, Trump briefly took to Twitter, boasting about his electoral college victory in the 2016 presidential election and asking why his tax returns mattered in light of his win. He also extolled his efforts to rebuild the military.\n[Trump asks why people are still talking about his taxes a day after protesters asked for his returns]\nHe also seemed to admit he was using the Treasury Department’s currency report — which did not label China a currency manipulator — as a political bargaining weapon.\nDuring the campaign, Trump repeatedly said he would brand China a currency manipulator on Day One of his administration. On Day 83, he officially backed off that course.\n“Why would I call China a currency manipulator when they are working with us on the North Korea problem?” he wrote on Twitter on Sunday. “We will see what happens!”\nBut then the president retreated back into his calm Palm Beach world. He attended Easter services at Bethesda-by-the-Sea church here with his wife, Melania, son Barron, and daughter from his second marriage, ­Tiffany, before returning to Mar-a-Lago for an annual brunch and Easter egg hunt with his eldest sons, Don Jr. and Eric, and their families, according to an aide.\nOne intrusion from the outside world came from Don Jr., who over the weekend was sporting a green T-shirt that read “Very Fake News” in block white letters — a reminder of all those who, the president believes, have treated him so unfairly.",
    "label": 3
}