{
    "index": 425,
    "text": "Democrats say they must show how tax cuts may put Social Security, Medicare at risk\nShow Caption Hide Caption Here’s what you need to know about Donald Trump’s tax plan Donald Trump’s tax plan doesn’t only affect businesses. Time\nWASHINGTON — Ohio Sen. Sherrod Brown barreled into a regular Capitol Hill luncheon with his fellow Democrats on April 27 fuming and waving a Wall Street Journal opinion editorial calling for funding President Trump’s proposed tax cuts “the Reagan way,” including gradually raising the Social Security retirement age.\nFor Brown and other Democrats, the column underscored the urgency in shifting decades-long messaging about GOP tax cuts by casting them mainly as a giveaway to the rich. As Senate Democrats draw the battle lines over Trump’s proposed tax plan, they are borrowing an argument from their predecessors who fought former president Ronald Reagan’s tax cuts 35 years ago — by tying them directly to potential future cuts in Social Security and Medicare for the middle class and poor.\n“It took less than 24 hours and they are already trying to raise the retirement age to pay for these corporate handouts,” Brown told his colleagues, according to a source who was in the room but unauthorized to speak on the record. The editorial ran shortly after Trump released his one-page tax plan summary. Senate Minority Leader Chuck Schumer reprised the editorial — and Brown’s comments — in a Tuesday luncheon this week, the source said.\nRelated:\nEarlier in the day, Schumer had taken to the Senate floor to say the Trump tax plan will intentionally explode the deficit so that “down the line they’ll start howling” and say “oh, we have no choice” but to cut Social Security and Medicare.\n“This has been the nefarious goal of the hard right for decades,” said Schumer. A number of congressional Republicans contend that tax cuts should not be counted towards the federal deficit because of “dynamic scoring,” or increased economic growth that yields additional tax revenue. Yet, in a sign of the potential struggles ahead, even Senate Majority Leader Mitch McConnell has poured cold water on a tax plan that explodes the national debt, saying lawmakers should find offsets to pay for the cuts.\nThe comments from both Brown and Schumer resurrect some of the fiery populist language from Democrats, including the late senator Daniel Patrick Moynihan of New York, in disputing Reagan’s contention that his 1981 tax cuts favoring the wealthy would pay for themselves. They also signal how Democrats plan to make a play for Trump's working-class voters, by arguing their Social Security, Medicare and Medicaid benefits are at risk. Trump has vowed not to touch Medicare and Social Security.\nYet the Trump “skinny” budget that proposes deep cuts to U.S. government programs is reminiscent of Reagan’s first budget. Then-budget director David Stockman called the underlying conservative philosophy of dramatic cuts to government programs “starving the beast.” Reagan later struck a deal with Democrats to shore up Social Security. “The bipartisan Social Security legislation enacted during the Reagan administration provides a useful history lesson for how to offset deficit increases,\" including raising the age of eligibility for full Social Security benefits from 65 to 67, conservative columnist Martin Feldstein argued in his recent Wall Street Journal editorial.\nStill, according to Chuck Blahous, a former Social Security and Medicare public trustee, Reagan's 1983 Social Security deal would never had been struck for general deficit reduction and unless Social Security hadn't faced its own deficit. Faced with steep annual deficits, Reagan later signed several measures, including closing some tax loopholes that offset the effects of his prior tax cuts. In a 1985 New York Times article, Moynihan was still insisting that “the principal purpose of the tax cut was to provide a basis upon which to shrink government.”\nRead more:\nThe comments by Brown and Schumer echo a Monday letter Senate Democrats sent to Treasury Secretary Steve Mnuchin and Mick Mulvaney, Trump’s budget director, calling the tax cuts a “Trojan horse” for slashing Social Security, Medicare and Medicaid, borrowing another phrase from Moynihan.\nWith the president’s bid to replace the Affordable Care Act faltering, Republicans are turning their gaze to tax reform. The tax cuts could add $5.3 trillion to the national debt in the first decade, according to the non-partisan Committee for a Responsible Federal Budget. They feature a sharp cut in the corporate tax rate, from 35% to 15%, and reducing the number of tax brackets for individual filers from seven to three, with levels of 10%, 25% and 35%.\n\"It's an approach that would hammer Social Security and Medicare,\" said Sen. Ron Wyden of Oregon, the top Democrat on the Finance Committee. People would recharacterize income \"so they can be eligible for the lower rate,\" he said. \"This is about crumbs for the workers and tax breaks for the well to do.\"\nDemocrats are beginning to employ some of the lessons their party is processing after steep losses at the state and congressional level in recent election cycles. Mainly, it’s not good enough to rail against tax cuts for the rich because many voters don’t understand why the wealth accumulation of others impacts them and their families. In the letter to Mnuchin and Mulvaney, Democrats argued a 15% tax rate on business income would “undermine Social Security and Medicare directly” because taxpayers who could reclassify their personal income as business income would do so, thereby paying less FICA taxes.\nA Democratic Party post mortem circulating on Capitol Hill in March offered a “10-point checklist” for framing the economic case against Trump, with the first bullet being emphasizing “Trump’s tax reform plan as an unfair shifting of the tax burden onto the middle class.”\nRepublicans and Democrats who’ve long worked on budgetary issues say the Social Security and Medicare programs need fundamental reforms to remain solvent regardless of what happens with tax reform. Social Security and Medicare alone account for roughly 41% of the federal budget, according to the trustees’ 2016 annual report. \"Social Security’s condition is already quite dire,\" said Pete Sepp, president of the non-partisan National Taxpayers Union. \"The insolvency boulder is going to start rolling down the Hill in 2020 without one penny of tax reductions occurring,\" he said.\nYet Democrats see a historical connection between the two. Twenty years after Reagan’s tax cut and Social Security deals, former president George W. Bush flirted with partially privatizing Social Security shortly after securing major tax cuts in 2001 and 2003, which Democrats point to as further evidence that the two are directly connected. “This is what Bush did,” Schumer told USA TODAY. “They did tax cuts and then they said they had to cut Social Security. Some in the hard right, their ultimate goal is actually to cut Social Security and Medicare, even end it. This is a path for them. We’re going to stop it.”\nIt’s a message Schumer has been pounding the past few days, including in a weekend appearance on Fox News that reaches many of Trump’s base voters. The messaging is at least in part a reflection of one of the lessons Democrats have learned as many voters, including struggling working-class men and women who supported Trump, rarely make a connection between Democratic fury over “tax cuts for the wealthy” and potential cutbacks in their government benefits.\n“How Democrats talk about Trump’s tax plan matters; the best way to criticize it is in terms of how it will negatively impact middle-class Americans, not simply in terms of the benefits it will lavish on others,” according to the March memo by Priorities USA, the former political action committee associated with 2016 Democratic presidential nominee Hillary Clinton.\n“As Trump seeks to maintain his populist credentials as President, he has perhaps no bigger vulnerability than that tax plan,” the memo said.\nJim Manley, a former top adviser to now-retired Senate majority leader Harry Reid, concurred.\n“Just railing against tax cuts isn’t enough. You have to point out to people why, in fact, these proposed cuts are so dangerous to their entitlement programs they’ve come to depend on,” Manley said. “Number two is that many of the people who voted for Trump benefit from these entitlement programs.”",
    "label": 3
}