{
    "index": 377,
    "text": "Good morning, and welcome to the Essential California newsletter. It’s Friday, April 21, and here’s what’s happening across California:\nTOP STORIES\nGood jobs are disappearing\nThe stories of Eddie Ybarra and Francisco Martinez, two construction workers in their 40s, show the hollowing out of blue-collar jobs in Los Angeles and America writ large. Ybarra is a union worker and makes $40 an hour with pension, healthcare and unlimited vacation, while Martinez works for a nonunion contractor, makes $12.50 less with no insurance and gets just five vacation days a year. As immigrants like Martinez flooded California’s job market, pay sank. But which came first? Los Angeles Times\nCharting a course of ‘bold action’ for L.A.\nIn a State of the City speech that focused heavily on homelessness and creating new revenue streams, Mayor Eric Garcetti struck a hopeful tone. The speech — his fourth as mayor — presented Los Angeles as a compassionate counterpoint to what’s coming out of Washington and focused on pledges and programs to protect immigrants. The 45-minute address was delivered on the same day the mayor unveiled the budget. Los Angeles Times\nAdvertisement\nEducation as a way out\nIn California’s prisons, inmates are teaching each other how to start over as they hope and plan for a life on the outside. California corrections officials unveiled new regulations last month that will expand the credits some inmates earn for demonstrating good behavior and completing educational programs. The highly anticipated — and fiercely debated — guidelines could help trim the sentences of nearly 2,000 inmates over the next fiscal year. Los Angeles Times\nL.A. STORIES\nBe aware: Lead poisoning is prevalent in hundreds of areas across Los Angeles County, from affluent hubs to low-income or gentrifying areas. The results shocked some local leaders and showed how lead hazards persist even in a health-conscious region. Reuters\nMarch for Science: On Saturday, Los Angeles’ streets will fill for the March for Science, which was organized by a stay-at-home mom in Temple City who launched a Facebook group that spawned the march. Los Angeles Times\nWho rides those bikes? The L.A. Metro bike-sharing program has drawn about 130,000 riders since July, but “numbers released thus far show that the L.A. County transit agency has a way to go before reaching its mid-summer goal to have two rides every day for each of its 800 bikes.” KPCC\nA school closes: Whittier College trustees have made the surprise decision to close the college’s law school, angering students at the Costa Mesa campus. Los Angeles Times\nIMMIGRATION AND THE BORDER\nThe cutters: Migrant workers in Mendocino County are making thousands of dollars trimming marijuana. “Many trimmers in the county looking for work this season have come from all over the U.S. and all over the rest of the world, including Spain, France, Portugal and Switzerland.” ABC News\nThis is different: In two weeks, Kern County Sheriff Donny Youngblood will ask the Kern County Board of Supervisors to adopt a resolution that will declare Kern County a “law and order” county and not a “sanctuary” county. Los Angeles Times\nA familiar face: The San Diego federal judge whom Trump criticized as a “hater” is now hearing a key deportation case. There’s a political irony here. Los Angeles Times\nPOLITICS AND GOVERNMENT\nCoulter is coming: UC Berkeley officials on Thursday reversed their decision to cancel conservative commentator Ann Coulter’s appearance at the university. It’s been rescheduled from next week to May 2, according to a statement from the university. Los Angeles Times\nHunter changes course: Rep. Duncan Hunter says he has halted campaign payments to his wife. The congressman is under federal criminal investigation amid allegations of using campaign money for personal purposes. San Diego Union-Tribune\nOops! L.A. City Council candidate Joe Bray-Ali apologized for comments he made about Mexicans in a video on YouTube. Los Angeles Times\nChanging tune: Since he almost lost in November, Rep. Darrell Issa has shifted toward the center on several issues, including calling for Atty. Gen. Jeff Session to recuse himself from the Russian investigation and being hesitant about Trump’s attempts to repeal the Affordable Care Act. Los Angeles Times\nTrain fare: The California treasurer sold $1.2 billion in high-speed rail bonds Thursday, which would be tapped for Central Valley construction. Los Angeles Times\nCRIME AND COURTS\nArrest made: A 50-year-old Tennessee man accused of kidnapping his 15-year-old former student was arrested in Northern California — and the teenage girl was recovered safely after she was missing for more than a month. Los Angeles Times\nA gun snafu: Federal officials have admitted that procedures were violated at Los Angeles International Airport when an off-duty police officer boarded a flight to Taiwan with a handgun in her carry-on bag. Los Angeles Daily News\nBig sting: Prosecutors charged 26 doctors and other medical professionals Thursday in an alleged $40-million kickback scheme that may have defrauded up to 13,000 patients in California. Los Angeles Times\nTHE ENVIRONMENT\nYard makeover: The drought is over, but some homeowners say they will be keeping their water-sipping landscapes. This home in Woodland Hills shows that you don’t need turf to look good. Los Angeles Times\nThe salad squeeze: Too much rain in the state has squeezed U.S. salad supplies, and it may be a several more weeks before supermarket shelves are fully stocked again. That means the salad shortage could last until May. Bloomberg\nA clean car problem: Zero-emissions vehicles aren’t selling, according to car consultant Eric Noble. In his mind, it would be better if the state incentivized purchases of low-emissions vehicles rather than zero-emissions vehicles. Capital and Main\nCALIFORNIA CULTURE\nOut at night: To beat the crowds, surfers in San Diego are heading out after sunset and braving the waves with LED boards. Sharks, not visibility, are their biggest concern. New York Times\nTwenty-five years on: There are two new documentaries about the L.A. riots that are coming out, as the 25th anniversary of the violence approaches. Here are Los Angeles Times’ film critic Kenneth Turan’s thoughts on both. Los Angeles Times\nGo west! What’s been billed as the best Mexican restaurant in New York City, Cosme, is coming to L.A. The spot will probably open in 2018. Eater LA\nTakei alert: The musical “Allegiance,” inspired by the early life of actor George Takei in World War II internment camps, will come to L.A. in 2018, co-producers East West Players and the Japanese American Cultural & Community Center announced Thursday. Los Angeles Times\nCALIFORNIA ALMANAC\nLos Angeles area: sunny Friday, partly cloudy Saturday. Sacramento, San Diego and San Francisco area: sunny Friday and Saturday. More weather is here.\nAND FINALLY\nToday’s California memory comes from Vic Pentz:\n“When I grew up in inland Riverside during the 1960s, a constant tug was the lure to escape our orange groves for the sensual delights of Newport Beach. Some afternoons, the rumor ‘surf’s up!’ seemed to almost empty out our high school in a caravan of cars down the 91. Invariably my father seemed to know. ‘You ditched school for Newport!’ he’d fume. How did he know? One day we looked out the window and spotted Dad leaning in behind the steering wheel, jotting down the odometer mileage. In auto shop class my brother soon learned how to disconnect and reconnect the odometer cable. It was simple now. Just wash all the sand off really well before heading home.”\nIf you have a memory or story about the Golden State, share it with us. Send us an email to let us know what you love or fondly remember about our state. (Please keep your story to 100 words.)\nPlease let us know what we can do to make this newsletter more useful to you. Send comments, complaints and ideas to Benjamin Oreskes and Shelby Grad. Also follow them on Twitter @boreskes and @shelbygrad.",
    "label": 3
}