{
    "index": 102,
    "text": "President Trump made assailing the Washington, D.C., media a central theme of his roughly one-hour speech Saturday night at a rally in Harrisburg, Pennsylvania, marking the end of his first 100 days in office.\n\"As you may know, there's another big gathering taking place tonight in Washington, D.C., did you hear about it?\" Mr. Trump said, as the crowd supported his statement with boos directed at the media. \"A large group of Hollywood actors and Washington media are consoling each other in a hotel ballroom in our nation's capital right now.\"\n\"They are gathered together for the White House Correspondents Dinner without the president,\" Mr. Trump continued. \"And I could not possibly be more thrilled than to be more than 100 miles away from Washington's swamp, spending my evening with all of you and with a much, much larger crowd and much better people, right?\"\nMr. Trump said the media are a \"disgrace,\" and deserve a big \"failing\" grade for their performance covering his administration thus far. The president said the press has portrayed his presidency in almost an entirely negative light.\nSpecifically, Mr. Trump disparaged MSNBC and CNN as \"fake news,\" before attacking the \"failing\" New York Times. Mr. Trump called the newspaper's staffers \"incompetent, dishonest people.\" Mr. Trump made comments about the media through his speech, saying his first 100 days has \"exhausted\" the Washington press corps.\nBut Mr. Trump didn't only have criticism for the media, also assailing Democrats in Congress and even seemingly threatening Republicans. The president emphasized that would be very \"mad\" at members of Congress if they didn't repeal and replace Obamacare, and soon.\nPennsylvania was a key win for Mr. Trump, helping propel him to victory with its 20 electoral college votes. Mr. Trump held a victory rally in the state after his Election Night win.\nThe president's speech was marked by a couple bizarre moments, such as when Mr. Trump stopped in the middle of his remarks to point out someone apparently holding a \"Blacks For Trump\" sign.\n\"Thank you for that sign — Blacks for Trump — I love that guy,\" the president said. \"Thank you, man. That's really great. I really appreciate it.\"\nEventually, Mr. Trump began addressing his purported accomplishments throughout the first few months of his administration, such as an increased focus on the safety of law enforcement and border security.\nMr. Trump reiterated that the border wall will be built, amid skepticism and the fight in Congress for funding the border wall.\n\"Go home, go to sleep, rest assured,\" Mr. Trump said.\nMr. Trump reiterated themes of being tough on immigration, crime and \"radical Islamic terrorists,\" he said to cheers.\n\"We are going to keep radical Islamic terrorists the hell out of our country,\" he said.\n\"Together, we will make America strong again,\" Mr. Trump concluded his speech. \"We will make America wealthy again. We will make America prosper again. We will make America proud again. We will make America safe again. And we will make America great again.\"\nMr. Trump has decried the 100-day standard as \"ridiculous\" even as the White House created a site trumpeting his purported successes in that amount of time.\nHost of CBS News' \"Face The Nation\" John Dickerson spoke Mr. Trump earlier Saturday at the White House for an exclusive interview that will appear Sunday on \"Face The Nation\" and Monday on \"CBS This Morning.\"\nFollow our blog from earlier below.\n8:48 p.m. Trump ends his speech after roughly one hour on stage.\n8:43 p.m. Mr. Trump said he would be very \"mad\" at members of Congress, including a couple of the members present in the audience, if they didn't pass Obamacare repeal and replacement quickly.\n8:33 p.m. \"We are going to keep radical Islamic terrorists the hell out of our country,\" Mr. Trump said\n8:29 p.m. Mr. Trump decried the spread of \"transnational gangs\" into \"all 50 states,\" honing in on MS-13.\n\"My administration will not rest until we have dismantled these violent gangs, and we're doing it rapidly,\" and sending them back to their countries, he said.\n8:26 p.m. Mr. Trump touted a new office for victims of immigration-related crime.\n\"We need safety, We need cameras,\" Mr. Trump said, adding, \"We need the wall.\"\nMr. Trump reiterated that the border wall will be built, amid skepticism and the fight for border wall funding in Congress.\n\"Go home, go to sleep, rest assured,\" he said.\n8:23 p.m. Mr. Trump said the U.S. is imposing immigration control like you've \"never seen before.\"\n8:21 p.m. The president says a lot of people on his staff aren't happy about post-White House lobbying restrictions, but says that's \"OK.\"\n\"It is time to drain the swamp,\" Mr. Trump said.\n8:15 p.m. Mr. Trump said that if he can't get a good deal for workers on NAFTA, he will terminate it.\n8:11: Mr. Trump stopped his speech to point to a man apparently holding a \"Blacks for Trump\" sign, saying he appreciates the support.\n\"Thank you for that sign. 'Blacks for Trump.' I love that guy,\" Trump says. \"Thank you man. That's really great. I really appreciate it.\"\n8:10 p.m. Mr. Trump, pointing to the media said \"those people\" are \"exhausted\" from the business of his first 100 days.\n\"We are eradicating the criminals and cartels that have infiltrated our country,\" Mr. Trump said, listing some of his work so far.\n8:07 p.m. Mr. Trump acknowledges that China has manipulated its currency, but that the country may help with the situation in North Korea.\n\"I believe he wants to get that situation taken care of,\" he said of Chinese president Xi Jinping.\nAgain, Mr. Trump criticized the media for pointing out that Mr. Trump reversed course on calling China a currency manipulator.\n\"You understand,\" he told the audience, about the reason for his seeming course reversal on China.\n8:06 p.m. \"We are not going to let other countries take advantage of us anymore,\" Mr. Trump said, saying from now on, the policy will be \"America first.\n8 p.m. Trump goes off on a rant about the \"failing\" New York Times, discussing the company's real estate history. He decries the NYT's \"nasty\" op-eds telling him how to run the country.\nMr. Trump called NYT staffers, \"incompetent, dishonest people.\"\nMr. Trump said the media deserves a big fat \"failing\" grade.\n7:54 p.m. Mr. Trump called the media a \"disgrace,\" supported by loud boos from the audience.\n\"As you may know, there's another big gathering taking place tonight in Washington, D.C., did you hear about it?\" Mr. Trump said. \"A large group of Hollywood actors and Washington media are consoling each other in a hotel ballroom in our nation's capital right now. They are gathered together for the White House Correspondents Dinner without the president. And I could not possibly be more thrilled than to be more than 100 miles away from Washington's swamp, spending my evening with all of you and with a much, much larger crowd and much better people, right?\"\n7:49 p.m. Mr. Trump walks on stage, amid cheers and people clamoring to capture the moment on their phones.\n7:48 p.m. \"He's putting Iran on notice,\" Pence said of the president, adding that he's standing strong in regards to North Korea.\n\"Thanks to president Donald Trump, ISIS is on the run\" in Afghanistan, Iraq and Syria, Pence said.\n7:45 p.m. Chants of \"build the wall, build the wall\" break out after Pence says the president is keeping his commitment to tough immigration policies.\n7:42 p.m. Chants of \"U.S.A., U.S.A\" break out after Pence announces Mr. Trump's latest executive order on trade, signed in Pennsylvania Saturday night.\nPence says Mr. Trump will not relent until Obamacare is repealed and replaced. He adds that more than \"500,000 jobs\" have been created since the beginning of the year in America.\n7:39 p.m. Vice President Mike Pence takes the stage, saying, \"Hello, Pennsylvania!\"\nCBSN Originals recently returned to Erie, Pennsylvania to reconnect with locals who hoped a fresh approach in Washington would bring about change in their struggling home town. Airing on May 21 at 8 p.m. EST, \"America | Redefining Hope\" looks at how that hope has evolved.",
    "label": 3
}