{
    "index": 424,
    "text": "Oregon Gov. Kate Brown: How Trump convinced Democratic women to run for office\nShow Caption Hide Caption Oregon Gov. Kate Brown on the Trump-fueled surge in women candidates Oregon Gov. Kate Brown credited President Trump with a dramatic increase in the number of Democratic women considering campaign bids. USA TODAY\nOregon Gov. Kate Brown is one of five women currently serving as governors in the United States. Last November, Brown, who is bisexual, also became the first openly LGBT candidate in American history to win election to a governorship. As Oregon’s secretary of state, she had succeeded to the governorship in 2015 when John Kitzhaber resigned. Brown, 56, spoke with Capital Download on Wednesday in Washington, where she was featured at a conference hosted by EMILY's List, a group that boosts Democratic women for public office. Questions and answers have been edited for length and clarity.\nQ: In the last election cycle, over almost two years, 920 women contacted EMILY's List about running for office. Since Election Day in November, more than 12,000 have. What’s happening?\nBrown: In the past, women needed to be asked to run. Men wake up in the morning and decide to run for Congress, and we had to beg women to run for office. So clearly women are seeing an opportunity that they can help move this country forward. They don’t want to go backwards in terms of reproductive rights, in terms of family leave policies, and they realized that they can make a difference, and they can.\nQ: Is it a reaction specifically to President Trump’s election?\nBrown: There was a level of complacency in the progressive community, and that level of complacency is gone. People have realized. I’ve got to get out there. I’ve got to march in the streets. I’ve got to register people to vote. I’ve got to help support organizations that elect progressive candidates, and I need to run for office myself.\nQ: And a reaction to Hillary Clinton’s defeat?\nBrown: Absolutely. It was a wake-up call for people around this country that if we really believe in American values, in American principles, we’re going to have to fight for them.\nRead more:\nQ: Why do you think Clinton lost?\nBrown: I think it was multiple factors that cost her the election. Definitely sexism. That’s something that I’ve experienced on the campaign trail. Voters are reluctant to see women in executive offices. That’s why it’s so important that we get more women, younger women, out running for school boards and for state legislatures and for city councils and for mayors, because these are the pipeline that will help us put more women in the governors’ offices and frankly a woman in the White House.\nQ: Why are the numbers of women in governorships, in Congress, stalled?\nBrown: There’s absolutely no question that it is very challenging for women to run for office. First of all, women need to be asked, not just once, multiple times. Secondly, women don’t think they’re qualified. Third, they also have a lot on their plates. They’re raising families. They’ve got good jobs. They’re working hard to keep the household going. How can you put running for office on top of all of that?\nI think a number of women have realized they have to do it now, that they can really make a difference.\nQ: How much difference does it make to have women in office?\nBrown: Are you kidding me? I fought for 17 years in the Oregon legislature to pass a bill that required insurance companies to cover contraceptives. If we had had a majority of women in the legislature, I think it would have taken two seconds. Absolutely, it’s huge.\nWhen women are at the leadership table, the agendas change. We have conversations about what kind of leave makes sense for families, how do you encourage new parents to take time off of their jobs and stay home with their newborns? That means it has to be paid if we want people to do it. How do we make sure that women have access to the full complement of health care services that we need? How do we make sure there’s no pay discrimination happening in our states? That’s the kind of conversation that women lead when they’re at the table.\nQ: Trump is expected to sign an executive order on religious freedom that would allow religious institutions to discriminate on the basis of sexual orientation. What do you think about it?\nBrown: It’s deplorable. It’s awful. And it shouldn’t happen in this country.\nQ: We asked on social media for questions from readers. Here’s one from Joe Palazzolo on Twitter: “Apart from [Massachusetts Sen. Elizabeth] Warren, whom does she see as the potential women presidential candidates for 2020?\"\nBrown: Amy Klobuchar, Minnesota senator. You’ve got Kirsten Gillibrand from New York. Kamala Harris from California.\nQ: You were the first woman to be the leader of the state Senate in Oregon, then secretary of state and now governor. Are you interested?\nBrown: I’m very happy serving the state of Oregon right now.\nQ: You say Democrats are united, but Democratic leaders have been divided on this: Should abortion rights be a litmus test for Democratic candidates?\nBrown: I think it’s really important that we welcome a diversity of voices within the Democratic Party tent, but for me reproductive choice is such a crucial human rights issue. I don’t believe that until women have the ability to control our bodies that we can control our lives, and so I see it as essential.",
    "label": 3
}