{
    "index": 306,
    "text": "The House won’t vote on Republican legislation that would scuttle much of President Obama’s healthcare law until at least next week, a GOP leader said late Thursday. The decision deals a setback to the White House, which has pressured congressional Republicans to pass the bill by Saturday, President Trump’s 100th day in office.\n“As soon as we have the votes, we’ll vote on it,” House Majority Leader Kevin McCarthy (R-Bakersfield) told reporters after leaving a meeting of the House GOP leadership that lasted nearly two hours. He said the vote would not occur Friday or Saturday.\nWhite House and Republican leaders had labored all day to wring votes out of resistant moderate GOP lawmakers for the healthcare measure. But they remained shy of the number they’d need to revive a Republican bill that was withdrawn last month for lack of support, and it was uncertain when a vote on the revamped legislation might occur.\nCentrist Republicans were the primary target of the lobbying, a day after the conservative House Freedom Caucus announced its support for the revised proposal. The fresh backing from that group exhumed the bill from the legislative graveyard, but leaders need moderates who’ve resisted entreaties to jump aboard.\nWhile the White House was eager for a vote this week, House Speaker Paul D. Ryan (R-Wis.) wants to avoid an encore of last month’s embarrassment, when he had to abruptly cancel the vote on the initial proposal because of opposition from moderates and conservatives alike.\nAdvertisement\nRyan told reporters that leaders were making progress but added, “We’re going to go when we have the votes.” He noted that he had spoken earlier this year about a 200-day legislative plan because of the complexity of revamping the nation’s health system, its tax code and border security.\nTrump and Vice President Mike Pence spoke to at least one resistant conservative who is now a yes vote. Rep. Mo Brooks (R-Ala.) said he’d already decided to switch to backing the revamped bill on Wednesday before he got two phone calls from Pence, who on the second call handed the phone to Trump.\n“Donald Trump expressed his appreciation for the position I was taking,” Brooks said Thursday. “That gives you a good feeling inside about what you’re doing.”\nThe recast bill would let states escape a requirement under Obama’s healthcare law that insurers charge healthy and seriously ill people the same rates. They could also be exempted from the mandate that insurers cover a list of services such as maternity care and mental health care, and from its bar against charging older customers more than triple the rates for younger ones.\nOverall, the legislation would cut the Medicaid program for the poor, eliminate Obamacare’s fines for people who don’t buy insurance and provide generally skimpier subsidies.\nDemocrats remain solidly against the legislation, which they said would make healthcare coverage less available and costlier. House Minority Leader Nancy Pelosi (D-San Francisco) told reporters that for Republicans, voting for the bill “is going to be doo-doo stuck to their shoe for a long time.”\nConservatives embraced the revisions as a way to lower people’s healthcare expenses. Moderates saw them as diminishing coverage because insurers could make policies for their least healthy customers too costly for them to afford.\n“No bill is going to solve every issue,” said Rep. Tom MacArthur (R-N.J.), who crafted the newest edition of the legislation with Rep. Mark Meadows (R-N.C.), who heads the House Freedom Caucus. MacArthur is a leader of the roughly 50 moderate Republicans who make up the House Tuesday Group, but it is unclear whether he has won over many of their votes, and he conceded that some “are struggling to get to yes.”\nTwo moderate Pennsylvania Republicans affirmed Thursday they would vote no — Reps. Patrick Meehan, who’d been publicly undeclared, and Ryan Costello, who’d said he’d have opposed the original bill.\nBoth cited fears that the new bill would leave people with serious illnesses unprotected. Meehan said he was called recently by Pence and lobbied “by everyone in leadership.”\nThe American Medical Assn. said it opposed the refashioned bill, as it did the original legislation. The doctors’ group said letting insurers boost premiums for people with preexisting conditions “will likely lead to patients losing their coverage.”\nSome lawmakers and GOP aides suggested leaders were less than 10 Republican votes away from the 216 needed to prevail. No Democrat has supported either version of the bill.\nALSO\nEconomic reality and contradictions beset Trump’s tax plan\nHiltzik: This one unbelievably expensive Iowa patient makes the case for single-payer healthcare\nObamacare 101 — What’s the big debate over health insurance cost-sharing subsidies?",
    "label": 3
}