{
    "index": 305,
    "text": "Any single event can mislead when it comes to deciphering the political environment. Many of the more than 18,000 people clamoring for Hillary Clinton on the Ohio State University campus in mid-October — her biggest audience to that point in the presidential campaign — probably did not foresee her blowout defeat in the state less than a month later. Nor did many see Donald Trump surviving the cataclysmic events that enveloped his presidential campaign.\nBut, with appropriate caution, it’s safe to say that last week’s Los Angeles town halls featuring Dianne Feinstein and Kamala Harris spoke to the crosscurrents among Democrats today and the different approaches by — and difficulties facing — California’s two senators.\nBoth town halls were held in politically active African American churches south of downtown: Feinstein’s at First African Methodist Episcopal and Harris’ at Holman United Methodist Church. The locations appeared calculated to set a floor of civility. At First AME, Feinstein spoke of the warmth she’d felt from that congregation going back decades; at Holman, the Rev. Kelvin Sauls reminded those gathered to see Harris that “we are in a sacred place.”\nWarmth wasn’t all that greeted Feinstein, who heard catcalls throughout from a crowd far more demanding than the one that greeted Harris the following day.\nThe differences were obvious between the two Democrats, one starting her Washington career with more than five years to go before reelection, the other pondering whether to run for a fifth full term in 2018.\nAdvertisement\nHarris is the rookie, elected last November after two successful campaigns for state attorney general. That she campaigned during a time of anger and discontent seemed to give Harris a better understanding of where her audience was coming from and how to assuage their concerns.\nMost who attended appeared to see her as one of them and tabled any hard questions. And, to a great extent, Harris’ Senate career is prospective, the tough decisions ahead of her and not an assailable part of her record.\nFeinstein, the veteran, underscored her longevity in office by lapsing into Senate-speak, with occasional references to rules of order that matter not outside the Capitol. But she also offered pointed reminders of how long it can take to accomplish anything in Washington: Speaking of a measure she helped push to raise vehicle mileage standards, she noted that it had taken 10 years and cooperation with Republicans to succeed.\nHarris opened with an ode to the “pivotal moment” that she said the nation had reached. She made an overt call at several points to rise up against President Trump and his proposals, mocking his tough take on immigrants.\n“They’re gonna deport almost 12 million people?” she asked with exaggerated sass. “Now how you gonna do that?”\nThe proper approach, she said to hearty applause, was to create a path to citizenship for those in the country who “are living a lawful life and paying taxes.”\nShe spoke movingly about her optimism and the country’s values despite the unsettled political environment. She exhorted Democrats to run against Trump as if engaged in a long relay race.\n“We cannot tire. We cannot tire because there is too much at stake,” she said.\nWhen Mark Halperin, one of the hosts of Showtime’s political series “The Circus,” asked Harris afterward what “the resistance” meant to her, she offered multiple sound bites perfectly tailored to the mood of the moment, at least among the activist wing of the Democratic party.\nFor more on politics »\n“The resistance means, for a democracy, every voice being heard, every voice being valued and together, unified, those voices will show us what the future looks like,” she said, smiling. “And I’m all for the resistance.”\nThe day before, asked the same question, Feinstein responded not with poetry but with prose, with the sort of specifics she embraced through more than 24 years in the Senate.\n“Resistance to me means doing the best I can to serve people in the way we do. It’s resistance to the president’s budget, which is just terrible. It’s resistance to executive orders which turn back history. It’s resistance to his position on immigration, which is hard,” she said, marching earnestly through a litany of issues.\nHer answers were not always what the more argumentative and partisan members of her crowd — and, increasingly, the Democratic base — wanted to hear.\nProtesters shouted when she declined to sign on to the Medicare-for-all insurance bill pushed by Sen. Bernie Sanders, the independent from Vermont. She preferred, she said, to fix Obamacare. They shouted again when she decried Russian interference in the presidential election. (They wanted to talk about the Democrats’ own internal party squabbles.)\nWhen she acknowledged supporting Trump’s recent missile attack on a Syrian airbase, one screamed: “You’re defending Trump!”\n“I’m telling you how I see it,” she responded.\n“Look, I have been drowned out by the very best,” she said later. “I have seen it all. … I know the terrible things that happen and I know how to cure them. And there’s only one way to do it, and that’s to work together, and you can yell and scream and go out there and do whatever you want, and it doesn’t change anything.”\nFeinstein, at 83 the oldest member of the Senate, has said she will decide soon whether to run again. The last time she was on the ballot was in 2012, in the more placid Obama reelection year. A woman who became mayor of San Francisco in 1978 when her predecessor was assassinated seems unlikely to be put off by protesters, and Feinstein would remain a prohibitive favorite if she runs again.\nBut her town hall was a reminder that even among Democrats, she is likely to face more scrutiny than she has in her prior races, which have been easy since a near-defeat in 1994.\nWhat America needed, she said, was “know-how” and the willingness to put together the compromises disdained by many.\n“That ought to be worth something,” she said.\nHer words might have been a swan song about a time gone past. Or they might be the message that Feinstein will lean on next year, whether or not it placates the most impatient voters in these fraught times.\ncathleen.decker@latimes.com\nTwitter: @cathleendecker\nALSO:\nThe fight against climate change in California gains an unlikely ally: Republicans\nWhite House announces proposal to cut taxes, a plan likely to increase deficit\nThe latest from Washington\nUpdates on California politics",
    "label": 3
}