{
    "index": 85,
    "text": "Scott Pruitt in his previous role took part in numerous suits against the EPA.\n— -- EPA chief Scott Pruitt has recused himself from lawsuits against the Environmental Protection Agency that he was involved in as Oklahoma's attorney general.\nPruitt’s recusal statement, obtained by E &E news and dated May 4, outlines several lawsuits he has agreed not to be involved in until one year after his Senate confirmation on Feb. 18 of this year. He also will not take part in any cases in which the state of Oklahoma is a party.\n\"I am taking this action to avoid even the appearance of any impropriety,\" Pruitt said in the statement.\nIn his previous role as Oklahoma attorney general, Pruitt participated in more than a dozen lawsuits against the EPA, including challenges to the Obama-era's Clean Power Plan and a rule related to the Clean Water Act.\nPruitt said in his statement Thursday that his recusal \"addresses all of my ethics obligations.\"\nDuring Pruitt's confirmation hearing, Democrats pressed him on his stances on rules intended to protect against climate change and air and water pollution and urged him to recuse himself from the 14 cases in which he had participated in lawsuits against the agency he was named to lead.\n\"What the American people are expecting here is that the EPA doesn't turn into every polluters' ally,\" Sen. Edward Markey, D-Massachusetts, said to Pruitt during his hearing, urging him to recuse himself \"from every case you brought.\"\nPruitt at the hearing discussed his view that the bulk of environmental regulations should be in the hands of the states.\nIn explaining his decision to now recuse himself from the lawsuits, Pruitt wrote in the statement that he had conferred with the Office of General Counsel's Ethics Office and determined, \"I must recuse myself from matters in which I have a financial interest, or a personal or business relationship.\"\n\"I am committed to enacting the president's regulatory agenda by reviewing, revising or rescinding rules and regulations created by the previous administration that cause undue or unnecessary stress on American jobs or the economy,\" Pruitt said in a statement about the recusal. \"While I have recused myself from making decisions on specific cases, it is my duty and privilege as the Administrator of the Environmental Protection Agency to actively engage in rulemaking.\"",
    "label": 2
}