{
    "index": 363,
    "text": "Worried about homes being operated like hotels, Los Angeles lawmakers have been weighing new regulations that would cap the number of nights Angelenos can rent out their homes for short stays.\nBut when Mayor Eric Garcetti proposed his budget, he banked on allowing Airbnb rentals to continue without those kind of restrictions. City officials say the plan assumes the “status quo” on such rentals, which are already sending tens of millions in tax revenue to the city, because new rules have yet to be approved.\nRelying on that money has nonetheless troubled some city lawmakers, neighborhood activists and representatives of the hotel industry, who fear that Los Angeles could face pressure to adopt looser regulations to avoid hurting its bottom line.\nAirbnb, for instance, has asserted that current proposals to restrict its rentals could cost the city some $15 million in tax revenue.\nIf the city ends up depending on that money, it could “build up a fiscal firewall against sensible regulations” on Airbnb and similar platforms, said City Councilman Mike Bonin, who has pushed to bar Angelenos from renting out a home for short stays if it is not their primary residence. “I don’t know if the budget committee is going to accept that.”\nAdvertisement\nRenting out rooms or whole homes for short stays is currently barred in many neighborhoods, according to the planning department. But those rules are rarely enforced. The phenomenon has exploded with the rise of online platforms such as Airbnb and HomeAway, which link travelers to hosts offering places to stay.\nAirbnb and its backers say hosting travelers is an economic lifeline to homeowners and a boon for local businesses, bringing tourist spending to new parts of the city. But critics counter that without regulations, some homes and apartments have been rented out constantly like hotels, disrupting neighborhoods and displacing tenants.\nL.A. is still debating rules that would legalize and restrict such rentals. But as that plan slowly works its way through City Hall, Los Angeles is already taxing some of them: Under an agreement with Airbnb struck last year, the company is charged with collecting lodging taxes from its hosts and passing the money along to the city.\nCity officials estimate that by the end of June — 10 months after the money started flowing — Airbnb rentals will have yielded more than $27 million in lodging taxes. The company argues that such rentals increase that tax revenue overall by bringing new travelers to Los Angeles.\nThe budget proposed by Garcetti for next year includes more than $33 million from Airbnb and any other rental platforms that agree to collect lodging taxes, part of his plan to close an estimated $263-million shortfall.\nIt is one of several sources of revenue that hinge on upcoming policy decisions at City Hall, along with money from digital billboards and a development fee.\nAssistant City Administrative Officer Benjamin Ceja said that when it comes to existing sources of revenue such as the lodging taxes, the standing practice has been to assume the “status quo” because “the unknown impact of policy decisions and timeline for implementation can be difficult to accurately predict and quantify.”\nAirbnb has warned that revenue could be slashed by proposed restrictions. In a recent letter to lawmakers, it estimated that a proposal that caps such rentals at 180 days annually — an idea already backed by the planning commission and a council committee — would knock $15 million off an estimated $37 million in annual funding for the city.\n[Tax money from short-term rentals] has become a sort of drug that they have a hard time saying no to. — Judith Goldman, co-founder of Keep Neighborhoods First, which wants to cap short-term rentals at 60 days a year.\nThe Los Angeles Short Term Rental Alliance, which includes hosts who use Airbnb, HomeAway and other platforms, has also warned against caps.\n“If you cut the number of days in half, there’s no way that you can get the same amount of revenue,” said its executive director, Robert St.Genis. “Why would the city want to turn away opportunities to increase revenue?”\nThe hotel industry has disputed the idea that city revenues are at risk. Lynn Mohrfeld, president and chief executive of the California Hotel & Lodging Assn., argued that if the city restricts Airbnb and similar platforms, many travelers would instead go to hotels that also collect lodging taxes. In addition, he said, more Angelenos might sign up as Airbnb or HomeAway hosts to meet the demand.\n“I just don’t buy the premise that if you limit it, people are going to go away,” Mohrfeld said.\nNeighborhood activists and housing advocates concerned about “commercialized” rentals have urged the city not to rely on the predicted revenue from taxing Airbnb rentals. Many were leery when the city first struck the tax agreement, fearing it would discourage future regulations. Now they say the proposed budget bears out those fears.\nThe tax money “has become a sort of drug that they have a hard time saying no to,” said Keep Neighborhoods First co-founder Judith Goldman, whose group wants to cap short-term rentals at 60 days annually. “We can’t allow City Hall to make decisions based on the bottom line instead of the good of our city.”\nIn a written statement, Garcetti spokesman George Kivork said that the mayor supports “reasonable regulations of short-term rentals” like the proposed rules backed by the planning commission. Those draft regulations included a cap of 180 days annually, as well as registration requirements and other restrictions.\nBut “the budget reflects the current collection agreement with Airbnb, as final council approved policy is still pending,” Kivork wrote.\nAirbnb did not weigh in specifically on the budget plan, but its Los Angeles deputy policy manager, Connie Llanos, said in a written statement that the company was eager to adopt “common sense home sharing rules that empower our hosts and protect the quality of life in our neighborhoods.”\nAt a recent hearing at City Hall, Councilwoman Nury Martinez asked city staffers to provide their own estimates of how different regulations might affect the lodging tax revenue. However, Martinez stressed that she did not want the budget item to decide what rules they would ultimately impose.\nFinancial officials point out that even after the budget is adopted, the city can adjust its plans if revenues shift.\nCeja, the assistant city administrative officer, said that “if and when policies are adopted that impact the assumed revenue for the year, this office will report on options to address any revenue shortfalls.”\nemily.alpert@latimes.com\nTwitter: @LATimesEmily",
    "label": 3
}