{
    "index": 419,
    "text": "Obama's $400,000 speech could prompt Congress to go after his pension\nShow Caption Hide Caption Obama's presidential pension may get pinched Former President Obama's pension could take a hit with his high-priced speaking engagements. USA TODAY\nWASHINGTON — Last year, then-president Barack Obama vetoed a bill that would have curbed the pensions of former presidents if they took outside income of $400,000 or more.\nSo now that former president Barack Obama has decided to accept $400,000 for an upcoming Wall Street speech, the sponsors of that bill say they'll reintroduce that bill in hopes that President Trump will sign it.\n\"The Obama hypocrisy on this issue is revealing,\" said Rep. Jason Chaffetz, R-Utah, chairman of the House Oversight and Government Reform Committee and sponsor of the 2016 bill. \"His veto was very self-serving.\"\nChaffetz and Sen. Joni Ernst, R-Iowa, the sponsor of the companion Senate bill, say they will re-introduce the Presidential Allowance Modernization Act this month. The bill would cap presidential pensions at $200,000, with another $200,000 for expenses. But those payments would be reduced dollar-for-dollar once their outside income exceeds $400,000.\nThe issue isn't a partisan one — or at least, it wasn't last year. The bill passed both the House and Senate with no opposition, and no veto threat had come from the White House.\nSo when Obama's veto came one Friday night last July — on the last day for him to sign or veto the legislation — it took lawmakers by surprise. It was the 11th of Obama's 12 vetoes.\nAt the time, Obama argued that the bill would have \"unintended consequences\" and \"impose onerous and unreasonable burdens\" on former presidents by requiring them to immediately lay off staff and find new office space.\nRepublican leaders did not call up the bill for a veto override, which would have required a two-thirds majority in both chambers.\nDemocrats say they won't necessarily oppose changes.\nRep. Elijah Cummings, D-Md., the top Democrat on Chaffetz's committee, was a co-sponsor of the original bill. “Cummings definitely supports the concept, and if we can work out the technical issues with the bill that arose late in the last Congress, we expect he would strongly support it again,\" said spokeswoman Jennifer Hoffman Werner.\nTrump has not taken a position on the legislation. But during the campaign, he said he'd take a close look at pensions for elected officials — especially members of Congress.\n\"The first thing I’m going to do is tell you that if I’m elected president, I’m accepting no salary, OK?\" he said at a town hall in 2015. \"They get benefits that nobody else can even think about, OK. And they don’t like to talk about it. But we’ll work on that.\"\nUnder the Former Presidents Act, the nation's five living former presidents — Jimmy Carter, George H.W. Bush, Bill Clinton, George W. Bush and Obama — get a pension equal to the salary of a current cabinet secretary: $207,800 in 2017. They also get $150,000 to pay staff, and “suitable office space, appropriately furnished and equipped.\"\nIn 2015, the entire benefit package ranged from $430,000 for Carter to $1.1 million for George W. Bush.\nWith Obama joining the club as of Jan. 20, the 2017 spending bill approved by the House Wednesday contained nearly $3.9 million for all the former presidents through Sept. 30 — a $588,000 annual increase.\nObama spokesman Kevin Lewis said the former president had no comment on the legislation.\nObama has already shown he has considerable potential to raise money in his post-presidential career. He and his wife Michelle have signed a publishing deal for two separate books, which the Financial Times reported was worth at least $65 million. And the Wall Street speech — a health care conference planned by investment firm Cantor Fitzgerald in September — will reportedly net him another $400,000.\n\"President Obama will deliver speeches from time to time,\" said Eric Schultz, a former White House spokesman who continues to advise Obama. \"Some of those speeches will be paid, some will be unpaid, and regardless of venue or sponsor, President Obama will be true to his values, his vision, and his record.\"\nObama has said he also plans to use his post-presidency to work on a range of issues through his presidential center in Chicago. On Wednesday, he unveiled the design of that center and said he would donate $2 million to a summer jobs program for Chicago youth.\nA spokesman for President George H.W. Bush said he does not oppose changes to the law, and expects that Congress will likely take some action.\n\"At age 93, he recognizes that any change to the act would have a greater impact on the other former presidents,\" said spokesman Jim McGrath. \"For the sake of future occupants of the office, he does think some consideration should be given to the public role former presidents play — and we are told that very positive conversations addressing that and other matters have taken place.\"",
    "label": 3
}