{
    "index": 427,
    "text": "Meeting Palestinian leader Abbas, Trump hopes for 'terrific' peace deal in Middle East\nShow Caption Hide Caption Trump: 'Very, very good chance' of Mideast peace During a joint statement with Palestinian leader Mahmoud Abbas at the White House Wednesday, Donald Trump said he'll 'do whatever is necessary' to reach a Mideast peace agreement.\" (May 3) AP\nWASHINGTON – President Trump welcomed the leader of the Palestinian Authority to the White House on Wednesday by pledging to accomplish something that many previous U.S. administrations have tried but never achieved: A lasting peace agreement between the Palestinians and Israelis.\n\"We want to create peace between Israel and the Palestinians,\" Trump said during a series of meetings with Mahmoud Abbas, the president of the Palestinian Authority. \"We will get it done. We will be working so hard to get it done.\"\nIn an earlier photo opportunity, Trump acknowledged that the conflict has been going on for a \"long time.\" Still, he said, \"hopefully something terrific can come out\" of future talks between the Palestinians and Israelis. Those talks are not yet scheduled, and it remains unclear whether the U.S. would broker them.\nTrump has assigned his son-in-law Jared Kushner to work on a Middle East peace deal. He's also appointed real estate attorney Jason Greenblatt as Middle East envoy.\nUnderscoring the inherent difficulties of forging a peace agreement, Abbas told reporters that \"it's about time for Israel to end its occupation of our people and of our land after 50 years.\"\nAbbas also praised Trump for what he called his \"great negotiating ability,\" adding, \"With you, we have hope.\"\nIsrael, meanwhile, has protested attacks by the Palestinians and calls from Hamas, the militant group ruling the Gaza Strip, for the destruction of Israel.\nEarlier this week, Israeli Prime Minister Benjamin Netanyahu questioned Abbas's motivations. \"How can you talk about peace and fund terrorism?” he said, calling on his Palestinian counterpart to \"fund peace, not murder\" and cancel payments to families of Palestinians imprisoned in Israeli jails.\nNetanyahu visited the White House in February. Now that he's met with both leaders, Trump said he is ready to \"start a process\" that could lead to a peace deal. \"It is a great honor to have the president with us,\" Trump said of Abbas.\nAaron David Miller, a former State Department negotiator now with the Woodrow Wilson Center in Washington, D.C., said the prospects of a deal hinge less on Trump than on Israelis and Palestinians \"who are unable and unwilling to make the decisions on the core issues that would lead to sustainable agreement.\"\nSo, as Miller says, Trump may want to lower his expectations accordingly. \"Never in decades of working the Arab-Israeli negotiations for Republican and Democratic administrations have I seen a president more confident – with less prospect of success.\"\nIn his first face-to-face meeting with the Palestinian leader – the two have spoken by phone – Trump said he would call on Abbas to abide by Netanyahu's request to end the payments to families of Palestinians imprisoned in Israeli jails, and demand that Palestinian leaders speak out in a \"unified voice\" against anti-Semitic threats and incitement of violence voiced by some of their constituents and media outlets.\n\"There's such hatred,\" Trump said, referring to those incitements. \"But, hopefully, there won't be such hatred for very long.\"\nTrump also called on the Palestinian Authority to help fight the extremist group known as the Islamic State. The two leaders also discussed possible ways to improve the Palestinian economy, said White House spokesman Sean Spicer.\nAnother obstacle to a peace agreement surfaced during Trump's White House meeting with Netanyahu on Feb. 15: Israeli settlements on land in dispute with the Palestinians. \"I’d like to see you hold back on settlements for a little bit,” Trump told Netanyahu, even though the Israeli leader said he doesn't see settlements as the \"core of the problem.\"\nOn Wednesday, with Abbas at his side, Trump said he is willing to be a \"mediator,\" \"arbitrator,\" or \"facilitator\" – if that's what it takes to \"get this done.\"\nIt's clear Trump sees his deal-making skills as central to the negotiating process.\nAt one point, he expressed optimism that striking a peace deal may not be \"as difficult as people have thought over the years.\"\nEven so, he also acknowledged getting both sides to agree on a peace plan could be an uphill climb.\n\"Over the course of my lifetime, I've always heard that perhaps the toughest deal to make is the deal between the Israelis and the Palestinians,\" Trump said. \"Let's see if we can prove them wrong, OK?\"",
    "label": 3
}