{
    "index": 369,
    "text": "Good morning, and welcome to the Essential California newsletter. It’s Friday, April 28, and here’s what’s happening across California:\nTOP STORIES\nOne prominent pastor reflects on the riots\nIt was April 1992, and the Rev. Cecil L. Murray had led the city’s oldest and perhaps most politically active black church for almost 15 years. Back then, the First AME Church played an outsized role in south Los Angeles, serving as a political and religious forum and a place for dialogue about the issues facing the city, most notably the community’s rocky relations with the Police Department. So after having spent all this time trying to cool the city’s anger, all Murray could do was watch helplessly as it burned in flames during the 1992 riots. Los Angeles Times\nPlus: The Times Editorial Board writes: “People cared about the [Rodney] King beating — they knew about the King beating — because they saw it. They saw the footage that was shot by George Holliday from his Lake View Terrace apartment balcony on March 3, 1991, and that was replayed on television countless times, just as today they see the controversial police shootings and beatings captured on surveillance cameras, private smartphones and officer body camera.” Los Angeles Times\n— More than 60 dead. More than 1,000 damaged properties. The riots by the numbers. Los Angeles Times\nAdvertisement\n— For L.A. Koreans, trying to find strength while remembering a dark chapter. NBC News\n— An unlikely icon of the L.A. riots. Daily News\n-- Image of then and now: April 1992 versus April 2017 in L.A. NBC Los Angeles\nWith the 25th anniversary of the L.A. riots fast approaching, your Essential California team wants to hear your memories of those chaotic days. Email your memory to benjamin@latimes.com, and please keep it concise.\nGOP and Democrats team up on climate fight\nIt’s not just Democrats in California who are taking up the mantle of fighting climate change. State Republicans are working with their Democratic colleagues and embracing the state’s complex system of regulations to reduce greenhouse gas emissions. They’ve pledged to work across the aisle at the same time President Trump rolls back national policies on global warming. Los Angeles Times\nCoulter’s canceled speech doesn’t prevent protesters\nBerkeley officials warned students and residents to “keep a distance from violence” Thursday as police prepared for clashes between supporters and opponents of conservative commentator Ann Coulter. Aside from a couple of arrests and a lot of yelling, the confrontation didn’t prompt the fireworks or violence that some were expecting. Los Angeles Times\nL.A. STORIES\nWatch out: Strong winds hit Southern California Thursday night, toppling trees and damaging electric lines. Los Angeles Times\nWho takes the bus? Plenty of money has been allocated to pay for public transportation, but political barriers are still standing in the way. The Economist\nHe’s in trouble: Los Angeles City Council candidate Joe Bray-Ali lost the endorsements of the L.A. Times, City Councilman Mitch O’Farrell and an Eastside Democratic group, one day after Bray-Ali apologized for comments he made in uncensored online forums. Los Angeles Times\nSenator in the spotlight: Sen. Dianne Feinstein is the chamber’s most senior member, and through tragedy and a long career, she has “styled herself as the ultimate pragmatist, a veteran deal-maker willing to collaborate with Republicans to get things done.” Mother Jones\nPlus: At town halls, voters take an uneven measure of Sens. Kamala Harris and Dianne Feinstein. Los Angeles Times\nIMMIGRATION AND THE BORDER\nOops: A public database that the Trump administration said would help crime victims track the custody of suspected criminal immigrants mistakenly listed babies and other children. Los Angeles Times\nA curious revelation: Wells Fargo branches across the country deliberately targeted “undocumented immigrants” to open savings and checking accounts in order to meet aggressive sales goals, according to court documents. San Francisco Chronicle\nPOLITICS AND GOVERNMENT\nWatch the coast: President Trump is expected to sign an executive order that could open large parts of the Pacific, Arctic and Atlantic oceans to new oil and gas drilling, a prospect that elicited a fierce backlash in California and elsewhere even before details of the order were clear. Los Angeles Times\nSingle-payer progresses: California’s sweeping plan to establish a government-run universal healthcare system passed its first committee test when it made it through the Senate Health Committee Wednesday. Los Angeles Times\nWho gets hurt? In its tax proposal released Wednesday, the Trump administration is trying to eliminate the ability to deduct state and local taxes. This would would hurt Californians more than residents of almost any other state. Sacramento Bee\nPlus: Here is a look at some of the major changes that could affect you under Trump’s tax plan. Los Angeles Times\nGive the money back: Palm Springs City Hall has filed a lawsuit attempting to recover a six-acre property that was sold cheaply to a developer two years ago, claiming the deal should be undone because it was motivated by bribes allegedly paid to former Mayor Steve Pougnet. The Desert Sun\nCRIME AND COURTS\nUnion blasts mayor: The union that represents Los Angeles police officers launched a broadside against Mayor Eric Garcetti’s budget on Thursday, warning the spending plan will divert funds away from neighborhood patrols and to the policing of Metro buses and trains. Los Angeles Times\nA depleted force: San Diego is struggling to recruit and retain police officers, and it’s only gotten worse in recent months. Despite recent compensation increases and stepped-up recruiting efforts, the number of officer vacancies has increased from 170 to 207 since October. San Diego Union-Tribune\nFresno shooter update: The suspect in a shooting rampage in Fresno last week, Kori Muhammad, had his criminal proceedings delayed again, because his lawyer is calling his mental competency into question. Fresno Bee\nWoman dead in Walnut Creek: A woman was shot and killed Thursday afternoon on a normally quiet street near a popular museum in Walnut Creek, authorities said. San Francisco Chronicle\nCALIFORNIA CULTURE\nTalk to the chefs: Hear from some of the city’s top culinary maestros about what it means to be a chef in Los Angeles in 2017. Los Angeles Times\nAnd the winner is: Locol, which aims to bring healthy food at affordable prices to areas like Watts and Oakland, was named the L.A. Times’ restaurant of the year. Los Angeles Times\nSell meals out of your house: The state Assembly’s health committee voted this week to move forward AB 626, a California bill that would make it legal for home cooks to sell meals made out of their homes for profit. The Mercury News\nDim sum for fun! “Cantonese cuisine gets short shrift these days. It’s not often included in discussions of exciting Chinese food in Los Angeles County, and I believe that’s because we’re all so used to it.” So begins this list of a few of the better dim sum places in Los Angeles. LA Weekly\nSeen and heard: “Fargo,” the TV series that grew out of the 1996 Coen brothers movie, has been shooting scenes in Los Angeles for next week’s third episode. Los Angeles Times\nCALIFORNIA ALMANAC\nSan Diego, San Francisco and Los Angeles area: partly cloudy Friday, sunny Saturday. Sacramento: cloudy Friday, sunny Saturday. More weather is here.\nAND FINALLY\nToday’s California memory comes from Virginia Davis:\n“I was working at Cal State Dominguez Hills at the time the riots started, and the university sent word we were to evacuate. I got to my car, shared a few words of encouragement to friends and received the same, and started the drive home to Long Beach. I witnessed pickup trucks with grown men and young boys carrying sticks and bats. Perhaps they were just trying to get to safety just like me. This time, because I was afraid, I was afraid of them. Yet I didn’t drive directly home but to the top of Signal Hill. I could see there were fires, and I wanted to get high enough up to know where they were. Was my neighborhood ablaze? Did I need to go somewhere else?\n“Upon reaching the top and looking around, I honestly thought I was seeing a scene from a war zone. I couldn’t accept what I was seeing. Every direction I turned to had fires blazing, massive towers of black smoke, with sirens screaming. I could hardly breathe for the shock of it all, and the air was acrid. This was my home, and we were at war with each other. The sound of gunfire greeted me as I reached my apartment and, as I did reach my place, I knew others were not as lucky. I did not sit in front of my living room window at night for fear of offering a target. A student was pulled off of his motorcycle that night and beaten to death just because he was there, a block from my apartment. There was an outline in tape on the pavement where he was murdered.”\nIf you have a memory or story about the Golden State, share it with us. Send us an email to let us know what you love or fondly remember about our state. (Please keep your story to 100 words.)\nPlease let us know what we can do to make this newsletter more useful to you. Send comments, complaints and ideas to Benjamin Oreskes and Shelby Grad. Also follow them on Twitter @boreskes and @shelbygrad.",
    "label": 3
}