{
    "index": 386,
    "text": "How much does it cost to protect the Trump presidency?\nThe Secret Service does not release information about the costs of protecting the first family. But some hints can be gleaned from publicly released budget data, documents obtained by watchdog groups and government databases.\nThis tally by The Times does not include everyday security for the White House or for the president’s official trips.\nNew York police officers guard the front of Trump Tower. ( Richard Drew / Associated Press )\nTrump Tower: $21 million\nNew York City said in a letter to Congress in February that guarding Trump Tower costs its police department $127,000 to $146,000 a day and its fire department $12,328 a day. The Secret Service asked Congress for $26.8 million for the year to protect the building. All of that comes to about $212,000 a day, or for the first 100 days, $21 million.\nPresident Trump and Chinese President Xi Jinping at the Mar-a-Lago estate in West Palm Beach, Fla. ( Jim M. Watson / AFP-Getty Images )\nWeekends at Mar-a-Lago: $8 million\nThe president spent seven weekends at the Palm Beach, Fla., resort in his first 100 days. It is impossible to separate protection and travel costs when it comes to the president, because security protocol calls for him to fly in military aircraft. Flying Air Force One round trip to Palm Beach costs $669,186, according to information recently obtained by Judicial Watch through a Freedom of Information Act request.\nSecret Service costs add $300,000 or so. Palm Beach County says it has spent at least $2 million on providing security for these weekends. The flying costs, Secret Service and local security add up to about $8 million. It’s hard to distinguish what’s for business and what’s for leisure on these trips; Trump made speeches in Florida at the end of some visits.\nFirst Lady Melania Trump . (Carolyn Cole / Los Angeles Times)\nMelania Trump’s flights: $1.13 million\nBecause the first lady lives in New York, she sometimes flies separately to Palm Beach. She has made two round-trips and two one-way trips, according to the Palm Beach Post. She has also made at least six trips to Washington since the inauguration. The planes assigned to her vary in price from the C-40 at $18,218 an hour to the C-32 at $38,922 an hour. For short hops, she often takes a Gulfstream C-37 at $27,127 an hour.\nThe Air Force declined to provide flight logs. But if she used the larger aircraft for the three-hour flights to Palm Beach and the smallest plane for the one-hour trips between New York and Washington, the total comes to $1.13 million.\nBusiness trips by Donald Trump Jr. and Eric Trump: $1 million\nOne or the other brother has visited Dubai, Scotland, Ireland, the Dominican Republic and Canada since their father took office. The Secret Service won’t say how many agents go on any given trip, but experts said that guarding the brothers would have required at least 20 agents, some of whom may arrive two weeks early. Airfare varies by destination, as does the government’s daily reimbursement rate for hotel and meals ($553 in Dubai, for example). The Times estimated an average of $200,000 for each trip, or a total of $1 million.\nSki trip to Aspen, Colo.: $165,000\nEach of Trump’s five children, their three spouses and his eight grandchildren has Secret Service protection. In March, Donald Trump Jr., his wife and five children, Ivanka Trump and her three children, Eric Trump and his wife were accompanied to Aspen by as many as 100 Secret Service agents. A trip to the ski town by former First Lady Michelle Obama and her two daughters in February cost the Secret Service $165,000, according to records released to the conservative think tank Judicial Watch. The Trumps cost at least that.",
    "label": 3
}