{
    "index": 483,
    "text": "From Obama’s JFK Library speech, the 8 most biting quotes about Trump and Republicans\nShow Caption Hide Caption Obama: We need courage to 'seek common ground' Former President Barack Obama was honored with the John F. Kennedy Profile in Courage Award in Boston Sunday. The ceremony at the John F. Kennedy Presidential Library and Museum was among Obama's first public appearances since leaving office. (May 7) AP\nThough he didn’t mention him by name, much of former President Barack Obama’s speech when he accepted a Profile in Courage Award at the John F. Kennedy Presidential Library on Sunday evening seemed aimed at President Donald Trump and Republicans in Congress who are attempting to dismantle Obama’s signature Affordable Care Act (ACA), also known as Obamacare. Here of some of his more biting quotes, most of which appear directed at Trump as well as in defense of Obamacare:\n***\nAbout members of Congress who voted to pass the ACA during his presidency, only to lose their seat in later elections.\n“They had a chance to insure millions. But this vote could also cost them their seats, perhaps end their political careers. … These men and women did the right thing. They did the hard thing. … Their desire to retain a reputation for integrity was stronger than a desire to remain in office.”\n***\nAbout today’s members of Congress:\n“It is my fervent hope and the hope of millions ... [that] such courage is still possible, that today’s members of Congress, regardless of party, are willing to look at the facts and speak the truth, even when it contradicts party positions.”\n***\nDescribing those in a Boston cancer ward (before the ACA), as told to him by Sen. Edward Kennedy, whose son Ted Jr. was being treated there:\n“These parents lived in constant fear of what might happen if they could not afford the next treatment, some calculating in their own minds what they might have to sell or borrow just to make it for a few more months. Some bargaining with God for whatever they could get.”\n***\nAbout leadership:\n“Any fool can be fearless. Courage, true courage, derives from that senses that of who we are. What are our best selves? What are our most important commitments?”\n“It doesn’t take a whole load of courage to aid those who are already powerful, already comfortable, already influential. But it does require courage to champion the vulnerable, and the sick, and the infirm. Those who have no access to the corridors of power.”\n“That very Kennedy-esque idea that America is not the project of only one person but that each of us can make a difference and all of us ought to try.”\n***\nOn immigrants and immigration:\nI think of … every American who stands up for immigrants because they know that their parents or grandparents or great-grandparents were immigrants too. And they know that America is an idea that only grows stronger with each person who adopts our common creed.”\n***\nAbout diversity and tolerance:\n“Everywhere we see the risk of falling into the refuge of tribe, clan and anger at those who don’t look like us, have the same surnames or pray the way we do. … At such moments we need courage to stand up to hate, not just in others but within ourselves. At such moments we need the courage to stand up to dogma, not just in others but within ourselves.”\nMORE COVERAGE",
    "label": 2
}