{
    "index": 773,
    "text": "A key debate among Republicans on the American Health Care Act — the now-pulled Affordable Care Act replacement bill — was whether to cut the law’s “essential health benefits” for individual health insurance consumers.\nThe AHCA, put forth by House Speaker Paul Ryan and supported by the Trump administration, would have repealed the law known as Obamacare, but kept much of the law intact — including EHBs.\nAdvertisement\nThis was unacceptable to more conservative Republicans, who wanted to see the law completely dismantled. Particularly, a group of legislators known as the “Freedom Caucus” were opposed to the law for not going far enough in its reversal of Obamacare.\nBut on the other side of the GOP, moderate Republicans were already concerned the AHCA would lead to coverage losses, and were opposed to the additional cuts wanted by the Freedom Caucus. Ultimately, this was the debate that forced Paul Ryan to conclude that no consensus could be reached in time for a vote.\nThe series of events is arguably a turning point in U.S. healthcare. Despite almost unanimous Republican opposition to the ACA since its inception, the stalled repeal indicates some legislators are too nervous about the consequences of repeal to move forward.\nEssentially, the ACA may have created a new “healthcare floor” of what consumers, and their representatives, are willing to accept in their coverage.\nAdvertisement\nPre-ACA, the floor was much lower. Individual insurance plans weren’t federally required to cover any of the benefits now mandated by the ACA. But what are these essential health benefits, and why has the tide risen to protect them?\nEssential health benefits are ten services that must be covered by any insurance plan selling individual coverage through the ACA. Employer plans are not required to cover these services, but most already do. The ten services are:\n1. Ambulatory services: This is care received outside of the hospital, like doctor’s offices or surgery centers.\n2. Emergency services: This refers to care in life-threatening situations, including ambulance transportation.\n3. Hospitalization: This is all care received as a hospital patient.\n4. Maternity and newborn care: Includes prenatal care, labor, and care for newborn babies.\n5. Mental health services and addiction treatment: Includes counseling and treatment.\n6. Prescription drugs: At least one drug in each treatment category must be covered.\n7. Rehabilitative services: This is care after an injury or disability.\n8. Laboratory services: These are tests to determine a diagnosis, including screenings and blood work.\nAdvertisement\n9. Preventive services: This includes physicals, immunizations, “well-woman visits,” and screenings.\n10. Pediatric services: Care provided to children including yearly visits, vaccines and immunizations.\nFor many consumers—particularly young adults or those who never tried to get insurance before the ACA—this seems like a no-brainer. “Of course health plans should cover hospital visits and prescriptions,” these consumers might think. “Why else would anyone buy them?”\nBut before the ACA, insurers were not required to cover all of these services, and many did not. In Colorado, for example, no individual health plans covered maternity coverage before the ACA. Consumers could add “maternity riders” to their plans, but they were only available to women under 34 with no history of pregnancy complications. Similar policies surrounded coverage for services like mental health or substance abuse treatment in the individual market.\nThe advantages of the EHB requirements are obvious. People have more coverage for more services. But it’s not a total win—there are consequences. Specifically, it has made insurance more expensive.\nAs you might expect, requiring insurers to cover a full suite of benefits raises their costs. On top of that, the ACA prohibits insurers from denying coverage to people with pre-existing conditions or capping their benefits, which further limits insurers’ ability to control costs. With sicker-than-expected individual enrollees, many carriers have said their costs are becoming unsustainable.\nAdvertisement\nThe results are higher premiums and out-of-pocket costs for consumers, which most enrollees really don’t like, especially if they don’t think they will benefit from the EHB services.\nSome of these consumers want to go back to pre-ACA plans. People who are generally healthy and don’t expect to use very many healthcare services often prefer to pay less for skinnier insurance plans.\nRolling back the ACA’s regulations so insurers can sell these plans is one of the goals of the Freedom Caucus. But they don’t have unified support for this, because so many consumers do need or want coverage for the essential health benefits.\nAnd now that these consumers have this coverage, they have become protective of it. One could argue that the U.S. will never go back to the days of cheaper and less comprehensive health insurance, because consumers’ attitudes have changed.\nConservatives continue to work on amending their repeal bill to adjust these regulations, and they may eventually find a way to sell consumers on their plan by focusing on the likely result of lower costs.\nAdvertisement",
    "label": 3
}