{
    "index": 389,
    "text": "On his 100th day in office, Trump orders review of free trade agreements\nShow Caption Hide Caption Trump talks tough on trade at Pa. rally President Donald Trump told a rally in Pennsylvania. that he plans to renegotiate NAFTA, but he'll withdraw if the U.S. doesn't get a good deal. He also said the administration will also investigate steel and aluminum dumping into the U.S. (April 30) AP\nWASHINGTON — President Trump signed two more executive orders on the 100th day of his presidency Saturday, directing a review of U.S. involvement in NAFTA and other free trade agreements and creating a permanent trade policy office at the White House.\nThe new signings raise the number of executive orders by President Trump to 32, a pace of executive action that exceeds any newly inaugurated president since Franklin Roosevelt, who signed at least 99 in his first 100 days.\nThe Office of Trade and Manufacturing Policy elevates Peter Navarro, Trump's principal trade adviser and a prominent critic of Chinese trade policy, to a permanent post enforcing Trump's \"Buy American\" policies.\nWhite House spokeswoman Natalie Strom said the creation of the trade policy office \"sends an important signal to the world that the United States will no longer tolerate trade cheating or allow our manufacturing and defense industrial base to wither and die.\"\nLike many of Trump's executive orders, the decree to review free trade agreements simply asks for a report back from a cabinet secretary. It gives the secretary of Commerce 180 days to conduct a comprehensive review of whether previous free trade agreements have brought the benefits that were predicted when they were signed.\n\"Whenever we've ventured into any of these agreements, the forecast has always been that it would be a job-creator. Well, to the degree that those forecasts are wrong, it would be very useful to figure out why were they wrong and what can be done to fix it,\" Secretary of Commerce Wilbur Ross told reporters Friday.\nThe order also comes three days after Trump announced he would not seek to withdraw from the North American Free Trade Agreement, but rather renegotiate its terms with Canada and Mexico. Yet Ross said that process could still result in the U.S. pulling out of the agreement. \"Withdrawal is the most extreme form of renegotiation,\" he said.\nTrump signed the orders at Ames tool company in Camp Hill, Pa., before a campaign rally in Harrisburg to mark his first 100 days in office.\nThe executive order is at least the sixth that Trump has signed directing the secretary of Commerce to produce a report — a fact not lost on Ross, who will have to deploy a significant amount of resources from his department to meet these demands.\n\"With so many reviews, we’re probably going to use a lot of the 47,000 people we have there,\" Ross said.",
    "label": 3
}