{
    "index": 97,
    "text": "— -- President Trump's order limiting travel from some Middle Eastern and African countries is intended to protect the U.S. against terrorists -- not ban Muslims, the Trump administration argued in a federal appeals court hearing Monday.\nThe two-hour hearing before the Fourth Circuit Court of Appeals in Virginia on Monday focused primarily on two questions: should the words of Trump, both as candidate and president, be considered in determining if the travel ban is intended to discriminate against Muslims?\nAnd, if Trump’s words are disregarded, is the travel ban on its face constitutional?\nThe court is considering the Trump administration's appeal of a ruling by a federal judge in Maryland on March 15 that put a nationwide preliminary injunction on one section of the president's revised travel ban that bars entry of nationals from six Muslim-majority countries for 90 days, with exceptions for U.S. permanent residents, valid visa holders and certain others.\nActing Solicitor General Jeffrey Wall argued that the order was intended only to pause travel to allow an examination of vetting procedures. He said the administration is not discriminating against any religion and has no intent to discriminate.\n“The president made clear what he was talking about is threat of terrorists,\" Wall told the court. \"He made clear he wasn’t talking about Muslims.\"\nWall added that Trump’s statements should be read “in a way that is not most hostile to the president.”\nThe American Civil Liberties Union's lawyer, Omar Jadwat, countered that the president has shown “animus” towards Muslims in his statements.\nHe pointed to a past statement on Trump's website that calls for a total and complete shutdown on Muslims entering the U.S., which has since been removed. Jadwat also argued that such a multi-country travel ban is unprecedented and that the revised order violates the Establishment Clause of the Constitution, which prohibits favoring one religion over another.\nThe hearing marked the first time that a legal challenge to the revised executive order has reached a court of appeals after being blocked by two federal judges in March.\nIn an extremely rare occurrence for the Fourth Circuit -- which covers Maryland, North Carolina, South Carolina, Virginia and West Virginia -- a panel of all 13 active and eligible judges heard the lawyers' arguments. Such an \"en banc\" hearing is granted only when a majority of active judges determine that the proceedings involve a question of exceptional importance or when uniformity of the court's decisions is needed.\nTypically, cases are first heard by a three-judge panel.\nThe judges did not issue a ruling today and a decision will likely come in the next few weeks.",
    "label": 3
}