{
    "index": 78,
    "text": "— -- Sally Yates, the former acting United States attorney general who drew the ire of President Donald Trump for issuing instructions to the Department of Justice not to defend his first travel ban executive order, testified that she informed the White House counsel that the Department of Justice believed that then–national security adviser Michael Flynn could be subject to blackmail by the Russian government.\nYates said that she had two in-person meetings with White House counsel Don McGahn to discuss concerns about Flynn.\nReferring to the DOJ, she said, \"We believed Gen. Flynn was compromised in regards to the Russians.\"\nYates said that not only was his conduct \"problematic in it of itself\" but also Vice President Mike Pence and the American people had been misled.\n\"To state the obvious, you don't want your national security adviser compromised with the Russians,\" she said.\nConcerns about Flynn\nThe FBI and Department of Justice knew about Flynn's conduct, and more important, \"the Russians also knew about what Gen. Flynn had done\" and that he had misled Pence, Yates said. That created a \"compromise situation,\" in which Flynn \"essentially could be blackmailed by the Russians.\"\nYates testified today before the Senate Judiciary Committee, alongside former Director of National Intelligence James Clapper, as part of its investigation into Russian interference in last year's presidential election.\nYates, an appointee of then-President Barack Obama, filled the top position at the Justice Department for less than two weeks in January before Trump's pick, Jeff Sessions, became attorney general.\nDuring that time, her office was probing the relationship between Russian officials and Flynn.\nAfter Flynn's forced resignation in February, it emerged that Yates privately brought concerns about him to the White House, informing the administration that he may have misled officials about conversations with Russian Ambassador to the U.S. Sergey Kislyak before Trump's inauguration.\nWhen McGahn asked her during their first meeting whether Flynn should be fired, she said that \"it was not our call,\" she testified.\n\"We were there to tell the White House about something we were very concerned about and emphasize to them repeatedly so that they could take action,\" she said.\nIn telling the White House, Yates said that she was balancing sharing the \"critical\" information with the needs of the FBI but that once Flynn was interviewed, there was no longer a concern about an impact on an investigation.\nSen. Diane Feinstein, D-Calif., asked Yates whether Flynn's conduct was serious enough that it compromised the security of the nation and the government.\n\"Our point was that logic would tell you that you don't want your national security adviser in a position where the Russians have leverage over him,\" Yates responded.\n\"We felt like the vice president was entitled to know that the information he was given and was relaying to the American public wasn't true,\" she said, adding that it appeared Flynn had lied to Pence.\nDuring this portion of the hearing, Clapper confirmed previous media reports that it was British intelligence that first notified the U.S. government about suspicious interactions between Trump associates and Russian operatives and that European intelligence later provided further intelligence about such contacts. Asked whether those reports are accurate, Clapper said, \"Yes it is, but it's also quite sensitive.\"\nHow we got here\nYates' testimony today comes after she notified the White House of her intent to appear before the House Intelligence Committee in March. That hearing was then postponed by Rep. Devin Nunes, R-Calif., the chairman of the committee, leading Yates' lawyer to question whether the White House took action to prevent her testimony — a suggestion the administration denied.\n\"I hope she testifies. I look forward to it,\" White House press secretary Sean Spicer said in March. \"We had no objection to her going forward ... To suggest in any way, shape or form that we stood in the way of that is 100 percent false.\"\nNunes' impartiality in the investigation was debated by his colleagues on both sides of the aisle after the delay and his trip to the White House to view classified information pertaining to Trump's allegations that he was wiretapped during the presidential campaign. Nunes later announced he would step away from the Russia investigation.\nAside from discussing the meetings about Flynn, there were many questions Yates declined to answer because the Russia investigation is ongoing and much of her story includes the top-secret surveillance activities of the U.S. intelligence community.\nYates and the Trump administration\nThe relationship between Yates and the White House is complicated by the circumstances surrounding her firing. In January she instructed the Justice Department not to defend Trump's controversial order limiting travel and immigration from seven majority-Muslim countries in the Middle East and Africa.\nShe took a moment to defend her actions at today's hearing, saying, \"I did my job.\"\n\"I understand that, you know, people of goodwill and who are good folks can make different decisions about this. I understand that. But all I can say is that I did my job the best way I knew how. I looked at this executive order. I looked at the law. I talked with the folks at the Department of Justice, gathered them all to get their views and their input, and I did my job.\"\nShe wrote at the time of her decision that she was not convinced that defense of the executive order was \"right\" or \"lawful.\"\nDuring today's hearing, Yates insisted that this situation was rare in that it dealt with not only executive authority but also religious freedom.\nShe expressed frustration that neither she nor other top DOJ officials were told anything in advance about the executive order — learning about it from media reports after meeting with the White House about Flynn.\nYates was fired on Jan. 30 just hours after instructing the department not to defend the order.\nShe was replaced as acting attorney general by Dana Boente, who vowed to defend the travel ban. Sessions was confirmed — amid questions about his own relationship with Kislyak — on Feb. 8 and sworn in the next day. Sessions said in March that he will recuse himself from any DOJ investigations concerning the 2016 presidential campaign.\nRussian interference\nAsked whether the U.S. government is doing enough to deter attacks by Russia, Yates said, \"I think they are coming back and we need to do more to ensure that folks out there know when they are looking at news feeds that it may not be real news that they are reading.\"\nShe added, \"I think that we have to do more to deter the Russians and it wouldn't hurt to prosecute a few folks, but I don't think we should kid ourselves that we'll be able to prosecute our way out\" of the problem.\nClapper said the most important thing that needs to be done is to \"educate the electorate\" about Russia's objectives and the tactics it employed in the 2016 election and will to continue to use.\nHe also said he believes more needs to be done in the way of sanctions against Russia or any other country that attempts to interfere in the U.S. election process.",
    "label": 2
}