{
    "index": 400,
    "text": "Eye doctor accused of bribing Sen. Menendez convicted in Florida Medicare fraud\nA Florida jury convicted eye doctor Salomon Melgen of Medicare fraud on Friday, increasing the pressure he may face to testify against Sen. Bob Menendez, D-N.J., in September when the two go on trial in New Jersey on corruption charges.\n“By having two separate trials, it raises the stakes for Dr. Melgen and gives the government enormous additional leverage,” said Robert Mintz, a former federal and state prosecutor who chairs the white collar criminal defense section at McCarter & English in Newark, N.J.\n“Rather than being able to roll the dice on the question of whether to go to trial or cooperate — assuming he has information the government would be interested in — he knows with certainty he’s going to jail and the only way to reduce his sentence would be to cooperate,” Mintz said.\nAn April 2015 indictment handed up by a Newark grand jury accused Melgen of providing contributions to political committees and luxury travel, including flights on his private jet and vacations at his home in a Dominican Republic resort, as bribes to get Menendez to take official actions to benefit Melgen financially. One charge accuses Menendez of pressuring Medicare officials about a regulation at the heart of a $9 million billing dispute Melgen had with the government.\nBoth Menendez and Melgen have pleaded not guilty to the charges in Newark.\nMenendez's attorney, Abbe Lowell, said Melgen's convictions related to \"day-to-day operations of his medical practice and the private care of his patients — specifics of which the senator could not be aware, nor has it ever been suggested otherwise.\"\n\"From the beginning, Senator Menendez has been clear that he has always acted in accordance with the law and his appropriate legislative oversight role as a member of Congress. When all the facts are heard, he is fully confident that a jury will agree and he will be vindicated,\" Lowell said.\nA separate indictment in Florida, also handed up in 2015, accused Melgen of bilking Medicare of up to $105 million. Among other things, Melgen repeatedly gave patients unnecessary treatments and billed the government for medication he never bought by extracting multiple doses from what were supposed to be single-use vials.\nMelgen's attorneys had he was a kind and caring physician who made billing and treatment mistakes. Prosecutors countered that anybody can make an occasional mistake, but Melgen's actions were too numerous to be honest. For example, the doctor frequently billed Medicare for tests and treatment of prosthetic eyes.\nFollowing his conviction on 67 counts, the 62-year-old Dominican born ophtlalmologist now faces a sentence of 15 to 20 years.\nWhile Melgen may not be sentenced in Florida before the Menendez trial begins in September in Newark, his attorneys would know based on federal guidelines exactly what kind of prison time he would be facing, Mintz said.\nRead more:\n“A conviction changes everything,” said Jennifer Rodgers, a former prosecutor who serves as executive director of the Center for the Advancement of Public Integrity at Columbia Law School. “He now has an incentive to try to wrap things up into one global plea agreement.”\nIf Melgen decides not to seek a deal, however, the conviction may not have much impact on Menendez and the upcoming trial.\nProsecutors in Newark likely will not be allowed to tell jurors about the conviction in Florida, Rodgers said.\n“They won’t be able to admit the conviction from the prior case,” she said. “It’s too prejudicial.”\nThat’s true even though part of the government’s case in the corruption trial focuses on Menendez’s efforts to pressure federal Medicare officials about what he said was a confusing regulation regarding multi-dosing medication.\nThe trial in Florida received little attention in New Jersey, so the public is not likely to turn on Menendez because of his association with Melgen, said Patrick Murray, head of the polling institute at Monmouth University.\n“The only ones paying attention are the political insiders,” Murray said. “And they have decided they’re going to take a wait-and-see attitude on Menendez.”\nMenendez is up for re-election next year, but there has been scant effort in Republican circles to start building support around a challenger, Murray said, in part because there is a contentious primary for governor under way.\nContributing: The Associated Press",
    "label": 3
}