{
    "index": 471,
    "text": "Trump issues broad, 'Bush-style' signing statement on spending bill\nShow Caption Hide Caption Congress passes $1.1 trillion spending bill The House easily passed a $1.1 trillion governmentwide spending bill on Wednesday, awarding wins to both Democrats and Republicans while putting off until later this year fights over President Donald Trump's promised border wall with Mexico and massive military buildup. (May 3) AP\nWASHINGTON — President Trump signed a $1.1 trillion spending bill on Friday, and used the opportunity to attach a signing statement that asserted presidential prerogatives on issues of war powers, marijuana and government spending.\nThe signing statement was Trump's first as president, and could signal that he intends to use the tool to vigorously defend what he sees as the president's constitutional authority. Through the statement, Trump reserved the right to disregard 89 different provisions in the spending bill.\n\"This is a George W. Bush-style signing statement,\" said Christopher Kelley, a Miami University political scientist whose work on Bush's signing statements brought attention to a formerly obscure presidential tool. \"It's a line-by line series of objections that lead to dozens and dozens of challenges that you just did not see in the Obama administration.\"\nA signing statement is a written pronouncement issued by a president as he signs a bill into law. They can be used to explain the president's positions, prod Congress to pass more legislation, or to put the president on record raising constitutional issues with a bill. But during the Bush administration, critics said the practice allowed the president to rewrite laws he disagreed with after he had signed them — rather than vetoing bills and sending them back to Congress.\nAmong the provisions that Trump said he was reserving the right to disregard:\n► Marijuana: The spending law forbids the Justice Department from spending any money to prevent 44 states from implementing their own laws on medical marijuana. Yet Trump said that law conflicts with his constitutional responsibility to \"take care that the laws be faithfully executed,\" leaving open the possibility that his administration could challenge state and local medical marijuana laws.\n► Weapons systems: Several provisions forbid the administration from canceling weapons programs, such as the RQ-4B Global Hawk or A-10 aircraft. Another forbids the president from funding nuclear-armed interceptors — a form of missile defense that uses nuclear weapons to shoot down other nuclear weapons. Trump said those provisions \"unconstitutionally limit my ability to modify the command and control of military personnel and materiel.\"\n► White House \"czars:\" Congress had blocked the president from hiring certain Obama-era White House \"czars,\" including key policy advisers on health care, climate change, the auto industry and urban affairs. Trump said he has \"well-established authority to supervise and oversee the executive branch and to obtain advice in furtherance of this supervisory authority.\"\n► Affirmative action: Congress has established programs giving preferences based on race and sex in hiring, grants and government contracts. Trump said he would interpret those provisions \"consistent with the requirement to afford equal protection of the laws\" under the Constitution.\n► Guantanamo Bay: Trump even raised issues with provisions trying to restrict the president's ability to release suspected terrorists from the military prison at Guantanamo Bay, Cuba — although his objection is different from that of President Barack Obama. Trump said the law \"does not include an exception for when a court might order the release of a detainee to certain countries,\" and therefore said he was reserving the right to disregard it.\nJennifer Hing, a spokeswoman for the House Appropriations Committee, said the committee was still reviewing the president's signing statement to determine how to respond.\nThe spending bill keeps the government open through Sept. 30, avoiding a government shutdown through a series of compromises on contentious issues like a border wall, immigration enforcement and funding for Planned Parenthood.",
    "label": 3
}