{
    "index": 169,
    "text": "Amid the fallout from FBI Director James Comey's dismissal, White House Press Secretary Spicer fielded reporters' mounting questions on Friday about disparate accounts emerging from the White House concerning Comey's firing.\nIn doing so, he made some assertions from the podium that bear a second look -- about the nature of the statements made by the White House about Comey's firing; about Mr. Trump's tweets and former DNI James Clapper's past statements on collusion; and on whether the president asked for loyalty from Comey.\nDid White House give reporters conflicting information about the firing of James Comey?\nSpicer refused to acknowledge that the White House has given the public conflicting information about the firing of Comey.\nAsked by Time Magazine's Zeke Miller, \"Why were the American people given incorrect information [the night Comey was fired],\" Spicer responded, \"I don't necessarily believe that that's true, Zeke. There was a decision-making process; the President explained it in the interview process.\"\nBut over the last few days, the White House has offered several explanations for Comey's firing. On Tuesday, the White House said that President Trump was acting on the recommendation of Deputy Attorney General Rod Rosenstein, who faulted Comey for his handling of the investigation into Hillary Clinton's private email server.\nMr. Trump also said in his termination letter to Comey that he had \"accepted\" the recommendation of Rosenstein and Attorney General Jeff Sessions to fire Comey. It's worth noting that Rosenstein's letter never directly called for Comey's dismissal, although Sessions did when he forwarded Rosenstein's letter to Mr. Trump.\nIn a meeting with reporters Tuesday night, Spicer put the burden of the firing squarely on Rosenstein. \"It was all him [Rosenstein],\" Spicer said. \"That's correct -- I mean, I can't, I guess I shouldn't say that, thank you for the help on that one. No one from the White House. That was a DOJ decision.\"\nBut two days later, the president himself refuted this version of events. On Thursday night, Mr. Trump told NBC News' Lester Holt that he \"was going to fire\" Comey \"regardless of recommendation.\"\n\"[Rosenstein] made a recommendation, but regardless of recommendation, I was going to fire Comey,\" Mr. Trump said.\nDuring his press briefing on Friday, Spicer insisted that Mr. Trump's comments did not contradict what Spicer said Tuesday night. He also said that Rosenstein's memo did, in fact, affect the president's decision to fire Comey.\n\"This is ultimately going to be the president's, always going to be the president's decision,\" Spicer said. \"Everyone who serves at the pleasure of the president – it's always going to be his decision to hire someone, fire someone, he made a decision in part based on the recommendation, and he's now focused on making sure that we have a replacement at the FBI to ensure they have the proper leadership they need.\"\nThe press has been told at various times that Comey's firing was based on his handling of the investigation into Clinton's server, that it was \"all\" on Rosenstein's recommendation, and that it had nothing to do with Russia. And they've also been told that Mr. Trump had made his decision before Rosenstein's memo. And Mr. Trump said he thought of \"made-up\" Russia ties when he decided to fire Comey.\nWhile Spicer doesn't necessarily believe it's true Americans were given incorrect information about the night Comey was fired, the things the president himself has said about Comey's firing refute that.\nClapper's statement on Russian collusion\nIn a Friday morning tweet, Mr. Trump said that former Director of National Intelligence James Clapper said that there had been \"no collusion\" between Russia and the president's campaign.\nBut Clapper's remarks were not that clear-cut. He had said that he wasn't aware of the FBI's counterintelligence investigation into Russian interference in the 2016 election, and that he had not seen any evidence yet of collusion between the Trump campaign and Russia.\nFollowing Mr. Trump's tweet on Friday, Clapper further clarified the point. \"I don't know if there was collusion or not. I don't know if there was evidence of collusion or not -- nor should I have,\" Clapper said in an interview with MSNBC's Andrea Mitchell, explaining that he deferred to the FBI director to keep him apprised of investigations.\nDuring White House press conference later that day, Spicer said that Clapper had said before that there was no evidence of collusion, and that he should be asked, \"Why did he say what he said before?\"\nIn a March interview with NBC News' Chuck Todd on \"Meet the Press,\" Clapper was questioned closely about collusion and Trump campaign affiliates:\nCHUCK TODD: Let me ask you this, does intelligence exist that can definitively answer the following question, whether there were improper contacts between the Trump campaign and Russia officials? CLAPPER: We did not include evidence in our report, and I say our, that's NSA, FBI and CIA with my office, the director of national intelligence that had anything — that had any reflection of collusion between members of the Trump campaign and the Russians. There was there no evidence of that including in our report. TODD: I understand that, but does it exist? CLAPPER: Not to my knowledge. TODD: If it existed, it would have been in the report? CLAPPER: This could have unfolded or become available in the time since I left the government. But at the time, we had no evidence of such collusion.\nSo it's true that in early March, Clapper told Todd repeatedly that there was no evidence of collusion. But about two weeks later, Comey revealed the existence of the investigation into Trump campaign associates and Russia, a fact that Clapper has said he didn't know about at the time.\nThe FBI's investigation was said to be increasing in intensity by the time of Comey's firing, to the point that Comey had asked for more resources for the Russia probe. Clapper has not been the DNI for several months, since Mr. Trump was inaugurated. So any knowledge that Clapper would have about Russian collusion could reasonably be seen as out of date. Spicer's statements are partly true.\nDid Trump asked for loyalty from Comey?\nSpicer had a simple answer for whether Mr. Trump asked for Comey's loyalty when the two met in January for dinner: \"No.\"\n\"The president wants loyalty to this country and rule of law,\" was all Spicer would add to that topic.\nBut a law enforcement source has told CBS News, and other outlets have reported, that the president did indeed ask for Comey to pledge his loyalty. During their January dinner, the president told Comey he needed his loyalty, and Comey responded that he would be honest, according to CBS News' source. Mr. Trump claims Comey asked for the dinner, although CBS News reported the White House invited Comey.\nSpicer did make one remark about loyalty when a reporter asked if Spicer had been asked for a loyalty pledge when he took his press secretary role.\n\"I've pledged my loyalty to the Constitution and to the American people, as has everyone who serves in our government and this administration, and we stand by that,\" Spicer said.\nMr. Trump, in an interview with Fox News' Judge Jeanine Pirro, said, \"I didn't ask that question.\"\nSo who's telling the truth here? Let's go to the \"tapes\" -- the ones the president referred to in a tweet Friday. We'll only ever know the truth for sure if it turns out that there is a recording of the conversations between Mr. Trump and Comey, and that recording is released.",
    "label": 3
}