{
    "index": 343,
    "text": "For his first trip abroad as president, Donald Trump later this month will venture into some highly sensitive geopolitical regions, taking on an itinerary that might test even the most adroitly diplomatic of leaders.\nHe will start in the stridently conservative Sunni Islamic kingdom of Saudi Arabia, where the most revered sites in Islam are located. From there, he heads straight to Israel, still diplomatically ostracized by much of the Arab world. In Israel and in the Palestinian territories, he will have to deftly balance the conflicting interests of both sides as he seeks to revive peace negotiations.\nWhen treading such turf, protocol matters greatly, and an errant word — or tweet — can have major repercussions. For a leader like Trump, often given to impulsive, off-the-cuff statements, that could be a challenge.\nNext comes a stop at the Vatican to meet Pope Francis, whom Trump last year called “disgraceful” for challenging the then-candidate’s pledge to build a wall along the U.S. border with Mexico. Finally, Trump attends a top-level gathering of NATO, which he once deemed obsolete before reversing himself, and meets with leaders of the European Union, whose potential disintegration he has applauded.\nSince foreign travel by a sitting U.S. president became routine, most went abroad quickly after taking office — even if only as far as Mexico or Canada. The last president not to leave the United States in his first 100 days was Jimmy Carter, who waited until May to visit Britain for an economic summit. President Obama had traveled to nine nations by the time his first four months had elapsed.\nAdvertisement\nInitially it appeared Trump’s first trip would be brief, to Belgium and Italy for back-to-back meetings of NATO and G-7 leaders, respectively.\nBut behind the scenes, some of the president’s top aides — including son-in-law and senior advisor Jared Kushner — were planning a more robust itinerary intended to send a message about the kind of leadership Trump would show on the world stage. And the president took the rare step of announcing his travel plans publicly himself, in the Rose Garden on Thursday at an event with religious leaders.\n“America can be first but still be a global leader,” White House spokeswoman Sarah Huckabee Sanders said in a later briefing with reporters. “America has to be a global leader.”\nThree administration officials, who briefed reporters on condition of anonymity to discuss travel aims, said the overarching goal of the trip was to demonstrate an America “regaining strategic confidence” in the world.\n“American leadership has a lot to do with the ability to combine diplomacy with economic strength, the ability to communicate effectively, and to build relationships with leaders and with peoples,” one of the officials said. “It also has a lot to do with the willingness to use military force when it’s necessary.”\nIn some respects, the Saudi and Israeli stopovers may be quite comfortable territory for Trump. For one, both are states with extremely high levels of security and can easily keep any protests at bay.\nIn all likelihood, nowhere outside the United States will Trump be better received than in Israel, given his support for the conservative government of Prime Minister Benjamin Netanyahu.\nNetanyahu, who visibly disdained Trump’s predecessor Barack Obama, can be expected to welcome the new president like a long-lost relative. One of Netanyahu’s chief financial backers and a big investor in Israel, American business tycoon Sheldon Adelson, is also a major supporter of Trump. .\nA high-profile first stop in Saudi Arabia, a theocracy whose record on human rights and treatment of women often comes under sharp international criticism, was an unusual choice for a U.S. leader. But there, too, officials felt estranged from Obama and eager to host a new American president.\nDiscussions with the oil-rich kingdom’s leadership began shortly after the election, initiated by the Saudis with a goal of starting “a new relationship with America,” a senior administration official said. Those talks ultimately led to plans for a summit between the president and Muslim leaders focused on how to defeat Islamic State and confront the larger threat of radicalization.\nTrump could face a backlash, however, from conservative supporters who note that Saudi Arabia is actually a wellspring of the brand of radical Islamic ideology embraced by some terrorist organizations, and the homeland of most of the perpetrators of the Sept. 11 terror attacks.\nTrump “recognizes the importance of bringing all of our partners together, and certainly looking for ways that we can combat some of the greatest threats to all of the world,” Sanders said. “And that’s going to take some buy-in, and some of the people in the Middle East taking a larger stake in that process.”\nThe most awkward stop is likely to be the Vatican. Trump met Thursday with a delegation of Roman Catholic cardinals and other church leaders, and may have been briefed on papal protocol.\nFrancis has implicitly criticized Trump’s hostile views toward Mexicans and immigrants, and especially his pledge to build a massive wall separating the United States and Mexico. “A person who only thinks about building walls, wherever they may be, and not building bridges, is not Christian,” the pontiff said in February 2016 — a view he repeated after the president’s inauguration.\nThen-candidate Trump shot back in terms a politician has rarely used about a pope.\n“For a religious leader to question a person’s faith is disgraceful,” Trump said, calling himself a “good Christian.”\nBut even beyond that exchange, the pontiff and the president could not be more different. Francis, a Jesuit from Argentina, has made concern for the environment and charity toward the poor the cornerstones of his papacy.\nPopes, by tradition, meet with any world leader who requests it, no matter how diametrically opposed their philosophies and temperaments might be.\nOverall, though, the multi-country trip should go fairly well for Trump because at the end of the day, other nations want to have good relations with the U.S., said Ian Bremmer, a political scientist and president of the analytical Eurasia Group in Washington. Because world leaders generally need Washington more than a U.S. president needs them, “that asymmetry makes it easier,” he said.\nTrump has said he does not like to travel, and since becoming president, his only overnight trips away from the White House have been to his own U.S. properties.\nDuring the campaign, he went once to Scotland, to inaugurate one of his golf clubs, and then made what by most accounts was a highly tense trip to Mexico.\nThere, he met with Mexican President Enrique Peña Nieto and agreed, according to sources, not to publicly insist that Mexico would pay for the wall — then tweeted as he flew out of Mexico City that Mexico really would pay for the wall. In addition, he took charge of a short news conference at the Mexican equivalent of the White House, leaving a stunned and helpless Peña Nieto at his side as he called only on U.S. reporters.\nPeña Nieto’s approval rating plummeted in the wake of the trip, and relations between the two allied nations were set on a still-bumpy course..\nStaff writer Noah Bierman contributed to this story from Washington.\ntracy.wilkinson@latimes.com\nFor more on international affairs, follow @TracyKWilkinson on Twitter\nmichael.memoli@latimes.com\nTwitter: mikememoli",
    "label": 3
}