{
    "index": 489,
    "text": "Meet the new U.S. senators\nA raucous election cycle ended with very little change in the U.S. Senate, as most of the endangered Republicans managed to hold on to their seats. Here are the seven newly elected senators who make up the 2017 freshman class.\nDemocrat Catherine Cortez Masto’s victory in the Nevada Senate race is groundbreaking for the Silver State.\nShe is the first woman to represent Nevada in the Senate and the first Latino woman in the chamber's history. Her paternal grandfather immigrated to Nevada from Chihuahua, Mexico.\nThe former two-term attorney general replaces retiring Senate Democratic leader Harry Reid. Losing the seat would have been a devastating blow for Democrats, though even with this win they did not take control of the Senate.\nCortez Masto, 52, ran an aggressive campaign based on foundational Democratic policy proposals — raising the minimum wage, protecting Social Security and Medicare, and passing comprehensive immigration reform.\nShe was the candidate whom Reid hand-picked to replace him after serving in the Senate for nearly 30 years. Reid helped to remake the face of Nevada by using his power to direct federal funding to the state.\nCortez Masto defeated Republican Rep. Joe Heck, a physician who reached the rank of brigadier general in the U.S. Army Reserve.\nOutside groups poured more than $90 million into the race, and top officials from both parties were frequent visitors.\nCortez Masto will be expected to be a solid Democratic vote in the Senate and be supportive of party leadership.\n— Bill Theobald\nDemocrat Tammy Duckworth easily defeated incumbent Republican Sen. Mark Kirk in one of the least surprising Senate victories this year.\nShe had led by double digits in recent polls, and a majority of Illinois voters in one recent survey said they thought Kirk hadn’t recovered enough from a stroke he suffered in 2012 to perform his Senate duties.\nDuckworth is a two-term congresswoman and veteran who lost both legs when the helicopter she was riding in was shot down in Iraq in 2004.\nAfter a yearlong recovery at Walter Reed National Military Medical Center, she went on to serve stints as director of the Illinois Department of Veterans’ Affairs and as an assistant secretary at the U.S. Department of Veterans’ Affairs. On Capitol Hill, Duckworth has made veterans issues a priority, and she helped pass legislation to provide resources to prevent veteran suicide, among other initiatives.\nDuring the Senate campaign, she said she would back working with Russia to establish a no-fly zone in Syria and putting more pressure on NATO allies, including Turkey, to help oust the Syrian regime. Duckworth also said public-private partnerships should be leveraged to provide tuition-free community college vocational training, which would be a first step toward free community college for all. She also backs increased investment in infrastructure.\n— Donovan Slack\nCalifornia’s next senator was the front-runner from the day in January 2015 she announced her candidacy, saying she would be “a fighter for the next generation.” In a sense, at age 52, Kamala Harris is getting the first opportunity of anyone in her own generation to win a Senate seat in California.\nBarbara Boxer, 75, who announced last year she wouldn’t be seeking a fifth term, was first elected to the Senate in 1992 replacing the late Alan Cranston, who was resigning after four terms. Dianne Feinstein, 83, was elected the same year to finish out the term of Pete Wilson, who had been elected governor, and has remained in the Senate ever since.\nHarris, a career prosecuting attorney before being elected and re-elected as the state’s attorney general, will be the first African American and Indian American to represent the Golden State in the Senate. She defeated 10-term Rep. Loretta Sanchez in the Democrat-vs-Democrat general election. Her path to the seat was not as steep as once predicted, as former and current Los Angeles mayors Antonio Villaraigosa and Eric Garcetti, Lt. Gov. Gavin Newsom and billionaire environmentalist Tom Steyer decided not to run.\nAs attorney general she is perhaps best known for negotiating the settlement with bankers over illegal mortgage practices that brought billions to underwater California homeowners. She is also known as an expert on tackling recidivism — she wrote a book, Smart on Crime, about it — and making parents responsible for truant children. As district attorney of San Francisco city and county, she was known for antagonizing local police when she declined to seek the death penalty for a cop killer in 2004, her first year in office.\nHarris is also known to have a good relationship with departing President Obama, who once described her as “by far the best-looking attorney general in the country.”\nUnlike the outspoken Boxer she’s replacing, Harris has been called cautious. Asked at the only general election debate last month what committee assignments she’ll seek, for example, she said she was concentrating on the election and wouldn’t look beyond it.\n—Bartholomew Sullivan\nDemocrat Maggie Hassan eked out a win to unseat incumbent Republican Kelly Ayotte in one of the tightest races in the country.\nHassan, 58, has been governor of New Hampshire since 2013, and before that, she was a state senator for six years, including a stint as majority leader before losing re-election in 2010.\nDuring her tenure as governor, Hassan maintained high job approval ratings, with a Morning Consult poll earlier this year gauging her support 56% favorable and only 33% unfavorable.\nShe campaigned for Senate on a pledge to work across the aisle to make Washington work better for middle-class Americans and touted her prior record in New Hampshire, where she froze tuition at state universities and lowered it at community colleges and passed two budgets without raising sales or income taxes.\nA lawyer by trade, Hassan started in public service as an advocate for special-needs children after the eldest of her two children, Ben, now 28, was born with cerebral palsy. Her campaign said she was driven to “ensure that children like her son Ben, who experiences severe disabilities, would be fully included in their communities and have the same opportunities that all parents want for their children.”\n— Donovan Slack\nLouisiana Republican John Kennedy pulled off a win on Dec. 10 in the last Senate race of 2016.\nKennedy, the state treasurer, defeated Public Service Commissioner Foster Campbell in a runoff to become the latest soon-to-be-member of the Senate.\nKennedy, a former Democrat, had unsuccessfully run twice for the Senate seat. He beat Campbell 63% to 37%.\nThe race had garnered national attention with its unprecedented field of 24 candidates, including former Ku Klu Klan leader David Duke. It also attracted attention when Republican powerhouses came in to help Kennedy in the final weeks of the campaign.\nPresident-elect Donald Trump, Vice President-elect Mike Pence and Mississippi Sen. Roger Wicker, chairman of the National Republican Senatorial Committee, traveled to the Pelican State to stump for Kennedy the week before the runoff. Kennedy had supported Trump, who easily won the state.\nCampbell, meanwhile, didn’t get much help from national Democrats. Louisiana Gov. John Bel Edwards, who is popular in the state, endorsed Campbell early in the campaign, but it wasn’t enough.\nCampbell had hoped to take advantage of Edwards’ upset in 2015 when he defeated Republican Sen. David Vitter in the red state.\nKennedy ran unsuccessfully for Senate in 2004 (as a Democrat) and in 2008 (as a Republican), but he entered the race as a favorite because of his statewide name recognition. Kennedy had won five statewide races and had years of political experience, including a stint as special counsel to former Republican governor Buddy Roemer.\nDuring the campaign Kennedy, a fiscal conservative, took aim at the Affordable Care Act, President Obama’s signature issue. Obama is unpopular in the state.\n“I want my country back. I’m scared we are losing it,” Kennedy said when he announced his bid to run. “I worry that America is losing those (conservative) values.”\nKennedy was the front-runner leading up to the runoff. He had nabbed 25% of the vote in the Nov. 8 election, while Foster came in second with 17%. In Louisiana, the top two candidates go to a runoff if the winner of the general election does not reach 50% of the vote.\n— Deborah Barfield Berry and Greg Hilburn.\nSooner or later, Chris Van Hollen was going to be a U.S. senator.\nThe six-term congressman from Maryland literally grew up in government. Van Hollen was born in Pakistan, where his father was serving in the foreign service, and lived in several foreign outposts as a child. His father ultimately served as U.S. ambassador to Sri Lanka and the Maldives. Van Hollen did his graduate studies at Harvard's Kennedy School of Government, where he met his wife, Katherine, and they both wound up with jobs on Capitol Hill.\nVan Hollen's first gig was working for Maryland's legendary Sen. Charles \"Mac\" Mathias, a famously moderate Republican.\nFirst elected to Congress on his own in 2002, Van Hollen quickly moved up the ladder of leadership among House Democrats. He led the Democrats' House campaign operation for the 2008 and 2010 election cycles, getting a good reputation among his colleagues for being a prodigious fundraiser. The 2006 Almanac of American Politics said Van Hollen, then still in his second House term, is \"among the many Democrats in the Maryland delegation interested in running for a Senate seat when one comes open.\" He took a pass on the 2006 race won by Democrat Ben Cardin, but the retirement this year of 30-year veteran Sen. Barbara Mikulski was likely to be his last shot for a long while.\nThe major hurdle to his promotion this year was a tough primary battle against Rep. Donna Edwards, a more liberal African-American lawmaker who argued that Van Hollen would be too cozy with Wall Street. The race seemed close at first, but Van Hollen ultimately won by a better than 10% margin.\nIn the general election he had little trouble dispatching his Republican opponent, delegate Kathy Szeliga, in a state where registered Democrats outnumber registered Republicans by a 2-to-1 margin.\n— Paul Singer\nRepublican Todd Young, a former Marine who mentioned that fact in nearly every campaign conversation, won Indiana’s open Senate seat by defeating one of the most formidable Indiana politicians: Evan Bayh.\nIt was not the race Young had expected.\nAfter his decisive May primary win over a Tea Party-backed opponent, Young was set to face former congressman Baron Hill, the Democrat he defeated in a 2010 House race.\nBut Hill withdrew from the race in July, clearing the way for Bayh — a former U.S. senator with more than $9 million in leftover campaign funds — to go after the seat being vacated by retiring Republican Sen. Dan Coats.\nRepublican leadership and outside groups – including the U.S. Chamber of Commerce – came to Young’s aid as they had in the primary.\nThe election became a referendum on Bayh. Young and his allies accused Bayh of leaving Indiana behind and cashing in when, instead of seeking re-election in 2010 after voting for the Affordable Care Act, Bayh went to work for a Washington law and lobbying firm and for a private equity fund.\nThe attacks steadily eroded the good feelings Hoosiers had of Bayh from his two terms as senator and governor, even as Young remained unknown to many voters.\nIn the House, Young had been among the minority of Republicans who joined Democrats in voting for a deal to end the 2013 partial government shutdown.\nHis willingness to cast tough votes helped him win a seat on the influential Ways and Means Committee, where he threw himself into overhauling the tax code and exploring a new way of funding social services programs.\nYoung said he hopes in the Senate to be known as one of the “go-to experts” on helping the poor and vulnerable.\nYoung’s political experience before running for Congress included stints with the conservative Heritage Foundation and working on energy policy for then-senator Richard Lugar.\nWhile Young, 44, did not grow up in a politically active home, his wife is the niece of former vice president Dan Quayle — who ended Bayh’s father’s Senate career in 1980.\nYoung has slept in his Capitol Hill office in recent years while keeping his home in Bloomington with his wife, Jenny, and their four children.\n— Maureen Groppe",
    "label": 3
}