{
    "index": 188,
    "text": "This story has been updated to reflect changes to the bill as of May 3.\nHouse GOP lawmakers have finally passed a bill aimed at repealing Obamacare ... or major portions of it.\nLeaders from the conservative and moderate wings of the Republican Party made several changes in recent weeks to drum up more support for the legislation, which was shelved in late March after failing to get enough votes to pass. The bill now moves to the Senate, which will likely make substantial revisions.\nThe original bill, called the American Health Care Act, had a lot of critics -- ranging from conservative lawmakers to moderate ones to insurers to the AARP.\nConservatives complained that the bill does not fully repeal Obamacare and that many provisions are too similar to the health reform law. Insurers worried that Republicans would cut federal support for Medicaid and tax credits, leaving many of their customers without coverage.\nAnd the AARP feared that Americans in their 50s and early 60s would see their premiums skyrocket and federal assistance reduced, though lawmakers are now promising to provide this group extra assistance.\nProponents of the bill said it would save the individual health market from collapse. The legislation would create a patient-centered health care system that provides Americans more choice, greater control and lower costs, they argued.\nBut opponents said it could reverse the gains in coverage that have been made since the Affordable Care Act was enacted in 2010. The Congressional Budget Office found that 24 million fewer people would be insured by 2026 under the GOP bill. The CBO estimates do not include the most recent amendment to the bill, however.\nWhat the bill calls for\nRepeal the Obamacare subsidies. The GOP's plan would eliminate the Obamacare subsidies, which are refundable tax credits based on a person's income and cost of coverage in their area. More than eight in 10 enrollees on the Obamacare exchanges receive this assistance, but individuals making more than $47,500 and families of four earning more than $97,200 do not qualify. This provision would take effect in 2020.\nProvide refundable tax credits based on age and income instead. The Republicans want to issue refundable tax credits to help people afford coverage on the individual market, but these credits will be based mainly on a person's age.\nThe credits will range from $2,000 for 20-somethings to $4,000 for those in their early 60s. The credits will also have an income cap. Those making more than $75,000 would see their tax credits start to phase out, and an enrollee making more than $215,000 would no longer be eligible. Families with incomes above $150,000 would see their credits dwindle, while those earning more than $290,000 would no longer qualify. This provision would take effect in 2020.\nPush provision for bigger tax credits for older Americans to Senate. The House is setting aside roughly $85 billion in funding to provide additional tax credits to help older people buy policies on the individual market. But representatives are letting the Senate handle the crafting of the legislation.\nMany older consumers would face huge premium hikes under the GOP bill because its tax credits are not as generous as Obamacare's subsidies for lower-income enrollees in their 50s and early 60s.\nRepeal the individual and employer mandates. The GOP's bill would get rid of the Obamacare requirement that people must have health coverage or face a tax penalty. It would also eliminate the requirement that employers with at least 50 employees provide health insurance to their workers.\nUnder Obamacare, these companies were required to provide affordable insurance to staffers who work more than 30 hours a week. They would face a penalty if they did not meet this criteria and their employee sought subsidies on the exchanges. These provisions take effect retroactively to 2016.\nRelated: CBO report: 24 million fewer insured by 2026 under GOP health care bill\nPut in place a continuous coverage requirement instead. The original Republican plan seeks to allow insurers to impose a 30% surcharge on the premiums of those who let their coverage lapse for at least 63 days. The plan would enable insurers to levy this surcharge for one year, but it would only apply to policies bought in the individual or small group markets.\nUnder the latest amendment, states that seek waivers could replace this provision with one that allows insurers to charge consumers who've had a gap in coverage based on their health status.\nAllow states to obtain waivers to let insurers charge consumers more if they have pre-existing conditions. States could get waivers that would allow carriers to set premiums based on enrollees' medical backgrounds under several circumstances. Those enrollees would have to have let their coverage lapse, and the state would have to set up a risk program -- such as a high-risk pool -- that, in some cases, could provide help to those being charged higher premiums.\nAllow states to seek waivers of the federal requirement that insurers cover 10 essential health benefits. States could seek waivers that would allow insurers to sell plans that don't include all the services mandated by the Affordable Care Act.\nUnder Obamacare, carriers must provide outpatient care, emergency services, hospitalization, maternity, mental health and substance abuse, prescription drugs, rehabilitation services, lab work, preventative care and pediatric services.\nThis could lower premiums somewhat and give consumers a wider choice of plans. But it would also make it harder for people to buy comprehensive coverage and weaken the protections for those with pre-existing conditions.\nCreate the patient and state stability fund. Lawmakers initially set aside $100 billion through 2026 for states to lower consumers' and insurers' costs in a number of ways. Among them: offering financial assistance to high-risk patients, reducing the cost of providing coverage in the individual market, promoting access to preventative services as well as dental, vision, maternity, mental health and substance abuse services, and helping people reduce their out-of-pocket costs.\nRelated: High-risk pools won't match Obamacare's protections for pre-existing conditions\nThe GOP added $15 billion to the fund for 2020 for states to cover maternity, mental health and substance abuse services, and then another $15 billion to create so-called invisible risk pools to help insurers handle high-cost policyholders.\nAt the last minute, lawmakers added another $8 billion over five years to support high-risk pools in states that seek waivers to opt out of two key Obamacare insurance provisions.\nRepeal cost-sharing subsidies to lower deductibles and co-pays. The bill would kill the additional help that individuals earning less than roughly $30,000 a year receive to cover their out-of-pocket costs. More than half of the enrollees on the Obamacare exchanges receive these subsidies. This provision would take effect in 2020.\nRelated: Insurers worry low-income Americans won't have coverage\nDelay the Cadillac tax. The Republican plan keeps but delays the controversial Cadillac tax, which calls for imposing a 40% excise tax on generous employer health insurance plans. Originally scheduled to go into effect in 2018, the law would have taxed employers on any premiums that exceed $10,200 for individual policies and $27,500 for family plans. After intense lobbying by companies and unions, lawmakers pushed back the start date to 2020. The Republican plan delays it until 2026.\nLoosen the age-band so insurers can charge older folks more. Under Obamacare, insurers could only charge older enrollees three times more than younger policy holders. The GOP bill would widen that band to five-to-one, which would hike premiums for those in their 50s and early 60s, but reduce them for younger folks.\nStates would also be allowed to seek waivers to allow insurers to charge older consumers even more than five times younger ones.\nRevamp Medicaid funding. The GOP bill would send the states a fixed amount of money per Medicaid enrollee, known as a per-capita cap.\nStates could also opt to receive federal Medicaid funding as a block grant for the adults and children in their program. Under a block grant, states would get a fixed amount of federal funding each year, regardless of how many participants are in the program.\nStates, however, cannot opt to receive block grant funding for elderly and disabled participants. Their federal support for those groups would still be based on enrollment.\nEither option would limit federal responsibility, shifting that burden to the states. However, since states don't have the money to make up the difference, they would likely either reduce eligibility, curtail benefits or cut provider payments. The block grant would be more restrictive since the funding level would not adjust for increases in enrollment, which often happens in bad economic times.\nEnd enhanced federal funding for Medicaid expansion. It would also end the enhanced match rate for Medicaid expansion for new enrollees starting in 2020. Those already in the program could stay as long as they remain continuously insured. States that have not already expanded would not be allowed to do so, starting immediately.\nAllow states to institute work requirement for Medicaid. States would now have the option of requiring able-bodied Medicaid recipients to work, participate in job training programs or do community service. Pregnant women, children under the age of 19, single parents of children under age six and single parents of children with disabilities are exempt.\nRelated: Upstate New York gets $2.3 billion gift in Republican health care bill\nGive most New York counties relief from Medicaid payments. Lawmakers added a provision that would ban the federal government from reimbursing New York State for Medicaid funds raised by counties outside of New York City. The upstate counties and Long Island send $2.3 billion to the state to help pay for Medicaid. The amendment would give the state the incentive to stop passing down Medicaid costs to the counties, though state officials say it would mean fewer people would be covered and benefits would have to be curtailed.\nRelated: Governors divided over Medicaid's future\nRestore federal support for hospitals who cover many uninsured patients. The legislation would restore Medicaid Disproportionate Share Hospital payments in 2018 for states that didn't expand Medicaid and in 2020 for states that did. Under Obamacare, these funds were set to disappear by 2020 since the original law called for all states to expand Medicaid.\nCreate more generous Health Savings Accounts. Seeking to get more people to save money for health care expenses, the Republican bill includes several provisions aimed at making Health Savings Accounts more attractive. It raises the annual contribution limits to equal the maximum sum of the deductible and out-of-pocket expenses one would pay in a high-deductible insurance plan. So the limit would be at least $6,550 for an individual and $13,100 for a family in 2018.\nThe bill would also end the Obamacare prohibition on paying for over-the-counter medications with funds from tax-advantaged accounts, such as HSAs and flexible spending accounts. And it reduces the penalty from 20% to 10% if funds from an HSA are used for non-medical purposes. These provisions begin in 2018.\nBan excess tax credits from going into Health Savings Accounts. Enrollees whose tax credits exceed the cost of their premiums would not be able to put the additional funds in Health Savings Accounts. Some conservatives are concerned these funds could be used to pay for abortions.\nRelated: Companies offering HSAs could bank on big profits under GOP plan\nLift contribution caps on flexible spending accounts. Obamacare put a cap on annual contributions to flexible spending accounts based on cost of living figures. For 2017, that cap was $2,600. The GOP bill would do away with that limit as of December 31, 2017.\nOffer two tax cuts for the wealthy. The bill would eliminate two taxes that Obamacare imposed on the well-to-do to help pay for the law: The 3.8% tax on investment income and the 0.9% Medicare payroll tax on incomes over $200,000 for individuals and $250,000 for married couples who file jointly. The investment income tax would disappear in 2017, but the Medicare payroll tax would remain until 2023.\nRelated: Here's how much millionaires would save under GOP Obamacare repeal bill\nRepeal the taxes on health insurers, prescription drug makers and medical devices. The bill seeks to lift the annual tax Obamacare imposed on drug makers and health insurers and It would also get rid of the 2.3% excise tax on the sale of certain medical devices that was put in place. The taxes would disappear in 2017.\nSay goodbye to the tanning tax. The bill would eliminate a 10% tax on indoor tanning services that was introduced as part of Obamacare. It would take effect in 2017.\nRelated: Republican health care plan would repeal 'tanning tax'\nRepeal the tax break for health insurance executives' pay. The legislation would roll back the Obamacare provision that placed a $500,000 limit on deductions for each executive's compensation. Top insurers pay their leaders millions in compensation every year so this provision could mean a nice tax savings for the companies. The provision would begin in 2017.\nRelated: Health care plan has tax break for insurance execs\nReduce the income threshold for deducting medical expenses. Under the GOP bill, taxpayers would be able to deduct medical expenses that exceed 5.8% of their adjusted gross income. Obamacare had raised the threshold to 10%. This would begin in 2017.\nDefund Planned Parenthood. In keeping with long-standing Republican beliefs, the legislation prohibits federal funding for Planned Parenthood. But the restriction is only for a year.\nEliminate support for CDC Prevention and Public Health Fund. The bill would eliminate nearly $1 billion in funding for this program, which Republicans call a slush fund. The Centers for Disease Control says the money supports heart disease and stroke prevention, immunization, lead poisoning prevention and diabetes prevention, mostly through grants to states and local programs.\nRelated: Advocates call foul on CDC cuts in repeal bill\nIncrease funding for community health centers. The bill would provide an additional $422 million this year for community-based outpatient facilities that provide health services -- such as medical, dental and mental health -- to lower-income populations.\nRelated: These low-income kids could lose access to dental care\nAllow insurers to sell plans that cover less of the costs. Obamacare created four tiers of coverage, each with a requirement to cover a certain share of policyholders' costs, on average. The bill would eliminate this rule. Presumably, insurers would be able to offer plans with higher deductibles and co-pays. However, since the legislation does not lift the cap on out-of-pocket expenses, insurers could not require consumers to pay more than that for covered services. The deductibles for many bronze-tier plans are already pegged to that cap.\nWhat the bill doesn't change\nRequiring insurers to offer coverage to those with pre-existing conditions. Insurers would still be required to offer policies to those with pre-existing conditions, but they could charge them more if consumers let their coverage lapse.\nAllowing kids under age 26 to remain on their parents policies. The Republicans want to keep this Obamacare provision, which has helped insure young adults. By one estimate, seven million people get coverage as a result.\nRelated: Popular coverage for children under 26 may be health law's Achilles heel\nKeeping annual and lifetime limits. Prior to Obamacare, many insurers in the individual market had caps on how much they'd cover each year or over an enrollee's lifetime. Some would not pay anything after an enrollee's care costs more than $500,000 or $1 million. Obamacare banned those limits for essential health benefits. However, insurers could cap payments on treatments not covered by the policy.\nRetaining out-of-pocket maximums. Under Obamacare, consumers don't have to pay anything after they hit the out-of-pocket maximum for in-network providers and for essential health benefits. For 2017, the max is $7,150 for an individual and $14,300 for a family. This limit doesn't apply if one goes to an out-of-network doctor or hospital or receives a treatment not covered by the policy.",
    "label": 3
}