{
    "index": 165,
    "text": "WASHINGTON -- Michelle Obama on Friday criticized a Trump administration decision to delay federal rules aimed at making school lunch healthier, saying kids will end up \"eating crap\" instead.\nMrs. Obama told a health conference in Washington that more nutritionally sound school meals are needed since millions of kids nationwide eat federally subsidized breakfast and lunch at school. Without mentioning President Trump by name, she urged parents to think about the government's recent decision and to \"look at motives.\"\n\"You have to stop and think, 'Why don't you want our kids to have good food at school? What is wrong with you and why is that a partisan issue?\" Mrs. Obama said. \"Why would that be political?\"\n\"Moms, think about this. I don't care what state you live in, take me out of the equation, like me, don't like me, but think about why someone is OK with your kids eating crap,\" she said.\nDuring a nearly hourlong conversation led by Sam Kass, the Obamas' personal chef during their White House years and executive director of the anti-childhood obesity initiative she spearheaded as first lady, Mrs. Obama also spoke briefly about her future plans. Her family's last day in the White House was Jan. 20, and she said she and former President Obama would spend the year figuring out what comes next.\nIn one of his first major acts, Agriculture Secretary Sonny Perdue announced on May 1 that the department will delay an upcoming requirement to reduce the amount of sodium in school meals. Purdue said he also planned to keep issuing waivers to a regulation requiring that more whole grains also be served. Schools could also serve 1 percent flavored-milk instead of the nonfat variety now required.\nThe school meal changes reflect suggestions from the School Nutrition Association, which represents school nutrition directors and companies that sell food to schools. The group often battled with the Obama administration, which phased in the healthier school meal rules starting in 2012.\nThe move partially rolls back rules the former first lady supported as part of her \"Let's Move\" anti-childhood obesity initiative, but leaves most of the Obama administration's school meal rules in place. Those rules include requirements that students must take fruits and vegetables on the lunch line. Some schools have asked for changes to that policy, saying students often throw those items into the trash.\n\"If kids aren't eating the food, and it's ending up in the trash, they aren't getting any nutrition - thus undermining the intent of the program,\" Perdue said in making the announcement at a school in Leesburg, Virginia.\nBut Mrs. Obama said it's time for adults to take charge and not put kids in charge.\n\"How about we stop asking kids how they feel about their food because kids, my kids included, if they could eat pizza and french fries every day with ice cream on top and a soda they would think they were happy, until they get sick,\" she said.\n\"That to me is one of the most ridiculous things we talk about in this movement,\" the former first lady continued. \"You know what? Kids don't like math either. What are we going to do? Stop teaching math?\"\nHer appearance at the annual conference, sponsored by the Partnership for a Healthier America, a nonprofit organization that was created to support her anti-childhood obesity work, was Mrs. Obama's second major public outing since leaving the White House. Last month in Orlando, Florida, she participated in a question-and-answer session during the American Institute of Architects' annual conference.\nThe Obamas have started to re-emerge into the public arena after laying low and cooling their heels on vacations since leaving the White House. Mrs. Obama said she and her husband are busy settling into their new home and offices in Washington and making sure daughters Malia and Sasha are doing well. They also have books to write and money to raise for the presidential center they plan to build on the South Side of her native Chicago.\n\"We're not gone. We're just breathing,\" Mrs. Obama said.",
    "label": 2
}