{
    "index": 456,
    "text": "Amid opioid epidemic, White House may cut drug control office budget\nShow Caption Hide Caption Trump’s new opioids strategy not popular with health advocates President Donald Trump campaigned across the country promising to fix the opioid crisis, but public health advocates say his early moves are poised to make it far worse. USA TODAY\nWASHINGTON—In the midst of an opioid addiction epidemic, the Trump administration is considering a plan that would gut the Office of National Drug Control Policy, a White House office that directs the country’s drug prevention efforts.\nThe president's budget office is proposing to slash the drug agency’s budget by 95 percent, according to a letter the ONDCP’s acting director, Richard Baum, sent to employees.\nIn his letter, obtained by USA TODAY, Baum warned that the move would be “very discouraging for our nation's effort to address drug abuse.” He said the budget plan would zero out two programs designed to combat drug trafficking and to fund local anti-drug efforts.\nBaum said he was working to reverse the proposed cuts.\n\"These drastic proposed cuts are frankly heartbreaking and, if carried out, would cause us to lose many good people who contribute greatly to ONDCP's mission and core activities,\" he wrote. \"We hope to turn this around.\"\nThe plan was first reported by Politico.\nAn internal White House document obtained by USA TODAY says the proposal would create a “smaller, more streamlined” drug control office that could more effectively direct drug-control policy.\n“This change will allow ONDCP to focus on identifying priorities and coordinating interagency efforts,” the White House document states. The cuts would allow the administration to “better address the top drug threats, including the opioid epidemic.”\nThat document also suggests that the two programs targeted for elimination — the High Intensity Drug Trafficking Areas (HIDTA) program and the Drug Free Communities program — are duplicative.\nHIDTA provides federal money to help local law enforcement officials in areas most adversely affected by drug trafficking. It is very popular among members of Congress, some of whom have worked hard to get their local communities designed as “high-intensity” and thus eligible for federal funds.\nThe White House document says the initiative has grown exponentially, from about 5 regions receiving funds in 1988 to 28 now, at a cost of $250 million a year.\n“Additionally, the HIDTA program is duplicative of other federal efforts that encourage and fund” anti-drug efforts, the White House budget document states.\nA White House spokeswoman, Sarah Sanders, downplayed the possible budget move.\n\"When it comes to the opioid epidemic, the president has been extremely clear. This is a top priority for him,\" Sanders told reporters.\nShe said the White House's proposed budget is not final. \"I certainly wouldn’t get ahead of conversations about the budget,\" she said. \"The bigger point here is the president has been very clear that the opioid epidemic in this country is huge priority for him. Something he is certainly very focused on tackling.\"\nAny move to kill the federal drug control office or slash its budget would likely be met with fierce resistance from members of Congress, who have the final say on such spending matters.\n“I’ve known and worked with our drug czars for more than 20 years and this agency is critical to our efforts to combat drug abuse in general, and this opioid epidemic, in particular,\" Sen. Rob Portman, R-Ohio, said in a statement on Friday.\nHe noted that the office oversees a program he helped create: the Drug Free Communities Act, which he said has provided more than $1 billion to community drug coalitions around the country over the last 20 years.\n\"We have a heroin and prescription drug crisis in this country and we should be supporting efforts to reverse this tide, not proposing drastic cuts to those who serve on the front lines of this epidemic,\" Portman said.\nContributing: Maureen Groppe",
    "label": 3
}