{
    "index": 83,
    "text": "The Maine senator said the Senate will start from scratch on bill.\n— -- Sen. Susan Collins, R-Maine, said the Senate will come up with a \"new, fresh approach\" to health care rather than rigidly follow the Obamacare replacement bill narrowly passed by the House on Thursday.\n“The Senate is starting from scratch,\" Collins told ABC News Chief Anchor George Stephanopoulos in an exclusive interview Sunday on \"This Week.\"\n\"We're going to draft our own bill and I’m convinced that we're going to take the time to do it right,” she said.\nHouse Speaker Paul Ryan, who also appeared on “This Week,” acknowledged that the Senate would make changes to the bill.\nBut Collins said she thinks the upper chamber will “come up with a whole new fresh approach that solves the legitimate flaws that do exist with the [Affordable Care Act] ... but it will keep some benefits of the ACA.”\nCollins expressed some concerns about the House bill.\nThe Maine senator said it’s “unlikely” that people with pre-existing medical conditions would get the same or better coverage under the House bill than under Obamacare because the legislation would give states freedom on aspects of insurance coverage.\n“So much discretion is given to the states without any guardrails,” Collins said.\n“If the coverage [offered under the bill] is unaffordable, that doesn't do any good for a child who has juvenile diabetes,\" she said.\nCollins also took issue with the bill’s failure to adjust the size of its tax credits based on people's income or where they live.\n“That really hurts a state like Maine, where we have an older population living in largely more expensive, rural areas, as far as health care is concerned,” she said.\nThe senator said she also opposes the bill's ban on Medicaid funding for Planned Parenthood.\n\"I don't think low-income women should be denied their choice of health care providers, for family planning, cancer screenings, for well-women care,” Collins said. “It's not fair and it is a mistake to defund Planned Parenthood.”\nIn the Senate, not a single woman is part of the working group created to overhaul health care. Stephanopoulos asked Collins why she, one of only five Republican female Senators, wasn’t included in the group.\n“Well, the leaders obviously chose the people they want,” she said.\nCollins added that she would like to a bipartisan group of Senators take on health care, including Democrats who acknowledge problems with Obamacare and \"Republicans who also want to make sure that we're not reducing coverage and we're giving flexibility.”",
    "label": 2
}