{
    "index": 387,
    "text": "On the Thursday evening before Easter, photographers staking out Palm Beach International Airport in Florida awaiting President Trump were surprised to see not one, but two Air Force planes arriving within minutes of each other.\nShortly before the president landed, Melania Trump arrived on a Boeing C-32 — a military version of a 757 — with their 11-year-old son, Barron, and other family members to spend the holiday at the Mar-a-Lago golf resort. Her one-way trip from New York, where she lives separately from her husband so their son can finish the school year, cost taxpayers more than $110,000.\nNobody questions that the safety of the president and his family is of vital national interest, or that the costs of first family travel and protection have soared in the age of terrorism.\nBut a unique set of circumstances has made the current presidential family the most expensive in history. There is no standard methodology to tally travel and protection costs, but based on publicly available information reviewed by The Times, the total for Trump’s first 100 days was at least $30 million. By comparison, the conservative think tank Judicial Watch found that costs for President Obama and his much smaller family averaged $12 million a year.\nIn the federal budget compromise reached last week, Congress allocated the Secret Service an additional $13 million to cover unanticipated overtime for its agents. It also set aside an extra $61 million to reimburse New York and Palm Beach for some of their expenses incurred since the election to protect the first family.\nAdvertisement\n“Although the federal government does not otherwise reimburse costs of state or local law enforcement for activities in support of the United States Secret Service protection mission, these funds are being provided in recognition of the extraordinary costs borne by a small number of jurisdictions in which a residence of the president is located,” the budget bill stated.\nThe jump in costs is largely due to the fact that Trump has used three separate residences — the White House, Trump Tower and Mar-a-Lago. Over the weekend he added a fourth: the Bedminster, N.J., golf club where the family has traditionally spent summer weekends.\nIn addition to protecting the president and first lady, the Secret Service guards five children, their three spouses and eight grandchildren — 16 people in all. Since the election, Secret Service agents have accompanied the president’s two adult sons on business trips to Dubai, Uruguay, the Dominican Republic, Canada, Ireland and Scotland. Each “protectee” — as they are called by the Secret Service — gets his or her own security detail even when traveling together.\nWhen Melania, Barron and the president’s younger daughter, Tiffany, recently visited Chelsea Piers, a sporting complex in Manhattan, 14 Secret Service vehicles waited outside.\nAnd when Donald Trump Jr., wife Vanessa and their five children; Ivanka Trump and her three children; and Eric Trump, wife Lara and their two beagles went to Aspen, Colo., for spring break, they were accompanied by up to 100 Secret Service agents. Ski rentals for agents cost taxpayers $12,208, according to a government invoice uncovered by NBC News.\nThe most expensive property to protect is Trump Tower, the 58-story skyscraper in midtown Manhattan where Melania and Barron live in a penthouse and Donald Jr. and Eric have their offices.\nThe New York Police Department wrote in a letter to Congress that it was spending $127,000 to $146,000 a day to secure the building, in addition to the $4.5 million that the Fire Department expects to spend this year on security there. The costs are expected to decline after Melania moves to Washington this summer.\nJonathan Wackrow, a former Secret Service agent who had been assigned to former First lady Michelle Obama, says the costs are justified because the security of the first lady has a direct bearing on the president’s ability to function.\nEven so, Wackrow said: “It’s an astronomical expense. You have to set up a massive security structure for the first lady to operate outside of Washington with everything that support the detail, from cars to communications.”\n“New York is a very complicated environment,” he added. “It’s not like you’re working in Billings, Mont.”\nPresident Trump and Japanese Prime Minister Shinzo Abe arrive at Trump International Golf Club in West Palm Beach, Fla., in February. (Susan Walsh / Associated Press)\nOn a weekday afternoon, cool and drizzling with nary a protester in sight — what should pass as a quiet day at Trump Tower — the building is a veritable fortress girded by at least 30 uniformed NYPD officers and at least that many Secret Service agents in bulletproof vests inspecting bags or guarding the elevators and doors.\nThere also is a fleet of two dozen armored SUVs, mobile police stations, police cars and other vehicles, including a strategically placed garbage truck that blocks the private garage through which members of the Trump family enter and leave the building. More security forces are tucked away in the surrounding high-rises.\nMar-a-Lago is another big expense. Palm Beach County says its overtime runs $60,000 a day when Trump is visiting, and was $250,000 for the weekend when Chinese President Xi Jinping joined him. The county is considering turning the Mar-a-Lago resort into a special taxing district to recoup the money being spent on Trump.\nSince taking office, Trump has spent seven weekends at the resort, each trip costing at least $1 million, with some estimates running up to $3.6 million. The biggest chunk of that is the $142,000 an hour it costs to fly Air Force One.\nMelania Trump has flown separately on five occasions either to or from Palm Beach, according to the Palm Beach Post. Public accounts of her appearances show she has also made at least eight round-trip flights to Washington, D.C., since the inauguration. The Air Force said that it could not immediately provide her flight records but that each hour of flying on the Boeing C-32 — the largest and most expensive of the three planes she uses — costs $38,922.\n“It is all about security,” Wackrow said. “The first lady needs to be in constant communication with the president and she has no ability to do that on a nonmilitary aircraft.”\nMore controversial is the foreign travel of Donald Jr. and Eric, who make frequent splashy trips to Trump-branded properties.\n“You have people with not only heavy travel schedules, but heavy business schedules with enormous public profiles,” said Dan Bongino, a former Secret Service agent who is now active in Republican politics in Florida. “Donald Trump Jr. is like a brand in and of itself.”\nFireworks lighted up the sky over Dubai in mid-February when the Trump brothers hosted a private party for 1,500 people to open the Trump International Golf Club, events that were guarded at the expense of U.S. taxpayers. The costs have not yet been made public, but a shorter trip by Eric Trump to promote a Trump Tower in Punta Del Este, Uruguay, ran up $97,830 in hotel bills for Secret Service agents, State Department personnel and local law enforcement officials, according to government records found by the Washington Post.\nA former Secret Service agent said a trip of that type would have required at least 20 agents — field officers, intelligence officers, day- and night-shift agents, and drivers — and that they might have gone ahead by two weeks to prepare. Secret Service agents are reimbursed for food and lodging at the State Department daily rate, which for Dubai, United Arab Emirates, is up to $553.\n“You don’t want a family member of the president to go unprotected, but what you really have here are ... taxpayers subsidizing Trump’s business activity,” said Norman Eisen, who served as ethics czar under Obama and now heads the watchdog group Citizens for Responsibility and Ethics in Washington.\nThe cost of protecting Obama and his family during the previous administration drew the ire of Republican columnists and politicians, including Trump. “President @BarackObama’s vacation is costing taxpayers millions of dollars — Unbelievable!” he tweeted in January 2012 while the Obama family was visiting Hawaii.\nJudicial Watch frequently skewered Obama for travel and security spending, estimating that each winter vacation in Hawaii cost taxpayers about $4 million.\n“The Obamas’ notorious abuse of presidential travel perks wasted military resources and stressed the Secret Service,” the watchdog’s president, Tom Fitton, said in a press statement in December. “… President-elect Trump can immediately save taxpayers money by reforming presidential travel.”\nNow Fitton says his group has filed requests under the Freedom of Information Act for an exact accounting of spending under Trump and will sue agencies that fail to comply.\nHe defended Trump’s right to visit his home on weekends, especially because the president is working. But he encouraged Trump to play golf closer to home — on the Virginia golf course he owns, for example — or to follow the lead of past presidents and make Camp David in Maryland his main retreat.\n“There should be some sensitivity on his part,” Fitton said. “He owns planes so he knows what it costs to fly one.”\nTo read the article in Spanish, click here\nbarbara.demick@latimes.com\nTwitter: @BarbaraDemick\nALSO\nTrump says we need a government shutdown. Here’s what’s happened in the past\nThe killing of Jordan Edwards shows again how black males — even children — are viewed as a threat\nFormer top Justice Department official Sally Yates to testify about Michael Flynn and Russia",
    "label": 3
}