{
    "index": 139,
    "text": "The Senate passed a $1.1 trillion spending deal Thursday that funds the government through the rest of the fiscal year, which ends Sept. 30, sending it to President Trump's desk.\nMr. Trump is expected to sign the measure. House lawmakers approved the comprehensive measure in a 309-118 vote on Wednesday.\nRepublican and Democratic negotiators reached the agreement Sunday night, and Vice President Mike Pence told \"CBS This Morning\" earlier this week that President Trump had signed off on its parameters.\nDemocrats have cheered the wins in the bill, which doesn't fund Mr. Trump's planned wall along the U.S.-Mexico border, provides funding for Planned Parenthood and gives the National Institutes of Health (NIH) a budget boost.\nRepublicans' major victory in the measure is a boost to defense spending -- a $25 billion increase for the U.S. military over the 2016 level. The bill includes more than $76 billion for the Pentagon's war fund, known as the overseas contingency operations (OCO) account, which is used for operations overseas such as those against the Islamic State of Iraq and Syria (ISIS).\nThe measure, however, withholds $2.5 billion of war-related funding until Mr. Trump submits his comprehensive plan to defeat ISIS to Congress, according to a summary prepared by Democrats. It said, \"The plan shall include benchmarks for progress in defeating ISIS and directs the secretary of defense and secretary of state to provide quarterly updates to Congress.\"\nOther items in the legislation include a one percent cut to the Environmental Protection Agency (EPA) and funding to reimburse local police departments in places like New York City and Florida to cover security needed to protect the president and the rest of the first family. Lawmakers also reached a deal to permanently fund health benefits for retired coal miners.\nThe next spending showdown is just a few months away, when lawmakers will need to pass a new package by Oct. 1. Meanwhile, Mr. Trump threatened a government shutdown in a tweet on Tuesday, laying the groundwork for what's sure to be a messy and chaotic legislative season this fall.",
    "label": 2
}