{
    "index": 499,
    "text": "How high should Congress let flood insurance rates rise in program renewal?\nCongress is considering dramatic changes to the National Flood Insurance Program, which has a $25 billion debt that its director says cannot be repaid.\nBut as a Sept. 30 deadline looms for the program to be renewed, disagreements remain over how much homeowners should be forced to pay for flood insurance to make the program more solvent.\nIf Congress can't reach an agreement, a lapse in the Federal Emergency Management Agency's legal authority to write new policies could disrupt real estate sales in flood-prone areas around the country.\nU.S. had more floods in 2016 than any year on record 2016 really was the year of the flood in the U.S.: In total, 19 separate floods swamped the nation last year, the most in one single year since records began in 1980. USA TODAY\nRepublican Sen. Bill Cassidy of Louisiana and Democratic Sen. Kirsten Gillibrand of New York are circulating draft legislation to renew the program, but it contains provisions — such as vouchers to help low-income homeowners keep the cost of premiums and fees from getting too high — that are not in a draft that Republicans on the House Financial Services Committee plan to release this week.\nDisputes also remain over how to address wrongdoing by insurance companies and affiliated contractors in the wake of Superstorm Sandy and last year's floods in Louisiana, and whether older properties that flood repeatedly should still receive discounts. Many in Congress also want to encourage more private insurers to enter the market, but some warn the government could be left with only the riskiest properties.\nSupport historically bipartisan\nCreated in the 1970s, when the private insurance industry largely stopped covering floods, the national program tried to get property owners in flood zones to pay premiums that could be pooled to cover disasters and fund mitigation programs and mapping to spur smarter land development.\nSupport for the program has been based more on geography than party politics, and the 10 states that are home to 80 percent of policyholders are represented in the Senate by 11 Republicans and nine Democrats. Despite bipartisan support, action to renew the law has slowed this spring, and while Sept. 30 may seem a long way off, Congress is only due to be in session 51 days before the law expires.\n\"The Senate was originally waiting for the House to move, but given the time line, members are now looking to get issues out there with introduction of individual bills in the hope they'll be part of larger package,\" said Laura Lightbody, director of the Flood-Prepared Communities Project at the Pew Charitable Trusts.\nCassidy said his office has been working with stakeholders, and there are plans for the staffs of lawmakers from the Gulf Coast and the Atlantic Coast to meet.\n“We have to get it out there to kind of socialize the ideas first,” he said earlier this month. “We have some new concepts and we need feedback.”\nSens. Marco Rubio and Bill Nelson, the Republican and Democrat representing Florida, joined three colleagues in sending a letter April 20 urging Senate leaders to set aside time to debate a renewal of the law.\nIf the Sept. 30 deadline does pass without a new law — which has happened in the past — the nearly 5 million existing policies would remain in effect, but new ones could not be issued. That could disrupt home sales in flood-prone areas around the country, because flood insurance is mandatory for properties in high-risk zones bought with federally backed mortgages.\n\"There is a struggle here for the future of flood insurance,\" Rep. Tom MacArthur, a New Jersey Republican on the House Financial Services Committee, said after a hearing in March. \"There are those who want to put it on a path to extinction.\"\nMassive debt a stumbling block\nRun by the Federal Emergency Management Agency, the program owes the U.S. Treasury nearly $25 billion, most of it borrowed to pay claims from Hurricanes Katrina and Rita in 2005 and Superstorm Sandy in 2012. Interest now costs $400 million a year, or about 11 percent of all the premium dollars paid, and heavy floods in the South and Midwest last year necessitated borrowing an extra $20 million in January just to meet interest payments in March.\nBudget hawks, some of whom question why the government is in the insurance business at all, say the program needs to be more \"self-sustaining.\" An outline of key provisions of the House bill released last week calls on FEMA to \"strengthen taxpayer protections,\" in part by charging policyholders more to build a reserve fund.\nAt the same time, many representatives of flood-prone areas say the next law has to include a formula requiring policies to be \"affordable.\"\nRead more:\n“If it’s not affordable, it won’t be available and it will be devastating to coastal communities and any communities that are near or on the water across not just my district, but across the United States,” said Rep. Steven Palazzo, R-Miss., vice chairman of the Home Protection Caucus, a bipartisan group formed in 2013 to respond to steep premium increases resulting from a 2012 renewal of the program.\nFEMA's top flood insurance official, Roy E. Wright, told a House committee in March that the debt is partly the result of discounts for policies that Congress mandated over the years, and existing policyholders cannot be expected to repay it.\n\"There is no practical way for us to pay nearly $25 billion in debt. Full stop,\" Wright told a the Senate banking committee in March.\nSen. Bob Menendez, D-N.J., argued $10 billion of the debt could be blamed on the Army Corps of Engineers for not maintaining levees that failed during Katrina.\n\"What we're doing is we are paying ourselves interest on a debt that we have largely created,\" Menendez said. \"Instead of having this type of money either be invested in the program, or ultimately reducing the debt, we are paying interest to ourselves.\"\nHomes that flood repeatedly a burden\nAbout 1 in 10 properties with repeated flood claims have received payments that, in total, exceed the home's value, according to the Congressional Research Service.\nRepeatedly flooded properties represent just 1 percent of the policies, but they account for 25 to 30 percent of overall losses, according to the Pew Charitable Trusts. Five states — Florida, Louisiana, New Jersey, New York and Texas — each have more than 10,000 properties with repeated flood claims, and many of them are older properties that got discounts intended to encourage communities to enter the national program.\nA bill proposed by Reps. Ed Royce, R-Calif., and Earl Blumenauer, D-Ore., would require communities to take pre-emptive action to end the cycle of flooding and rebuilding and the resulting costs of recovery.\nTrump seeking cuts\nThe Cassidy-Gillibrand bill would reallocate surcharges FEMA collects to provide $400 million annually for mitigation and resiliency assistance to reduce the risk of future flooding. But that program and another FEMA mitigation program would be eliminated under the preliminary 2018 budget proposed by Trump in March.\nTrump also called for an increase in surcharges, and some critics have alleged he would put that money toward funding a wall along the Mexican border, since FEMA and the Customs and Border Protection office are both part of the same Department of Homeland Security.\nIt's not clear, however, if the administration has a plan for dealing with the flood insurance issues Congress is grappling with. Lightbody, the Pew Trusts official, said that Congress did not change any of the programs Trump was targeting in the 2017 spending bill it passed earlier this month.\n\"Members, I don’t think, have taken that very seriously,\" she said. \"There's a lot of support in Congress for mapping and predisaster mitigation.\"\nPrivate insurers a flashpoint\nFEMA provides coverage for nearly 5 million properties, but most of those policies are sold and serviced by commercial insurers, known as \"write-your-own\" companies, that receive commissions from the government\nMenendez and Sen. John Kennedy, R-La., grilled Wright at a hearing in March about insurers low-balling damage claims based on appraisals made by consulting firms that have used suspect procedures for making estimates. Kennedy was incensed that a company accused of manipulating estimates after Superstorm Sandy was still hired to make estimates after 2016's Louisiana floods.\nHe's proposed the \"Program Consultant Accountability Act\" that would give FEMA more authority to fire consultants and contractors in the program.\n“The bill will be fair,” Kennedy said during a floor speech earlier this month. “It will also have an appeals process to ensure that there are not false accusations against innocent parties. This is a simple, commonsense reform that frankly should have been put in place years ago.”\nMenendez is seeking cap the insurers' compensation, which he said could be 45 percent of the premium when the risk is being borne by FEMA. He has proposed to limit profits for write-your-own companies based on performance and service. He also would remove what he says is an incentive to low-ball claims to policyholders.",
    "label": 3
}