{
    "index": 450,
    "text": "This week in OnPolitics: What's important is that everyone tried their best\nWhat a week! First, Congress passed a budget that pretended to fund The Wall, then President Trump practiced his penmanship by writing a meaningless executive order, then the House played \"let's pretend we're repealing Obamacare.\" Sometimes it's exhausting doing nothing at all.\nIt's Friday, the weekend is here, and it's time for one last edition of OnPolitics Today, USA TODAY's politics newsletter. (Subscribe here.)\n'Repeal and Replace' practice run goes flawlessly\nCelebrating the House's passage of the American Health Care Act, or despairing at what's in it? Put away your party hats and/or sadness hats for now; the U.S. Senate might just start the whole thing over from scratch anyway. (Seriously, it's weird that you have a sadness hat.)\nThe bill the House passed this week was designed to bring in just enough votes from the camps that had abandoned the previous attempt to repeal and replace, mainly blue-state moderate Republicans and fiscal conservatives who only wanted to repeal the Affordable Care Act, release insurance companies from regulation and let the free market just do its thing. A late rewrite allowed insurance companies to charge more to the elderly and those with a laundry list of pre-existing conditions, but also provided $8 billion to help those patients pay their premiums.\nBut now Senate Republicans are in the driver's seat, and they've been far less vociferous about repealing the ACA than their House compatriots. It's possible they could make a few minor tweaks to the House bill, but it's more likely they'll just treat it like a hastily assembled vision board. \"We want to get it right,\" said Sen. Lamar Alexander, chairman of the Health, Education, Labor and Pensions Committee. \"There will be no artificial deadlines.\"\nReligious liberty executive order has all the legal weight of a promise ring\nTrump signs religious freedom executive order President Donald Trump signed an executive order Thursday easing federal restrictions on some political activities by religious groups. It was hailed by supporters as a boost for religious freedom, but condemned by critics as a divisive step. (May 4) AP\nEarlier this year, a leaked draft of an executive order on religious liberty seemed to imply that President Trump would allow hospitals to prevent same-sex spouses from visiting their partners in the hospital and allow federal employees not to process benefits for same-sex spouses if they had religious objections to doing so. Some religious conservatives hoped the long-rumored order even would allow businesses to refuse to serve members of the LGBTQ community (think bakeries not making cakes for same-sex weddings) or refuse to issue marriage licenses (think Kim Davis).\nThen on Thursday, Trump issued an executive order that included ... somewhat less than that. It promised to \"vigorously enforce Federal law's robust protections for religious freedom\" and \"to the greatest extent practicable and to the extent permitted by law, respect and protect the freedom of persons and organizations to engage in religious and political speech.\" In other words, it promised to obey existing laws. It's the gall bladder of presidential orders -- something that may have originally served some sort of purpose, but nobody can figure out what.\nGregory S. Baylor, senior counsel at the Alliance Defending Freedom, said Trump's order offers \"no specific relief\" to people \"threatened with the effective closure of their family-run business for simply expressing a religious point of view on marriage that differed from that of the federal government.\" Oh, and the ACLU isn't even bothering to fight it.\nCongress to Obama: OK, you've had enough\nFormer DNC chair defends Obama’s $400K speech fee The former chairwoman of the Democratic National Committee is telling Barack Obama critics to mind their own business. Susana Victoria Perez (@susana_vp) has more. Buzz60\nLast July, Congress passed a bill limiting pensions for former presidents once they had made $400,000 or more in a year. When the bipartisan, otherwise-unopposed bill made it to President Obama's desk, it was met with a surprise veto, saying the bill would have \"unintended consequences\" and \"impose onerous and unreasonable burdens.\"\nFast-forward to today, and Citizen Obama has accepted a gig making a speech to Wall Street execs that will pay him -- get this -- exactly $400,000. And it looks like the old bill's sponsors, both Republicans and Democrats, might still be on board with the limits.\n\"The Obama hypocrisy on this issue is revealing,\" said Rep. Jason Chaffetz, R-Utah, chairman of the House Oversight and Government Reform Committee and sponsor of the 2016 bill. \"His veto was very self-serving.\"\nOriginal co-sponsor Rep. Elijah Cummings (D-MD) \"definitely supports the concept, and if we can work out the technical issues with the bill that arose late in the last Congress, we expect he would strongly support it again,\" said spokeswoman Jennifer Hoffman Werner. Phew! Looks like Obama only has to write one speech this year.\nMore from PoliticsLand\nBernie whiffs on Trump-hacking opportunity\nThursday afternoon, MSNBC showed Sen. Bernie Sanders a clip of President Trump praising Australia's health care -- which is actually universal health care, aka Bernie's dream scenario.\nBernie Sanders cracked up and said \"we'll quote you\" after Trump praised Australia's universal health care https://t.co/cK5v5elXZ9 pic.twitter.com/gDMM6hU9Fz — BuzzFeed News (@BuzzFeedNews) May 5, 2017\nWhat Bernie said: Laughed, then said he was going to use Trump's words against the AHCA on the floor of the Senate.\nWhat Bernie wishes he said: \"Damn, he's right. HE'S RIGHT, EVERYONE! Look, Trump's a smart businessman and a great judge of value. Mr. President, if you're listening, I want to set aside partisanship and work out the details of TrumpCare based on the Australian model.\"",
    "label": 3
}