{
    "index": 693,
    "text": "NEW You can now listen to Fox News articles!\nIn back-to-back speeches from the Senate floor, a pair of Republican senators on Wednesday broke rank and said they’d oppose the nomination of Betsy DeVos as Education secretary.\nGOP Sens. Susan Collins of Maine and Alaska’s Lisa Murkowski are the first Republicans to come out against one of President Trump’s Cabinet picks.\n“I was trying to get to yes, I couldn’t,” Murkowski said.\nCollins called DeVos “a product of her experience.”\n“She appears to view education through the lens of her experience promoting alternatives to public school education in Detroit and other cities,” Collins said.\nDespite the Republican pushback, White House press secretary Sean Spicer expressed confidence - “100 percent” - that DeVos would be confirmed and added she was “unbelievably qualified” for the post.\nSenate Majority Leader Mitch McConnell’s office told Fox News that they aren’t worried about her confirmation.\nIf all of the other GOP senators support DeVos- as expected - and all Democrats oppose the nomination, DeVos would end up with a 50-50 vote in the Senate. If that happens, it would be up to Vice President Mike Pence to break the tie.\nDeVos, a billionaire charter school advocate, has emerged as a polarizing figure. The wealthy Republican donor has been denounced by Democrats – and now two Republicans - who have slammed her credentials.\nDeVos has never worked in the public school system nor has she sent her children to public school.\nControversy surrounding DeVos increased Monday after she was accused of lifting several sentences or phrases from sources – including one from a top Obama administration civil rights official - without attribution in her written responses to questions from lawmakers on the Senate Health, Education, Labor and Pensions Committee.\nOn Tuesday, the Senate committee voted along party lines to send her confirmation to the full Senate for final approval.\nA full Senate vote could come early next week.",
    "label": 3
}