{
    "index": 170,
    "text": "Former Director of the FBI James Comey retained a fairly low-profile on the internet until he got fired by President Trump on Tuesday, according to new data by media optimization company SocialFlow.\nIn measuring the total engagements (likes, comments, posts) on Facebook, Twitter and other social media platforms of Comey as well as Mr. Trump, SocialFlow media strategist Mark White concluded that the former director was the \"almost the invisible FBI chief\" until Tuesday.\nIn the new data, SocialFlow found that after the announcement of his termination, Comey's online presence shot up. He was mentioned on Twitter nearly 2.7 million times in just 24 hours.\nWhite said that Comey's Twitter spike is \"whopping,\" but his engagements on Facebook were even double that.\nIn the same 24-hour period on Facebook, Comey reached nearly 184 million users with an average of 4.7 million user engagements per post. In addition, 2,795 news articles were also posted about him.\nHere's a graph of the recent spike in Comey's Twitter mentions. A major difference in user engagement can be found between Comey's firing and his Judiciary Committee testimony on May 3, in which he answered questions about an FBI investigation into possible ties between Trump campaign officials and Russian election meddling.\nThis SocialFlow graphs shows the spike in former-FBI Director James Comey's popularity on Twitter after his termination on Tuesday, May 9, 2017. SocialFlow\nThe numbers from his firing are by far his largest when contrasted with other high-profile events involving Comey such as the publishing of an FBI report on the Hillary Clinton email investigation in September 2016, which led to his decision to not recommend prosecuting her.\nComey's Facebook numbers for that month reached only around one million users per post and just an average of 40,000 engagements.\nThis SocialFlow graphs measures the response of social media in 2016 users to published articles about former-FBI Director James Comey. SocialFlow\nWhen Comey raised new questions about Clinton's emails in October just days before the election, his Facebook numbers were just half of what they were in September, suggesting an overarching interest in Comey's role in the investigation, at least online, was lagging.\nWhile Comey's engagement numbers for top social-media platforms from 2016 were noticeably smaller to those after his termination, they are microscopic in size to the digital frenzy Mr. Trump creates on a daily basis.\n\"Comey is not in the same ballpark,\" White said, trying to compare the two.\nThe president has reinvented the wheel when it comes to elected leaders and their digital footprint. A frequent-user of Twitter, Mr. Trump, White said, is measured up with some of the most famous celebrities.\nBelow is a graph comparing social media mentions between Mr. Trump and some of the most well-known people in pop culture.\nThis SocialFlow graph measures total social media mentions over an unspecified time frame. SocialFlow\n\"We had to stop comparing Trump to the presidential candidates and instead compare him to celebs like Kanye West and David Bowie,\" White said. \"Both beat Trump for a single day, Kanye had to air his dirty laundry and Bowie, unfortunately, had to die.\"",
    "label": 2
}