{
    "index": 351,
    "text": "When officials for some big, Democratic-leaning cities asked the Trump administration during a meeting in March about a grant competition for major highway and transit projects, the message they got was concerning: Don’t get your hopes up.\nThe White House would be pursuing a new strategy for handing out the money, said Transportation Department officials, who hosted the session, one that focused on boosting “overlooked” communities.\nMany in the room took the guidance to mean that Trump intends to spend that money in places that voted for him, according to the official who described the session on condition that none of the attendees be identified.\nPresidential power has long been used to reinforce the incumbent’s electoral base, but Trump’s focus on where he won stands out.\nHe talks about it constantly. He handed out electoral maps to reporters during an interview on his first 100 days in office and boasted to another group that his decision to drop a campaign promise and stay in the North American Free Trade Agreement was sealed when he studied separate maps reflecting the impact on his political strongholds in farm states.\nAdvertisement\nThe administration’s agenda aims to re-slice the pie in a way that would shrink the share for many heavily Democratic states and urban areas.\nAlong with that comes Trump’s taste for threatening urban liberals.\n“We give tremendous amounts of money to California,” he told Fox News Channel host Bill O’Reilly in February, in describing his plan to pull funding from sanctuary cities. “California in many ways is out of control, as you know.”\nIn truth, California, like most wealthy states with big urban centers, pays considerably more to Washington in taxes than it gets back in federal spending. The federal government for decades has redistributed money from the Northeast and West Coast to poorer states, especially in the South.\nThe Trump administration seems to want to push that trend further. White House efforts to reshape how federal policy affects states and local governments are playing out in policies large and small, from ominous declarations about punishing sanctuary cities to efforts at blocking money for commuter trains in the Bay Area, to musings about forcing Californians and New Yorkers to purchase electricity generated by burning coal.\n“His philosophy is win, win, win, and he is not interested in what is polite or has historical precedent or is seen as the graceful way to lead,” said presidential historian Douglas Brinkley, a professor at Rice University in Texas.\n“He is dividing and conquering. You will see him start to punish states he has no chance of winning in 2020, and doing things that focus on feeding revenues to places like Michigan, Ohio.”\nHow that will work over time and how successful Trump will be remain unknown. Congress ultimately controls many decisions about spending. But Trump aides speak frequently of the special obligation to renew the prominence of rural and small town America.\n“His vote was to a remarkable degree [fueled by] people who felt neglected and ignored and betrayed by the traditional political class,” said Trump confidant Newt Gingrich, the former House speaker. “He sees himself as their tribune…That’s very real.”\nTrump’s allies, however, insist that does not mean a calculated system of reward and punishment.\nMany of the policies that could help forgotten manufacturing towns and farm belt states and punish Trump foes coincide with broader campaign promises. Some White House initiatives that could hit Californians hard, like the push to repeal Obamacare, could hit voters in Trump country even harder.\nAnd the president’s efforts to promote corporations extend to firms like Boeing, headquartered in Chicago, a city where plans are afoot to float massive gold balloons shaped like pigs in front of the “Trump” sign on his signature downtown building later this summer.\n“I haven’t heard him once suggest that he’s going to benefit states or only people that supported him,” said Christopher Ruddy, chief executive of Newsmax, a conservative website, and longtime Trump confidant.\n“There is a feeling certain areas of the country have been left behind, like the Rust Belt and the Midwest. Those are areas that happened to have voted for him.”\nWhite House statements that previewed a shift of money started when Trump announced that he plans to withhold funds from sanctuary cities that resist cooperation with federal deportation efforts. It continued when he released his first budget in March, proposing deep cuts to transit and federal housing programs that target urban revitalization.\nIt intensified with a tax plan unveiled last month that would wreak havoc in California, Illinois, New York and other deep-blue states by revoking the tax deduction for state and local tax payments.\nThe state and local tax deduction is worth thousands of dollars for families in high-tax places who itemize their deductions and is crucial to offsetting the cost of ambitious government programs in blue states.\n“We don’t think it’s the federal government’s job to be subsidizing states,” Treasury Secretary Steve Mnuchin said recently at the Milken Institute Global Conference in Beverly Hills.\nCalifornia and New York account for a third of what the deduction costs the federal government nationwide, and leaders in those places say the politics are undeniable.\n“His proposal to eliminate the state and local tax deduction has nothing to do with simplifying the tax code and everything to do with punishing California,” said California State Senate Leader Kevin de Leon.\nOf course, the politics cut both ways. Asked about the threat to eliminate the deduction, House Democratic Leader Nancy Pelosi waved it off with a scoffing laugh. Republicans have talked about the idea for years, but their House majority depends on GOP representatives from wealthy suburban districts where many voters take the deduction, making the idea of repeal more attractive in theory than reality.\nOther cuts are more immediately achievable. The administration did not wait for congressional deliberations before blocking a $647 million grant that had already been approved for electrifying the wheezing, overburdened and outdated Caltrain commuter line that connects San Francisco to Silicon Valley, as well as to help fund the state’s multi-billion dollar high-speed rail project.\nThe grant was stopped at the behest of a group of Republican congressmen in California who oppose the high-speed rail project, but the disruption it caused for the more immediate need to update the transit network in the Bay Area spread panic from the governor’s office to the boardrooms of Silicon Valley.\nLeaders of some of the nation’s biggest tech companies joined state leaders in demanding the administration free up the funds.\n“I never imagined that the electrification of a train would be subjected to such brutal, partisan politics,” Congresswoman Anna Eshoo (D-Menlo Park) said at the time.\nThe stopgap spending bill that Trump signed into law on Friday freed some of the money for Caltrain, but much of it remains in limbo.\nCalifornia is, of course, an inevitable target for Republican administrations. The state has used its out-sized economic clout for decades to impose regulations aimed at forcing industries to meet Sacramento’s environmental agenda.\nBut Trump’s promise for a resurgence in coal and other fossil-fuel industries is already rattling blue-state regulators who have long held the White House has no power to disrupt their clean-energy policies.\nTrump allied with Detroit auto manufacturers to threaten California’s unique legal authority to set tougher fuel-mileage standards for cars and trucks than the rest of the country. Energy Secretary Rick Perry signaled last month that he may assert that the national security interest in a stable power grid overrides the state’s ban on electricity derived from coal.\nCalifornia Lt. Gov. Gavin Newsom began battling Republican White Houses when he served as mayor of San Francisco and fought with George W. Bush over same-sex marriage.\nNewsom said that even at the height of those clashes, there remained a back channel through which elder GOP statesmen in California like George Shultz, the former secretary of State, could keep lines of communication open.\nSan Francisco’s pioneering universal healthcare law, a beacon of progressive policy when it was launched, would have collapsed if the Bush administration had not approved key funding.\n“We don’t have that now with the Trump administration,” Newsom said. “We don’t have the confidence cooler heads will prevail. More traditional rules applied then. These folks are much more punitive and petulant.”\nYet many of Trump’s boldest proposals face an uncertain future. Some, like the threats against sanctuary cities, have run into problems in court. Others face opposition in Congress.\nJulián Castro, who served as secretary of Housing and Urban Development under President Obama, said the community development block grant program that Trump wants to wipe out offers an instructive lesson.\nThe president, he said, is misreading both the needs of his base and the interdependence between the country’s urban, rural and suburban areas.\nCastro said that block grant program has evolved over four decades as one of the most politically resilient in the federal government. When Obama proposed a small cut one year, Congress returned with a funding increase.\nEven as the grants are weighted toward urban areas, the money is also spread to small towns, whose smaller budgets are more dependent on the money.\n“He doesn’t see his supporters as folks who live in big cities,” Castro said. “It’s not a very nuanced view of politics and probably not completely accurate.”\n»\nnoah.bierman@latimes.com\nTwitter: @noahbierman\nALSO:\nWhat Democrat would be crazy enough to challenge Nancy Pelosi on her home turf? Meet Stephen Jaffe\nFirst overseas foray for Trump will take him to sensitive turf: Saudi Arabia, Israel and the Vatican\nTrump order on religion fits a pattern — action far more modest than his words",
    "label": 3
}