{
    "index": 822,
    "text": "Since Donald Trump took office early this year he has signed a long and ever-growing list of executive orders, hoping to fulfill a number of his campaign promises.\nIn his first three weeks alone, Trump signed a burst of orders to undo many of President Barack Obama's policies. Later in June, in his first meeting with his Cabinet, he claimed to have accomplished more than most previous U.S. presidents:\n\"Never has there been a president — with few exceptions, in the case of FDR, he had a major Depression to handle — who's passed more legislation, who's done more things than what we've done,\" Trump said. \"I think we've been about as active as you can possibly be at a just about record-setting pace.\"\nTrump's claim hinges on the slew of executive orders he has signed, which in his first 100 days exceeded that of any other recent president.\nPresident Donald Trump holds up a signed executive order to advance construction of the Keystone XL pipeline at the White House on Jan. 24. Kevin Lamarque / Reuters\nHere's an updated overview of each of Trump's orders:\n\"Executive Order Minimizing the Economic Burden of the Patient Protection and Affordable Care Act\"\nSigned: Jan. 20, 2017\nHours after being sworn in, Trump signed an executive order aimed at reversing the Affordable Care Act — Obama's landmark legislation — which Republicans vowed to \"repeal and replace\" throughout the campaign.\nThe executive order states that the Trump administration will \"seek prompt repeal\" of the law. To minimize the \"economic burden\" of Obamacare, the order instructs the secretary of health and human services and other agency heads to \"waive, defer, grant exemptions from, or delay the implementation\" of any part of the law that places a fiscal burden on the government, businesses or individuals.\nAlso in the order are directions to give states more control over implementing health care laws.\n\"Expediting Environmental Reviews and Approvals for High-Priority Infrastructure Projects\"\nSigned: Jan. 24, 2017\nThe order outlines how the administration will expedite environmental reviews and approval of \"high priority\" infrastructure projects, such as repairs to bridges, airports and highways.\nThe order directs the Chairman of the Council on Environmental Quality (CEQ), within 30 days of a request, to determine a project's environmental impact and decide whether it is \"high priority.\" Project review deadlines are to be put in place by the CEQ's chairman.\nThe order is widely believed to have been issued in response to the protests against the Dakota Access Pipeline.\n\"Enhancing Public Safety in the Interior of the United States\"\nSigned: Jan. 25, 2017\nThe order outlines changes to a few immigration policies, but most notably it strips federal grant money to so-called sanctuary cities.\nIn addition, the secretary of homeland security is ordered to hire 10,000 more immigration officers, create a publicly available weekly list of crimes committed by undocumented immigrants and review previous immigration policies.\nThe order also creates an office to assist the victims of crimes committed by undocumented immigrants and calls on local and state police to detain or apprehend people in the United States illegally.\n\"Border Security and Immigration Enforcement Improvements\"\nSigned: Jan. 25, 2017\nThe order is aimed at fulfilling one of Trump's key campaign promises — enhancing border security — by directing federal funding to construction of a wall along the Mexico-U.S. border. It instructs the secretary of homeland security to prepare congressional budget requests for the wall and to \"end the abuse of parole and asylum provisions\" that complicate the removal of undocumented immigrants.\nOther parts of the order call for hiring 5,000 more Border Patrol agents, building facilities to hold undocumented immigrants near the Mexican border and ending \"catch-and-release\" protocols, in which immigrants in the United States without documentation are not detained while they await court hearings.\n\"Protecting the Nation From Foreign Terrorist Entry Into the United States\"\nSigned: Jan. 27, 2017\nThe order suspends the entry of immigrants from seven Muslim-majority countries — Syria, Iran, Iraq, Libya, Sudan, Yemen and Somalia — for 90 days and stops all refugees from entering the country for 120 days. Syrian refugees are banned indefinitely. During the time of the ban, the secretary of homeland security and the secretary of state will review and revise the refugee admission process.\nAlso in the order is the suspension of Obama's 2012 Visa Interview Waiver Program, which allowed frequent U.S. tourists to bypass the visa interview process.\nWhite House officials have made a number of contradictory statements, at times calling the order a \"ban\" and at other times referring to it as a \"travel restriction.\" After the order was signed, thousands of protesters popped up at airports across the country to denounce it.\nOur country needs strong borders and extreme vetting, NOW. Look what is happening all over Europe and, indeed, the world - a horrible mess! — Donald J. Trump (@realDonaldTrump) January 29, 2017\n\"Ethics Commitments by Executive Branch Appointees\"\nSigned: Jan. 28, 2017\nThis order stops all executive branch officials from lobbying for five years after they leave office and places a lifetime ban on lobbying a foreign government.\nThe order enacts a number of other lobbying restrictions, including banning appointees from accepting gifts from registered lobbyists and banning appointees who were lobbyists from participating in any issues they petitioned for within the last two years.\nSome raised concerns over how Trump will fill the jobs in his administration under the new rules.\n\"Reducing Regulation and Controlling Regulatory Costs\"\nSigned: Jan. 30, 2017\nThe order states that executive departments and agencies must slash two regulations for every one new regulation proposed. Regulation spending cannot exceed $0, and any costs associated with regulations must be offset with eliminations.\nThe order also directs the head of each agency to keep records of the cost savings, to be sent to the president.\n\"Core Principles for Regulating the United States Financial System\"\nSigned: Feb. 3, 2017\nThe order lays the administration's \"Core Principles\" regarding the U.S. financial system, which includes:\nMaking regulation \"efficient, effective and appropriately tailored\"\nPreventing government bailouts\nEnsuring that U.S. firms are competitive with foreign companies\nThe order directs the treasury secretary to review financial regulations and report back to the president 120 days later with a determination of whether current policies promote the \"Core Principles.\"\n\"Task Force on Crime Reduction and Public Safety\"\nSigned: Feb. 9, 2017\nThe order directs Attorney General Jeff Sessions to create a task force that would propose new legislation to reduce crime, highlighting drug trafficking, illegal immigration and violent crime. The task force will submit yearly reports to the president.\nThroughout the campaign, Trump promised voters a return to \"law and order\" in the United States and said minorities from inner cities are \"living in hell\" because of violent crime.\n\"Preventing Violence Against Federal, State, Tribal, and Local Law Enforcement Officers\"\nSigned: Feb. 9, 2017\nThe order calls on the Justice Department to \"enhance the protection and safety\" of law enforcement by increasing penalties for crimes committed against officers.\nThe attorney general is also instructed to review and determine whether existing federal laws adequately protect law enforcement and later to propose legislation to better protect officers. The order directs the Justice Department to recommend changes in federal grant funding to law enforcement programs if they do not protect officers.\n\"Enforcing Federal Law With Respect to Transnational Criminal Organizations and Preventing International Trafficking\"\nSigned: Feb. 9, 2016\nThe order outlines the administration's approach to cutting down on organized crime — including gangs, cartels and racketeering organizations — by enhancing cooperation with foreign governments and the ways in which federal agencies share information and data.\nIt identifies human trafficking, drug smuggling, financial crimes, cyber-crime and corruption as \"a threat to public safety and national security.\"\nThe Threat Mitigation National Intelligence — of which Sessions, Secretary of State Rex Tillerson, and the secretary of homeland security are co-chairmen — will review and recommend changes to federal agencies' practices in a report to be delivered to the president within 120 days.\n\"Providing an Order of Succession Within the Department of Justice\"\nSigned: Feb. 9, 2017\nTwo weeks after Trump fired Acting Attorney General Sally Yates, this order changes the order of succession for Sessions, who won approval as attorney general last week. The sequence is: the U.S. attorney for the Eastern District of Virginia, the U.S. attorney for the Northern District of Illinois and the U.S. attorney for the Western District of Missouri.\nA week before leaving office, Obama signed an executive order changing the order of succession without explanation.\n\"Enforcing the Regulatory Reform Agenda\"\nSigned: Feb. 24, 2017\nUnder this order, each agency must designate an official as its Regulatory Reform Officer (RRO), who will be responsible for reviewing current regulations and making recommendations to the agency head on how to modify them. The RRO must hone in on certain regulations, such as those that are outdated or are perceived to curtail job creation.\nThe order reiterate's Trump's plan to cut down on regulations and comes nearly a month after the president signed an executive order requiring agencies to slash two regulations for every one proposed.\n\"Restoring the Rule of Law, Federalism, and Economic Growth by Reviewing the 'Waters of the U.S.' Rule\"\nSigned Feb. 28, 2017\nThe order calls on federal agencies to revise a regulation put in place by former president Barack Obama called the Clean Water Rule. Signed in 2015, the rule expanded the number of bodies of water protected by the federal government to include streams, ponds and smaller waterways.\nTrump's order directs the administrator of the EPA and the assistant secretary of the Army for Civil Works to review the rule and propose a new one that either eliminates or revises Obama's rule.\n\"White House Initiative to Promote Excellence and Innovation at Historically Black Colleges and Universities\"\nSigned Feb. 28, 2017\nThe order transfers the White House Initiative on Historically Black Colleges and Universities (WHHBCU) from the Department of Education to the Executive Office of the President. Since its creation under President Ronald Reagan, the initiative had been under the purview of the Education Department.\nTrump met with dozens of HBCU presidents the day prior for a listening session, which many students and college leaders were quick to protest out of skepticism that the president was using the meeting as a PR stunt.\nIn an interview with NBC News, Omarosa Manigault said of the order, \"We understand that the executive order starts the action but there are so many different steps in terms of defining programming.\"\n\"Protecting the Nation from Foreign Terrorist Entry into the U.S.\"\nSigned: March 6, 2017\nThe order revises Trump's original U.S. immigration ban, which was hit with dozens of lawsuits shortly after being signed in February and blocked by a federal judge in Washington state. The new order, which goes into effect March 16, bans citizens from six Muslim-majority countries from entering the U.S. for 90 days.\nThe countries include Iran, Somalia, Sudan, Yemen, Syria and Libya. Iraq was removed from the list after the Iraqi government said it would increase information sharing with the United States.\n\"Comprehensive Plan for Reorganizing the Executive Branch\"\nSigned: March 13, 2017\nThe order assigns the Office of Management and Budget director Mick Mulvaney to propose a plan to \"reorganize and governmental functions and eliminate unnecessary agencies\" in an effort to cut down of federal spending and improve \"efficiency, effectiveness and accountability of that agency.\" Within 180 days, the heads of select agencies must submit individual plans to Mulvaney, who will have another 180 days to send a plan to the president.\nDuring a daily press briefing, Press Secretary Sean Spicer called the executive order \"long overdue\" and said agencies will undergo a \"thorough investigation\" into fiscal waste, though he was unable to provide a target goal for the amount of money the order aims to save.\n\"The Revocation of Federal Contracting Executive Orders\"\nSigned: March 27, 2017\nThe executive order revokes key components of the Obama administration's previous executive order banning federal contractors from discriminating against employees on the basis of sexual orientation or identity, gay rights advocates say.\nOrganizations representing the LGBTQ community say the \"Presidential Executive Order on the Revocation of Federal Contracting Executive Orders\" hobbles several of Obama's previous orders including the \"Fair Pay and Safe Workplaces\" order by revoking the requirement that companies seeking federal contracts prove they've complied with federal laws banning discrimination based on sexual identity or orientation.\n\"Promoting Energy Independence and Economic Growth\"\nSigned: March 28, 2017\nThe order directs the Environmental Protection Agency to review another executive order, called the Clean Power Plan, signed by Barack Obama in 2014. Obama's plan, which aimed to reduce carbon pollution from power plants, was halted by the Supreme Court in 2016.\nTrump's new order also asks agencies to review any regulations that could \"potentially burden the development or use\" of oil, natural gas, coal, and nuclear energy resources. Within 180 days, the agencies must submit reports to the Office of Management and Budget, which will take action to eliminate regulations.\n\"Establishing the President's Commission on Combating Drug Addiction and the Opioid Crisis\"\nSigned: March 29, 2017\nThe order creates the \"Commission on Combating Drug Addiction and Opioid Crisis,\" which will study the federal government's effectiveness in fighting drug addiction by reviewing funding levels, accessibility of treatment services, prescription practices and youth educational messages. A report will be sent to the president within 90 days of the order being signed.\nTrump appointed Gov. Chris Christie of New Jersey as head of the commission.\n\"Omnibus Report on Significant Trade Deficits\"\nSigned: March 31, 2017\nThe order directs the Commerce Department and U.S. Trade Representative to compile a report on trade practices that contribute to the trade deficit. The report will look at each of America's trade partners and assess whether the country's trade practices unfairly discriminate against the U.S.\nForms of discrimination the report will assess includes non-tariff barriers, anti-dumping and intellectual property theft. Within 90 days, the report will be sent to the White House detailing causes for the deficit.\n.@POTUS @realDonaldTrump signs executive orders on trade that will set the stage for revival in American manufacturing. #AmericaFirst pic.twitter.com/oQexlbnLtn — Dan Scavino Jr. (@DanScavino) March 31, 2017\n\"Providing an Order of Succession Within the Department of Justice\"\nSigned: March 31, 2017\nThe order changes the succession line for the Attorney General Jeff Sessions. The new sequence is:\nUnited States Attorney for the Eastern District of Virginia\nUnited States Attorney for the Eastern District of North Carolina\nUnited States Attorney for the Northern District of Texas\n\"Establishing Enhanced Collection and Enforcement of Anti-Dumping and Countervailing Duties and Violations of Trade and Customs Law\"\nSigned: March, 31, 2017\nThe order directs the secretary of homeland security to develop a plan within 90 days to combat two types of non-trade barriers placed against the U.S.: anti-dumping and countervailing duties.\nThe order also directs the DHS Secretary and Treasury secretary to step up seizure of counterfeit goods and protect American companies from intellectual property right infringement.\n\"Buy American, Hire American\"\nSigned: April 18, 2017\nThe order has two parts. The \"Hire American\" portion of the bill targets the H-1B visa program, which allows businesses to hire high-skilled workers from outside the U.S., by putting less emphasis on the lottery system used to determine which companies can sponsor visas.\nThe \"Buy American\" portion of the order directs agencies to tighten rules that give priority to U.S. companies when hiring contractors or purchasing goods. This would be done by reducing the use of waivers and exceptions to current laws. Secretary of Commerce Wilbur Ross must submit a review of \"Buy American\" loopholes within 220 days.\n\"Identifying and Reducing Tax Regulatory Burdens\"\nSigned: April 21, 2017\nThe order directs Secretary of Treasury Steve Mnuchin to review within 60 days all tax regulations put in place in 2016 and 2017 that put an \"undue financial burden on United States taxpayers.\"\nWithin 150 days, Mnunchin will submit a plan to the president detailing ways to alleviate \"the burden imposed by regulations\" identified in the initial review.\n'Presidential Executive Order on Identifying and Reducing Tax Regulatory Burdens'\nExecutive Order: https://t.co/vk0jEZDHPo pic.twitter.com/6p0vtWh4Xy — Donald J. Trump (@realDonaldTrump) April 22, 2017\n\"Promoting Agriculture and Rural Prosperity in America\"\nSigned: April 25, 2017\nThe order creates a task force, led by Secretary of Agriculture Sonny Perdue, that will identify policy options to promote U.S. agriculture business and job growth in rural America. The task force must submit a report to Trump within 180 days.\nThe task force will look at regulations that impede U.S. agricultural growth and for ways to encourage the use of agricultural products made in America.\n'Presidential Executive Order on Promoting Agriculture and Rural Prosperity in America'\nExecutive Order: https://t.co/PMz29hioJN pic.twitter.com/cpwTMWgRme — Donald J. Trump (@realDonaldTrump) April 25, 2017\n\"Review of Designations Under the Antiquities Act\"\nSigned: April 26, 2017\nThe order directs the Secretary of Interior Ryan Zinke to review federal monument designations — including national parks — made since 1996 that cover more than 100,000 acres of land. Under the 1906 Antiquities Act, presidents have the power to protect land.\nTrump's order names one national monument designation in particular: Obama's 1.35 million-acre Bears Ears National Monument in Utah. Zinke must submit a report to Trump within 45 days.\n\"Enforcing Statutory Prohibitions on Federal Control of Education\"\nSigned: April 26, 2017\nUnder the order, Secretary of Education Betsy DeVos is directed to study federal overreach in local and state education systems.\nAs a strong advocate for charter schools, DeVos will determine within 300 days whether federal education regulations take control away from states in areas such as curriculum, school administration and textbook or library content.\n\"Improving Accountability and Whistleblower Protection\"\nSigned: April 27, 2017\nThe order is aimed at improving accountability within the Department of Veterans Affairs, which found itself at the center of a 2014 controversy in which dozens of veterans reportedly died while on the wait list for medical care. The order directs Veterans Affairs Secretary David Shulkin to create the \"Office of Accountability and Whistleblower Protection\" in the department within 45 days.\nThe office will be charged with investigating wrongdoing within the department and terminating any VA employee who fails to \"carry out his or her duties on behalf of veterans.\"\n\"We will always stand with those who stood for freedom and who stood for us. They protected us, they made it all possible, and now we’re going to protect and take care of them,” Trump said at the signing.\n\"Implementing an America-First Offshore Energy Strategy\"\nSigned: April 28, 2017\nThe order reverses a ban on Arctic leasing put in place under the Obama administration in December and directs Interior Secretary Ryan Zinke to review areas available for off-shore oil and gas exploration.\n“We are unleashing American energy and clearing the way for thousands and thousands of high-paying American energy jobs,” President Trump said during the announcement.\n\"Establishment of Office of Trade and Manufacturing Policy\"\nSigned: April 29, 2017\nThe order establishes the Office of Trade and Manufacturing Policy, which will advise Trump on policies to increase economic growth and decrease the trade deficit. Leading the new office is Trump appointee and National Trade Council Director Peter Navarro, who said he wants to renegotiate NAFTA.\nThe office will also help implement the \"Buy American, Hire American\" executive order signed by Trump on April 18.\n\"Addressing Trade Agreement Violations and Abuses\"\nSigned: April 29, 2017\nThe order directs Secretary of Commerce Wilbur Ross to review all U.S. trade agreements, as well as relations with countries that run trade deficits with America.\nWithin 180 days, Ross must send a performance review to Trump detailing any violations.\n#ICYMI- On Saturday I signed two EO's to help keep jobs & wealth in our country.\nEO1: https://t.co/XJggnJAiPi\nEO2: https://t.co/AKxef169fm pic.twitter.com/1IZnxAXUGU — Donald J. Trump (@realDonaldTrump) May 1, 2017\n\"Establishment of the American Technology Council\"\nSigned: May 1, 2017\nThe order launches the American Technology Council, headed by 19 different Trump administration officials and cabinet members who will be tasked with modernizing the federal government's digital services and technology.\nThe task force, which ends in 2021, will \"coordinate the vision, strategy, and direction\" regarding the federal government's use of information technology.\n\"Promoting Free Speech and Religious Liberty\"\nSigned: May 4, 2017\nThe order eases IRS enforcement of the Johnson Amendment, which bans churches from engaging in political speech. It also gives relief to companies that disagree with the Affordable Care Act mandate on contraception in health care coverage.\nAlthough the order shows Trump delivering on a key campaign promise, congressional approval is needed to fully repeal the law.\n\"Establishment of the Presidential Commission on Election Integrity\"\nSigned: May 11, 2017\nThe order creates a commission, led by Vice President Mike Pence, to investigate allegations of voter fraud and voter suppression in the U.S. voting process. The commission, called the \"Presidential Commission on Election Integrity,\" will review vulnerabilities in the election system.\nIt comes following persistent and unfounded claims by President Donald Trump that the 2016 election was rigged and that millions of \"illegals\" voted to cost him the popular vote.\n\"Strengthening the Cybersecurity of Federal Networks and Critical Infrastructure\"\nSigned: May 11, 2017\nThe order aims to strengthen the cybersecurity of networks within the federal government by having agency heads adhere to an outlined plan.\nIt directs the Director of the American Technology Council to present a report to Trump within 90 days outlining steps to take for a \"modern, secure, and more resilient\" IT structure. The Secretary of Commerce and Secretary of Homeland Security are also directed to find ways to \"dramatically [reduce] threats perpetrated by automated and distributed attacks.\"\n\"Expanding Apprenticeships in America\"\nSigned: June 15, 2017\nThe order calls for the establishment of the Task Force on Apprenticeship Expansion, led and appointed by the labor secretary, which will \"identify strategies and proposals to promote apprenticeships, especially in sectors where apprenticeship programs are insufficient.\"\nApprenticeships, defined in the order as paid work with an educational component, are aimed at providing workers with relevant experience and skills that offer affordable paths to employment.\nThe order provides funding to promote apprenticeship programs across different industries, calls for the expansion of apprenticeship participation among students at educational institutions and instructs agencies to eliminate current federally funded apprenticeship programs deemed ineffective.\n\"Amending Executive Order 13597\"\nSigned: June 21, 2017\nThe order amends an executive order issued by the Obama administration on visa and foreign visitor processing that aimed \"to enhance and expedite travel to and arrival in the United States by foreign nationals.\"\nIt eliminates the clause that required 80 percent of non-immigrant visa applicants to be interviewed within three weeks of application receipt, and calls on the secretaries of State and Homeland Security to revise the visa expediting implementation plan laid out in Obama's order \"as necessary and appropriate.\"\n\"Reviving the National Space Council\"\nSigned: June 30, 2017\nThe order \"revives\" The National Space Council, a council tasked with advising the president on space strategy that was first established in a 1989 executive order by George H. W. Bush. It appoints the Vice President as chairman and establishes the agency heads that will compose it.\nThe council will meet at least annually to review policies and develop strategies for space activity. The order mandates that the group submit a report to the President \"setting forth its assessment of, and recommendations for, the space policy and strategy of the United States Government\" within the next year.\n\"The establishment of the council is another demonstration of the Trump Administration's deep interest in our work, and a testament to the importance of space exploration to our economy, our nation, and the planet as a whole,\" said acting NASA Administrator Robert Lightfoot in a statement about the order.\n\"Allowing Additional Time for Recognizing Positive Actions by the Government of Sudan and Amending Executive Order 13761\"\nSigned: July 11, 2017\nThe order comes in relation to a 1997 executive order issued by Bill Clinton, which named Sudan an \"unusual and extraordinary threat to national security\" for its support of terrorism, attempts at destabilizing regional governments, and serious human rights violations. The original order imposed a number of sanctions on Sudan, including a halt of all import and export deals with the country.\nPresident Trump's new order is issued a day before a deadline proposed in a relatedexecutive order issued by the Obama administration, which pointed out that Sudan had since taken positive actions to address the issues cited in Clinton's order and called for a reevaluation of the punitive sanctions. Obama's order instructed relevant government bodies to \"provide to the President a report on whether the Government of Sudan has sustained the positive actions\" on or before July 12, 2017.\nTrump's order extends the deadline for the report to October 12, 2017 to allow for \"additional fact-finding and a more comprehensive analysis of the Government of Sudan's actions.\" It also revokes a section of Obama's order requiring the same report to be updated annually and made available to the public.\n\"Establishing a Presidential Advisory Council on Infrastructure\"\nSigned: July 19, 2017\nThe order creates a Presidential Advisory Council on Infrastructure within the Department of Commerce in order to \"advance infrastructure projects that create high-quality jobs for American workers, enhance productivity, improve quality of life, protect the environment, and strengthen economic growth.\"\nThe council will be composed of up to 15 members appointed by Trump, private citizens with expertise in areas such as finance, real estate, construction and environmental policy. The group will submit a report to the president on potential infrastructure projects that could be carried out over the next 10 years, and is scheduled to be dissolved shortly after, unless given an extension by the president.\n\"Assessing and Strengthening the Manufacturing and Defense Industrial Base and Supply Chain Resiliency of the United States\"\nSigned: July 21, 2017\nThe order names national manufacturing as essential to economic strength and national security of the United States, and calls the loss of manufacturing jobs and an industrial base in the country a threat to national security.\nIn light of this, it demands that the Secretary of Defense and other relevant agencies provide \"a comprehensive evaluation of the defense industrial base and supply chains\" within 270 days of the executive order. The report will assess the strengths and weaknesses of national manufacturing capabilities, identify the manufacturing goods most essential to national security and recommend pertinent action by the President.\n“Establishing Discipline and Accountability in the Environmental Review and Permitting Process for Infrastructure”\nSigned: August 15, 2017\nThe order aims to increase the efficiency of the Federal infrastructure permitting process and revokes an Obama-era Executive Order that created stricter environmental review standards for federal projects in flood-prone areas.\nIt establishes “One Federal Decision” for major infrastructure projects, assigning each project a lead Federal agency and creating a performance accountability system to track its progress. It also sets a goal of 2 years for the average completion time of the permitting process. While announcing the order, Trump called the current permitting process \"a massive, self imposed wound.\"\nThe order also revokes Executive Order 13690, which mandated stricter environmental review standards in floodplains as part of Obama’s Climate Action Plan. That order required planners use flooding predictions that incorporated climate science.\n“Imposing Sanctions with Respect to the Situation in Venezuela”\nSigned: August 25, 2017\nThe order prohibits the purchase of certain Venezuelan government bonds on the American market while still allowing for the import of crude oil.\nTrump narrowly tailored sanctions to disrupt the Venezuelan government’s ability to raise money by selling bonds or securities within the United States. The sanctions were in response to reports of human rights abuses and increasing authoritarianism in Venezuela, including the dissolution of the elected legislature. The country’s economy is in shambles; the International Monetary Fund predicts its inflation rate will reach 2,349% in 2018.\n“Restoring State, Tribal, and Local Law Enforcement’s Access to Life-Saving Equipment and Resources”\nSigned: August 28, 2017\nThe order revokes Obama-era limits on the repurposing of military equipment for law enforcement use.\nOn January 16, 2015, the former president issued an Executive Order seeking to limit police access to repurposed military gear. The order came in the wake of national criticism surrounding the police crackdown on protesters in Ferguson, Missouri, which included armored vehicles, tear gas, and heavily armed riot police in camouflage. Protesters were responding to the killing of Michael Brown, an 18-year old black man shot by white Ferguson police officer Darren Wilson.\nObama later approved recommendations that banned the transfer of certain equipment — like tracked armored vehicles and grenade launchers — to police forces completely, and mandated strict new guidelines for departments that acquired other military-issue devices.\nThe executive order nullifies those restrictions. On the day of the signing, Jeff Sessions told a Fraternal Order of Police conference in Nashville that the Executive Order would “send a strong message that we will not allow criminal activity, violence and lawlessness to become the new normal.”\n“Proposed Acquisition of Lattice Semiconductor Corporation by China Venture Capital Fund Corporation Limited”\nSigned: September 13, 2017\nThe order bars a Chinese-backed venture capital firm from purchasing an American semiconductor company.\nTrump acted in accordance with a recommendation from the Committee on Foreign Investment in the United States (CFIUS), who determined the proposed takeover of the Lattice Semiconductor Corporation by an investment group linked to the Chinese government threatened national security interests. Lattice produces integrated circuits that could conceivably have military applications. In describing the risk, CFIUS cited the transfer of intellectual property, the Chinese government’s role in the deal, the importance of domestic semiconductor supply chain integrity, and the previous use of Lattice products by the US Government as the main factors in their decision.\n“Imposing Additional Sanctions with Respect to North Korea”\nSigned September 21, 2017\nThe order imposes wide-ranging sanctions that penalize North Korea and anyone doing business with the country.\nIt seeks to cut off sources of revenue to North Korea and punish anyone trading in goods, services, or technology with the country, including by barring ships or planes that enter North Korea from the United States for 180 days. The order allows the Secretary of the Treasury to sanction any foreign financial institution that conducts business with North Korea or North Korean individuals involved in illicit trade.\nThe order came shortly after North Korean conducted two intercontinental ballistic missile launches and an underground nuclear test. In a speech to the UN General Assembly three days before the signing of the Order, Trump told foreign leaders, “No one has shown more contempt for other nations and for the well being of their own people than the depraved regime in North Korea.”\n“Continuance of Certain Federal Advisory Committees”\nSigned September 29, 2017\nThe order extends certain federal advisory committees until September 30, 2019.\nTrump extended 32 federal advisory committees, including the Invasive Species Advisory Committee, the Trade and Environment Policy Advisory Committee, and the Presidential Advisory Council on HIV/AIDS. Presidents routinely issue similar orders extending the lifetime of federal advisory committees.\n“Revocation of Executive Order Creating Labor-Management Forums”\nSigned September 29, 2017\nThe order revokes an Obama-era Executive order that established a National Council on Federal Labor-Management Relations and mandated the creation of labor-management forums.\nObama signed Executive Order 13522 in 2009, which created the 10 person National Council on Federal Labor-Management Relations to advise the president on labor-management relations in the executive branch. It also created Labor-Management forums — committees or councils meant to increase dialogue between managers and employees represented by unions in the federal government. Trump ended both, describing the efforts as a waste of taxpayer resources and a failure in the Order.\n“Promoting Healthcare Choice and Competition Across the United States”\nSigned October 12, 2017\nTrump’s Executive Order on health care seeks to do three main things: allow small businesses more leeway to group together when providing or purchasing insurance, increase the availability and duration of short-term health insurance plans and widen the use of Health Reimbursement Arrangements, which let employers reimburse employees for health expenses rather than provide insurance themselves.\nAnalysts expect it will increase the availability of cheaper, bare bones plans for the young and healthy and raise premiums for older and sicker Americans. On Twitter, Senator Chuck Schumer called it \"a spiteful act of vast pointless sabotage leveled at working families and the middle class in every corner of America.\"",
    "label": 3
}