{
    "index": 362,
    "text": "The Los Angeles City Council wants to know whether President Trump violated federal law by using the office of the presidency to enrich himself or his family.\nOn a 10-0 vote, the council on Friday passed a resolution asking Congress to investigate whether Trump violated the Constitution’s foreign emoluments clause or committed any other high crimes and misdemeanors that could lead to impeachment.\nThe clause is designed to ensure that presidents aren’t influenced by gifts or aid from a foreign government.\nThe resolution was authored by Councilman Bob Blumenfield, who represents the western San Fernando Valley.\n“It’s putting the city of L.A. on record to investigate Trump,” said Blumenfield spokesman Jake Flynn. He acknowledged that the resolution has no legal weight.\nAdvertisement\nFlynn said Trump’s relationship with Philippines President Rodrigo Duterte should be investigated in light of a new 57-story Trump Tower in Manila that is set to open soon.\nThe Philippines president’s deadly tactics against suspected drug dealers have been widely criticized by human rights groups.\nBlumenfield’s office worked on the resolution with West Valley Resistance, a group that supports investigating Trump for possible impeachable offenses.\nSimilar resolutions have been passed in Richmond, Alameda and Berkeley, Calif., as well as Cambridge, Mass., and other cities and towns, according to the group.\nCouncilman Mitch Englander, the only Republican on the City Council, was absent during Friday’s vote. Also missing were Councilmen Jose Huizar, Paul Koretz and Joe Buscaino.\nEnglander explained in a statement that he purposely missed the vote.\n“I walked out because I did not feel that voting to impeach a president was under the purview of the Los Angeles City Council,” he said. “We should be focusing on public safety, fixing our roads and cleaning up our neighborhoods.”\n@dakotacdsmith\ndakota.smith@latimes.com\nUPDATE:\n2:35 p.m.: This article was updated with additional comments from Flynn and information about the absent councilmen.\nThis article was originally published on May 5 at :15 p.m..\nUPDATES:\n2:55 p.m.: This article was updated with a comment from Councilman Mitch Englander and additional background.\nThis article was originally published at 12:35 p.m.",
    "label": 3
}