{
    "index": 701,
    "text": "NEW You can now listen to Fox News articles!\nA Moscow-based think tank controlled by a Russian official appointed by President Vladimir Putin reportedly hatched a plan to increase Donald Trump’s chances to win the presidency.\nReuters, citing three current and four former U.S. officials, reported Wednesday that the Russian Institute for Strategic Studies provided a framework for top Russian officials on how to sway the U.S. election. Five officials told Reuters the institute is the Kremlin’s in-house foreign policy think tank.\nThe report said the think tank produced two documents. The first was released to the upper reaches of the Russian government, the report said.\nThe document reportedly said the Kremlin should launch a propaganda campaign on social media and Russian-backed news that stressed the point that the smart choice for president would be a candidate with a softer approach to Moscow.\nThe classified document called for state-backed news outlets to get the message out, the report said.\nThe think tank’s opinion on the approach apparently shifted by October, when Hillary Clinton appeared to be gaining distance on Trump. The second document said it would be best to increase its message on voter fraud and to attack Clinton’s reputation.\nThese documents were acquired by U.S. intelligence officials and were the basis of what led U.S. officials to blame Russia for meddling, the report said. The sources declined to comment on how the documents were obtained. Reuters reported that U.S. intelligence agencies also declined to comment on them. The report was not independently confirmed by Fox News.\nThe think tank said in a statement to The Tass Russian News Agency that the report is incorrect.\n\"Unfortunately, the number of slanderous remarks against Russia has been growing recently but those making such remarks wrongly perceive the world,\" the center said.\nPutin has denied any interference in the U.S. election, and Trump said the Kremlin’s activities did not play a role in the election outcome. There is no evidence thus far that Trump or his associates knew about Russia’s effort during the campaign. The FBI and lawmakers are investigating.\nTrump recently said that U.S.-Russia relations \"may be at an all-time low,\" and that \"right now we're not getting along with Russia at all.\"\nThe comment underscored long-standing difficulties that have plagued the two nations' attempts at greater understanding since the days of their World War II alliance. The Cold War may be over, but from Eastern Europe to the Middle East, Washington and Moscow don't see the world the same way.\nThe Associated Press contributed to this report",
    "label": 2
}