{
    "index": 2,
    "text": "For the first time since 1981, the president will not be attending the dinner.\n— -- President Donald Trump is skipping the White House Correspondents' Association Dinner, marking the first time since 1981 that a sitting president is not attending the dinner, which is hosted by the White House Correspondents Association.\nThe dinner is an evening to celebrate the First Amendment and freedom of the press to hold power to account in Washington, D.C. Though in recent years the dinner has featured a plethora of A-list celebrities, this year's event is shaping up to be more subdued, with journalism in the spotlight.\nBack in February, Trump announced on Twitter his decision not to attend the dinner, one week after he labeled the media “enemy of the American People” and “fake news.” During the campaign, he regularly attacked and berated individual reporters who he thought gave him unfavorable coverage.\n\"Please wish everyone well and have a great evening!\" the commander-in-chief wrote in announcing his decision to skip the event.\nThe dinner falls on Trump’s 100th day in office. Instead of dressing up with the White House press corps and schmoozing with Washington insiders, the president will be holding a “big” rally in Pennsylvania for supporters.\nBefore his life in politics, Trump did attend the dinner in 2011, where then-President Barack Obama roasted Trump.\nDonald Trump talks with other guests at the White House Correspondents' Association (WHCA) dinner in Washington, April 30, 2011. Joshua Roberts/Bloomberg via Getty Images\nIn an interview with PBS's \"Frontline,\" White House adviser Omarosa Manigault pointed to that night as what essentially drove Trump to run for president.\nIn a February interview with Fox News, Trump fondly recalled that he “loved that evening” and “had a great time.”\nWhite House deputy press secretary Sarah Huckabee Sanders told ABC News in a February interview that Trump isn't a “president that was elected to spend his time with reporters and celebrities.”\nShe also shed some light on why Trump declined the invitation to attend.\n“I think it's kind of naive of us to think that we can all walk into a room for a couple of hours and pretend that some of that tension isn't there,” Sanders said of the press and the president.\n“You know, one of the things we say in the south if a Girl Scout egged your house, would you buy cookies from her? I think that this is a pretty similar scenario. There's no reason for him to go in and sit and pretend like this is going to be just another Saturday night.”\nSanders added, “I think he'll spend the night focused on what he can do to help better America.”\nA usual highlight of the night is when the president delivers a joke-filled speech, followed by the keynote roast by a famous comedian. Without Trump tonight, comedian Hasan Minhaj, a senior correspondent for Comedy Central’s “The Daily Show With Trevor Noah,” will be left alone to provide the night’s comedic relief.\n“Hasan’s smarts, big heart and passion for press freedom make him the perfect fit for our event, which will be focused on the First Amendment and the importance of a robust and independent media,\" WHCA president and White House correspondent for Reuters Jeff Mason said in a statement.\nJournalism icons Bob Woodward and Carl Bernstein are also slated to speak and present awards.\nAs for next year’s soiree, Trump promises he won’t miss it.\n\"I would come next year, absolutely,\" he told Reuters in a recent interview.\nABC News' Devin Dwyer contributed to this report.",
    "label": 2
}