{
    "index": 42,
    "text": "The margin is expected to be razor-thin.\n— -- The House of Representatives will vote Thursday on the Republican-backed health care bill.\nHouse Majority Leader Kevin McCarthy, R-California, told reporters Wednesday that he expects the vote on passage to occur between 12:30 p.m. and 1:30 p.m.\n\"We're going to pass it!\" McCarthy said. \"Let's be optimistic about life.\"\nRepublican leaders and the White House spent the day Wednesday hunting for votes and are believed to be within striking distance of passing the measure.\nThe margin is expected to be razor-thin. According to McCarthy, the House Rules Committee will meet this evening to set the parameters of debate on the floor.\nOpponents of the bill are already attacking Republicans for scheduling a vote before the nonpartisan Congressional Budget Office has analyzed the amended bill.\nThe CBO score would project the effects of the bill -- the changes in the number of insured and premiums, and its impact on the federal deficit.\n“Forcing a vote without a CBO score shows that Republicans are terrified of the public learning the full consequences of their plan to push Americans with pre-existing conditions into the cold,\" House Minority Leader Nancy Pelosi, D-California, said in a statement. \"But tomorrow, House Republicans are going to tattoo this moral monstrosity to their foreheads, and the American people will hold them accountable.”\nThe CBO's most recent analysis of the of the American Health Care Act projected that 24 million more people would be uninsured by 2026 -- with 14 million more uninsured in the first year, compared to Obamacare.\nUnder budgetary rules, the Senate cannot take up the health care bill without receiving a CBO score, meaning the estimated impact of the measure will be known before the Senate considers it.\nIn addition to the American Health Care Act, the House will also consider H.R. 2192, companion legislation to make a technical fix preventing members of Congress and staff from exempting themselves from the AHCA.\nHouse Republicans are scheduled to hold an all-member conference meeting Thursday morning.",
    "label": 3
}