{
    "index": 330,
    "text": "President Trump says he’d be “honored” to meet the North Korean despot Kim Jong Un. Egypt’s president, who allowed his opponents to be shot, is doing a “fantastic job.”\nThe president of the Philippines, who unleashed vigilante killings at home, is welcome at the White House. So is Thailand’s prime minister, who took power in a military coup. And Turkey’s president, who jailed thousands of opponents, got a congratulatory call.\nThis is not business as usual for U.S. presidents.\nTrump’s advisors portray his public praise for foreign dictators and his willingness to meet with ruthless autocrats, without preconditions in most cases, as a way to shore up shaky alliances and possibly unlock long-frozen conflicts in the Middle East and across Asia.\nTrump, they say, believes he can use his personal charm and negotiating skills to forge ties to despots ostracized by previous presidents, and thus bring them to his way of thinking.\nCritics say that outreach threatens to disrupt America’s long-standing strategic partnerships, undermines the credibility of U.S. democratic values overseas and emboldens autocrats who use bloody measures at home to suppress dissent.\nAdvertisement\nTrump spoke Tuesday with Russian President Vladimir Putin, their third phone call since the November election and their first since U.S. warships launched cruise missiles at a Syrian air base on April 7 to punish Russia’s major Middle East ally, Syrian President Bashar Assad, for a nerve gas attack that killed dozens of civilians.\nIn a statement, the White House described the conversation as “a very good one,” saying Trump and Putin discussed the war in Syria, including creation of safe zones and the “best way to resolve the very dangerous situation in North Korea.”\nSecretary of State Rex Tillerson told reporters at the State Department that it was a “very, very fulsome call, a lot of detailed exchanges.”\nTrump no longer publicly praises Putin as often or as effusively as he did during the campaign, but nor does he criticize him. U.S. intelligence agencies see Putin as a major adversary who has tried to undermine U.S. relationships in Europe and interfered in the 2016 election to help Trump win.\nOther presidents have bucked foreign policy orthodoxy to reach out to adversaries. In perhaps the most famous case, President Nixon set aside the GOP’s anti-communist policies to make his historic overture to China in 1972, leading to a tectonic shift in the Cold War.\nPresident Obama was criticized as naive and worse by Republicans and by his chief Democratic rival at the time, Hillary Clinton, after he was asked at a debate in 2007 whether he would be willing to meet separately, without condition, with the leaders of Iran, Syria, Venezuela, Cuba and North Korea.\n“I would,” Obama said at the time. “And the reason is this, that the notion that somehow not talking to countries is punishment to them — which has been the guiding diplomatic principle of [the Bush] administration — is ridiculous.”\nDuring his second term, the Obama administration signed a landmark deal with Iran to curb its nuclear development in exchange for easing sanctions and restored diplomatic relations with the communist government in Cuba, ending a freeze that began in 1961.\nBut those were methodically planned and slowly plotted moves that followed years of secret and public diplomacy. The speed and enthusiasm that Trump has shown in his effort to connect with renegade leaders is unusual.\nChristopher Ruddy, chief executive of Newsmax, a conservative media group, and longtime friend of Trump, said the president’s outreach abroad is part of a strategy.\n“I think he wants to build bridges,” Ruddy said. “He sees that if he can open up the door by praising someone or finding something to compliment, even a guy that might be considered a bad guy, he sees that as a step in the right direction.”\nBut does Trump really admire Putin, Kim and other autocratic leaders?\nWhat the president is signaling is that there is always an opportunity to talk, but that is very far from saying there are no preconditions. — James Carafano, fellow at the conservative Heritage Foundation\n“I wouldn’t use the word ‘admires,’” Ruddy said. “I think he respects people who are considered strong or people that have very high approval in their countries. That’s important for him.”\nThe White House already cites evidence that its strategy has paid off.\nAfter Trump met with Egyptian President Abdel Fattah Sisi, for example, Cairo released Aya Hijazi, an Egyptian American aid worker who had been jailed for three years amid Sisi’s crackdown on civil society.\nThe Obama administration, which had kept Sisi at arm’s length, had pressed unsuccessfully for her release.\nAs often with Trump, his comments sometimes have veered wildly, keeping his adversaries — and much of Washington — off balance.\nLast week, for example, Trump warned darkly of the possibility of a “major, major conflict” with North Korea in the standoff over its nuclear and ballistic missile programs.\nOn Sunday, however, Trump praised Kim as “a pretty smart cookie” for having survived a power struggle, and a day later said he would be “honored” to meet Kim “under the right circumstances.”\nNo U.S. president has ever met one of North Korea’s dynastic dictators. White House aides later downplayed the likelihood that Trump would be the first, at least under current circumstances.\nTrump’s offer to meet such notorious leaders reflects his negotiating style, which says that “you never close off the opportunity to do a deal,” said James Carafano, a fellow at the conservative Heritage Foundation who has briefed the president and his team on foreign policy.\n“What the president is signaling is that there is always an opportunity to talk, but that is very far from saying there are no preconditions,” Carafano said. “You’re always offering [the other leader] an offramp: ‘Change your behavior and meet my preconditions.’ ”\nTrump’s National Security Council recently completed a policy review on North Korea and recommended a carrot-and-stick combination of increased pressure and greater engagement.\nJim Walsh, a security policy expert at MIT, said an open channel of communication with North Korea could help prevent war. But he warned that Trump’s seesawing statements also could be misunderstood in Pyongyang.\n“Because you can get to war through miscalculation, misperception,” he said. “Frankly, the last several weeks we’ve heard a lot of bluffing, a lot of changing positions.”\nSen. John McCain (R-Ariz.), chairman of the Senate Armed Services Committee, said Trump’s comments were disturbing.\n“I don’t understand it and I don’t think that the president appreciates the fact that when he says things like that it helps the credibility and the prestige of this really outrageous strongman,” McCain said.\nWhite House Press Secretary Sean Spicer said Monday that Trump understands the threat North Korea poses.\n“There is a diplomatic piece to this,” Spicer said. “The bottom line is the president is going to do what he has to do.”\nSpicer also defended Trump’s invitation to Philippine President Rodrigo Duterte to visit Washington. Human rights groups say Duterte has either encouraged or condoned a brutal campaign of extrajudicial killings that has left more than 7,000 alleged drug users dead since he took office last year.\nSpicer said the White House was aware of the killings but said Trump sees an opportunity “to work with countries … that can help play a role in diplomatically and economically isolating North Korea.”\nThe Philippines has no political or economic ties with Pyongyang, so its ostensible role in a containment strategy is unclear. Duterte, for his part, told reporters he might be too busy to visit Washington.\nObama canceled a meeting with Duterte on the sidelines of an overseas summit last year after the Philippine leader offered a coarse insult when asked his response to U.S. concerns about the drug crackdown. Duterte has since threatened to cancel a mutual defense treaty and other ties.\nBut U.S. officials are concerned that he has reached out to China and Russia for support, and the White House is eager to improve relations with the leader of the longtime U.S. ally to help counter growing Chinese influence in Southeast Asia.\nStaff writers Noah Bierman and Michael A. Memoli contributed to this report.\nTwitter: @ByBrianBennett\nbrian.bennett@latimes.com\nALSO\nClinton blames the FBI, Russia, WikiLeaks and also herself for 2016 loss\nTrump talks of possible shutdown next time as Democrats claim victory in spending fight\nObamacare 101: Will sick Americans still be able to get insurance under the House Republican bill?",
    "label": 3
}