{
    "index": 101,
    "text": "Since President Donald Trump took office in January, the average number of Twitter users engaging with his tweets -- liking, retweeting or replying to his 140-character bursts -- has dropped by about two-thirds, according to a new study from digital agency Huge Inc.\nAt the beginning of the administration, an average tweet from the president generated roughly 206,000 engagements. Now, his average tweet generates only about 71,000 engagements – a drop of 66 percent during Mr. Trump's first 100 days.\nEngagement with the president's tweets began steadily dropping about three weeks into his presidency. Since then, engagement has been on a slow but steady decline, even as the president's total number of followers has increased by roughly 40 percent.\nThe study classified tweets according to a number of characteristics like time of publication, cadence, and voice. The study's authors then compared similar tweets across time. The president's tweetstorm on the morning of January 30 about a judge blocking his administration's travel ban, for example, was compared with a tweetstorm the morning of April 27 about border security and government funding.\nThe study observed a distinction between some of the more \"agitated\" tweets Trump sent -- those with a more strident tone, lots of capitalization and exclamation marks -- and tweets that were more likely \"prepared\" by his staff, incorporating more social media conventions like hashtags and emojis.\nThe authors found that the number of \"prepared\" tweets has steadily risen. At the outset of his administration, they comprised only 15 percent of his overall feed. Now, they account for 27 percent of his Twitter output.\nThe study suggested the increased frequency of \"prepared\" tweets from @realDonaldTrump may be undermining his viral reach. \"In social media, nothing alienates a core audience faster than an inauthentic voice,\" the authors wrote. \"Watering down the president's Twitter account with static and predictable prepared tweets has chipped away at its authenticity, giving its fans and followers license to look away.\"\nThe authors added, however, that an overall decrease in the frequency of Mr. Trump's tweets might explain some of the drop in engagement: \"Early in his term, Trump sent out more than 40 tweets per week, very close to the frequency on his account in the weeks leading up to the inauguration. However, after a month in office, his activity quieted somewhat, which would naturally contribute to fewer total engagements.\"\nIn other news on the president's social media presence, Twitter crunched some numbers this week to generate a list of the president's most frequently used words, hashtags, and user handles on the platform during his first 100 days in office. Below are the results.\nMost-tweeted words\nGreat\nAmerica/American\nNews/Media\nJobs\nToday\nFake News\nThank\nPeople\nBig\nCountry\nMost-tweeted handles\n@Whitehouse\n@NYTimes & @foxandfriends (tie)\n@FoxNews\n@VP\n@CNN & @ POTUS (tie)\nMost-tweeted Hashtags\n#MAGA\n#AmericaFirst\n#ICYMI\n#USA\n#Obamacare\nMake sure you tune into \"Face the Nation\" this Sunday for the first part of John Dickerson's interview with President Trump, taping at the White House and in Harrisburg, Pennsylvania, on Saturday, April 29th, Mr. Trump's 100th day in office. More of the interview will air in a live broadcast of \"CBS This Morning\" from the East Room of the White House on Monday, May 1.",
    "label": 3
}