{
    "index": 29,
    "text": "Flint residents Lisa Millard, left, Teresa Farley, and Holland resident Lisa Leggio all chant in unison with nearly 100 others protesters, demanding answers and solutions to the city's water crisis woes on the three-anniversary of the initial water switch, on April 25, 2017, outside of City Hall in Flint, Mich.\nFlint residents Lisa Millard, left, Teresa Farley, and Holland resident Lisa Leggio all chant in unison with nearly 100 others protesters, demanding answers and solutions to the city's water crisis woes on the three-anniversary of the initial water switch, on April 25, 2017, outside of City Hall in Flint, Mich.\nFlint residents Lisa Millard, left, Teresa Farley, and Holland resident Lisa Leggio all chant in unison with nearly 100 others protesters, demanding answers and solutions to the city's water crisis woes on the three-anniversary of the initial water switch, on April 25, 2017, outside of City Hall in Flint, Mich.\nFlint residents Lisa Millard, left, Teresa Farley, and Holland resident Lisa Leggio all chant in unison with nearly 100 others protesters, demanding answers and solutions to the city's water crisis woes on the three-anniversary of the initial water switch, on April 25, 2017, outside of City Hall in Flint, Mich.\n— -- In 2015, more than 76 million Americans were served by community water systems that had some reported drinking water violations, including more than 18 million people receiving water with too much lead and copper, according to new report released today by the environmental advocacy group Natural Resources Defense Council.\nThe report highlights different groups of contaminants reported in public drinking water and the increased risks for the strained and aging systems of smaller communities, just as proposed cuts to drinking water programs loom at the Environmental Protection Agency.\n\"There’s a two-tiered drinking water system in this nation and rural America is most at risk from the inequality,\" said Mae Wu, Senior Attorney with NRDC’s Health program. \"Small systems have the highest percentage of water violations, and it’s largely due to financial and technical capacity issues that will only get worse when the EPA cuts drinking water programs.\"\nThe NRDC's analysis of public reports found contaminants, including lead, copper, arsenic and dangerous bacteria, pose a widespread threat to U.S. public drinking water supplies and, potentially, public health.\nThe analysis included data from 2015 EPA reports, specifically public lists of violations and water issues from cities across the country.\nAccording to their study, almost two million Americans in 2015 lived in communities with water systems that had broken rules about arsenic levels, for example.\nSmaller communities and water systems reaching fewer than 500 people \"accounted for nearly 70 percent of all violations and a little over half of all health-based violations,\" the report says.\nMarc Edwards, a civil engineer and professor at Virginia Tech, researches drinking water and infrastructure issues in the U.S. He said the eye-popping numbers of contaminated water systems listed in the NRDC’s report did not surprise him.\n\"It verifies concerns that we have been expressing for the last 10 years, which is that these rural American cities are just not able to fund their water infrastructure needs and they cannot afford to upgrade their systems, nor can they afford to meet existing federal law,\" he told ABC News.\nHe said his research team, which played a major role working on the Flint, Michigan water crisis, was inundated with calls from people in rural America looking for help.\n\"They are really on their own. You can’t really trust that the existing law is being enforced,\" he added. \"People are being told their water is safe when it is not. It is like being in a third-world country, while living in a first-world country.\"\nThe NRDC report calls for the federal government to triple funding for water infrastructure improvements, which it says would not only help protect the safety of drinking water, but also create jobs. In addition, the organization is advocating for better methods to detect water issues and tougher enforcement of water safety violations.\nThe Safe Water Drinking Act passed in 1974 gives the EPA the authority to establish minimum health standards and protect tap water. Environmental and health advocacy groups have long argued that not only does the EPA fall short of enforcing existing regulations, they say the agency needs to write additional regulations for new toxic chemicals, metals and bacteria.\nAccording to EPA data, the NRDC report says, the agency and states took formal enforcement action against just 13.1 percent of safe drinking water violations in 2015. Health-based violations brought a higher rate of formal enforcement actions -- 21.2 percent.\n\"Under new leadership, EPA has made clear it is getting back to its core mission, which includes protecting America’s drinking water,\" an EPA spokesperson said in a statement to ABC News. \"Unfortunately, this is an area in which the past administration failed, as we saw the devastating consequences of Flint, Michigan and East Chicago, Indiana. Administrator Pruitt is committed to helping modernize our country’s outdated water infrastructure in order to ensure we maintain safe drinking water for the more than 300 million people that depend on it daily.”\nThe White House and Congressional Republicans are currently advocating for legislation that would limit the EPA's ability to write new drinking water standards.\nThe budget proposed by the White House for next year could further limit the EPA’s ability to enforce safe water rules, as it recommends a significant -- nearly 30 percent -- cut to the agency’s programs.",
    "label": 2
}