{
    "index": 455,
    "text": "Trump wasn't actually endorsing Australia's universal health care, White House says\nShow Caption Hide Caption WH: Australian health plan good for Australians Asked about President Donald Trump's comments regarding Australia's health care system, Principal Deputy Press Secretary Sarah Sanders said that Trump was complimenting a foreign leader. (May 5) AP\nWASHINGTON – President Trump wasn’t actually endorsing Australia’s government-funded health care system as a model for the United States when he called it \"better health care,” White House spokeswoman Sarah Sanders clarified on Friday.\n“What works in Australia may not work in the United States,” Sanders told reporters. “He was complimenting the prime minister and we’re focused on putting a health care plan in place that works here.”\nTrump met with Australian Prime Minister Malcolm Turnbull Thursday hours after the House passed a bill to repeal and replace parts of the Affordable Care Act.\n\"It's going to be fantastic health care,\" Trump said. \"I shouldn't say this to our great gentleman and my friend from Australia because you have better health care than we do.\"\nAfter the briefing, Trump added his own explanation via Twitter of his praise for Australia's universal health care.\nOf course the Australians have better healthcare than we do --everybody does. ObamaCare is dead! But our healthcare will soon be great. — Donald J. Trump (@realDonaldTrump) May 5, 2017\nThe nonpartisan Congressional Budget Office estimated an earlier version of the bill would result in 24 million fewer people having insurance. The House voted on a revised version, which would allow states to waive a requirement that insurance companies charge sick people the same rates as healthy ones, before the CBO could estimate its impact on people's access to care, effect on premiums, and overall cost to taxpayers.\n“That’s not something that’s held us back,” Sanders said of the strategy to move forward without an updated assessment. “I think I know the Gospel pretty well and I’d say the CBO is not the Gospel. They’ve been wrong before and they can certainly be wrong again.\"\nAs the bill moves through the Senate, Sanders said the White House expects changes, but the “main pillars” of the bill to remain the same. Those include, she said, lowering costs, creating competition and giving states flexibility to make their own decisions.\nThe CBO estimated that premiums would first rise then eventually fall under the original GOP bill, in part because insurers could offer skimpier plans. Premium changes would vary by age with costs going down for younger customers and up for older ones.\nAsked if Trump will guarantee that sicker and older people won’t face higher costs, Sanders said, \"That’s the whole point of this bill, is to lower costs across the board... That would be the goal and, certainly, the priority of the president.\"\nAs Trump put it in his weekly address, \"It will be great healthcare, and your premiums will come down, and your deductibles will come down. So you’ll have better healthcare at a lower cost.\"",
    "label": 3
}