{
    "index": 21,
    "text": "— -- Two Republican holdouts on the House GOP health care plan say they have a compromise plan that may unite the splintered caucus around a bill to repeal and replace Obamacare.\nReps. Billy Long, R-Mo., and Fred Upton, R-Mich., are proposing an amendment to add $8 billion over five years to help subsidize high-risk insurance pools in states that opt out of Affordable Care Act rules in a way that could allow insurers to raise rates on people with pre-existing conditions.\nHealth insurance coverage for people with pre-existing conditions has been the main sticking point during extended negotiations among Republicans.\nConservative Republicans have insisted on a proposal that would allow states to receive a waiver for Obamacare's protections for people with pre-existing conditions and instead create a separate high-risk pool. Some moderate Republicans, like Upton, insist that the plan have protections similar to those provided by the ACA.\n\"I support the bill with this amendment. We'll consider it, likely tomorrow,\" Upton said. \"I sat down at length with [Rep. Greg] Walden and [Rep. Michael] Burgess earlier this week, Monday, and we talked about how we could add protections for those with pre-existing conditions.\"\nWalden, who chairs the committee that drafted the replacement legislation, says the latest tweaks have been \"embraced by all sides and endorsed by the president,\" who has gotten personally involved in the negotiations.\nUpton said he expects the House Rules Committee to act on the amendment Thursday, paving the way for a vote as soon as then.\nThree aides for members of the conservative House Freedom Caucus told ABC News today that the amendment would not put the caucus's support of the bill as a whole at risk. Still, an ABC News whip count shows Republicans are on the brink of losing too many votes to pass their health care overhaul bill.\nA previous attempt to repeal Obamacare failed in late March, when House Republicans could not come to a consensus on a replacement plan. Nineteen Republicans oppose the latest plan, and more than a dozen are undecided. Twenty-two Republican \"no\" votes would kill the bill.\nDemocratic leaders have blasted the GOP plan and Upton's amendment, with House Minority Leader Nancy Pelosi of California saying that \"no Band-Aid amendment will fix\" the bill.\nThe latest developments come after Trump spoke to 15 GOP House members Tuesday who said they are opposed to the bill or are undecided, according to a senior White House official involved in the effort.\nLong described his two 15-to-20-minute calls with Trump, trying to explain to the president repeatedly why he couldn't support the bill without a fix. \"They need to be covered. Period,\" he said he told the president, referring to people with pre-existing conditions.\nUpton said he read back to Trump verbatim the promise he made publicly on protections for people with pre-existing conditions. \"I read him back his statement,\" Upton said. \"I want him to keep that pledge.\"\nOffice of Management and Budget Director Mick Mulvaney said he expects a vote on health care \"as early as Saturday.\" House Majority Leader Kevin McCarthy of California said a vote on health care could come \"soon,\" and House Speaker Paul Ryan of Wisconsin said Tuesday that House GOP leaders are \"making very good progress with our members, and our president has been instrumental in that.\"\nThe White House still hopes the bill will pass this week, although a senior official acknowledged that it is close and that if it passes, it will be by a \"razor thin\" margin. House Republicans have two days left to put the bill to a vote before an 11-day recess.",
    "label": 3
}