{
    "index": 320,
    "text": "One potential obstacle in the negotiations to prevent a government shutdown was averted Wednesday when the White House announced it would continue — at least for now — to provide critical funding for the Affordable Care Act.\nPresident Trump had once threatened to withhold money that helps many low-income Americans cover their deductibles and copayments, potentially cutting off the so-called cost-sharing reduction payments to insurers for as many as 7 million people who depend on the federal aid.\nThe funding, totaling about $7 billion this year, soon became a bargaining chip in the current talks over a must-pass spending bill to prevent a government shutdown before a midnight Friday deadline. Democrats seized on Trump’s threat to end the payments as a way to negotiate with Republicans who wanted extra funding for military programs or the border wall with Mexico.\nOn Wednesday, House Speaker Paul D. Ryan (R-Wis.) announced the money would not be included in the spending bill. Later the White House signaled it would continue to provide the payments administratively rather than through Congress.\nIt was the second time this week that the administration backed off its demands. Trump also gave up on his pursuit of including funding for his promised border wall in the spending bill.\nAdvertisement\n“We’ve now made progress on both of these fronts,” said House Minority Leader Nancy Pelosi (D-San Francisco).\nThough the Affordable Care Act payments have been removed from the debate, several other issues remain, including abortion restrictions and money to prop up a pension fund for coal miners.\nCongress will probably need to pass a stopgap measure Friday to fund the government for another week while talks continue.\nObamacare, meanwhile, continues to come under attack by Republicans seeking to revive their faltering effort to repeal and replace the healthcare law.\nThat process gained momentum Wednesday when the conservative House Freedom Caucus — which helped sink the previous GOP plan — threw its backing behind a new amendment designed to win their votes.\nThe measure would allow states to get rid of some of Obamacare’s most popular mandates, including the ban on higher insurance costs for those with preexisting medical conditions.\nIt could be tacked onto the original bill, the American Health Care Act, which has already been projected to result in 24 million fewer Americans with health coverage over the next decade, according to an independent analysis by the Congressional Budget Office.\nUnder the amendment, states could apply for waivers, for example, to once again allow insurers to charge sick consumers more than healthy ones and could lift requirements that all health plans cover a basic set of benefits, such as mental health and maternity care.\nThe proposal was the result of extensive negotiations between the chairman of the caucus, Rep. Mark Meadows (R-N.C.), and Rep. Tom MacArthur of New Jersey, representing Republican moderates. Those two factions of the House majority, for different reasons, opposed the GOP’s previous effort to dismantle the Affordable Care Act.\n“While the revised version still does not fully repeal Obamacare, we are prepared to support it to keep our promise to the American people to lower healthcare costs,” the Freedom Caucus members said in a statement.\nWhile supporters say the new approach would lower insurance premiums, it has drawn intense criticism from many healthcare and patient advocacy groups, which are concerned that it would eviscerate key protections put in place by Obamacare.\nEven with the changes, there is still no guarantee the Republicans will find enough votes to pass the bill.\nMany centrist Republican lawmakers remain deeply concerned that it threatens health coverage for millions of vulnerable Americans.\n“We have to help those people who were harmed by the Affordable Care Act without harming the people who were helped by it,” said Rep. Daniel Donovan (R-N.Y.), who panned the previous effort and said lawmakers still had questions after MacArthur made a presentation during a morning meeting of House Republicans.\n“Did everyone get up and cheer? No. Did everyone go, ‘Oh, boo, hiss’? No,” he said.\nThe spending package would fund government operations through the remainder of the 2017 fiscal year, Sept. 30, and aims to beef up defense spending by about $15 billion.\nWhile Trump may succeed in boosting defense accounts, some of his other priorities have fallen flat.\nTrump wanted $3 billion for border security — including at least $1 billion for the border wall that he has insisted Mexico will one day reimburse. But lawmakers sharply rejected the wall funds, and are now haggling over how much to spend on detentions and other border security measures.\nMeanwhile, retired coal miners are looking to Trump to salvage a pension fund that will probably be forced to cut off benefits if the government does not intervene.\nThe White House has said it wants to help the miners, but lawmakers are divided over how long to provide the assistance for the health and pension fund. Senators from both parties want to extend it for the long-term, but House Republicans are balking at the price tag. Lawmakers also have concerns about dipping into an abandoned mine reclamation fund to help pay for it.\nAides said talks are likely to continue into next week.\nlisa.mascaro@latimes.com\n@LisaMascaro\nALSO\nTrump wants a border wall, but few in Congress want to pay for it\nObamacare 101 — What’s the big debate over health insurance cost-sharing subsidies\nQ&A: Filibuster, cloture and what the ‘nuclear option’ means for Gorsuch nomination and future of the Senate\nWhat we learned about Neil Gorsuch during his Supreme Court confirmation hearing\nGorsuch set to be confirmed to the Supreme Court, but will the fight over Trump’s pick break the Senate?\nMore coverage of Congress\nMore coverage of politics and the White House",
    "label": 3
}