{
    "index": 359,
    "text": "Anxiety was high Friday in state, county and city offices after hackers released lists of dozens of government email addresses in California that were used to access the Ashley Madison online dating site for married people.\nLos Angeles County officials launched an investigation after 19 county email addresses were found on the list. Officials in Sacramento warned state workers of possible consequences after nearly 50 state government email addresses were also included.\n“Any misuse of state resources is a concern and is taken seriously and investigated accordingly,” said Lynda Gledhill, a spokeswoman for the state Government Operations Agency.\nThe website, whose advertising line is, “Life is short. Have an affair,” was hacked by a group called Impact Team. Earlier this week, it exposed the names, email addresses, credit card numbers and sexual preferences of up to 37 million users of the site.\nInterested in the stories shaping California? Sign up for the free Essential California newsletter >>\nAdvertisement\nNearly 100 of the email addresses had the extension cal.gov, which is used by state agencies and some cities and other government agencies. A Times review found that many of the email addresses were not valid, but many others were working addresses attached to real government employees.\nExperts cautioned that some users of the free Ashley Madison site may have done so with other people’s email addresses; the website did not require verification.\nLos Angeles County and the Los Angeles County Metropolitan Transportation Authority have begun separate reviews of whether any of their employees used government emails to access the site, officials said Friday.\nThe database released by the hackers contained dozens of city, county and other local government email addresses, although it was not clear how many government employees had actually used work emails to log onto the site.\nThe hacked data included 19 Los Angeles County-associated emails and 27 Los Angeles city emails — including Los Angeles Police Department addresses. It also included addresses associated with the Los Angeles Unified School District and the Metropolitan Transportation Authority.\nNEWSLETTER: Get the day’s top headlines from Times Editor Davan Maharaj >>\n“Work email is created and set up and funded by the employer — in this case, the government — and it’s inappropriate to use government email for personal purposes,” said Jessica Levinson, a law professor and member of the city ethics commission.\nLos Angeles County spokesman Joel Sappell said interim Chief Executive Officer Sachi Hamai had referred the matter to the county’s auditor-controller for investigation. He declined to comment further.\nEmail addresses on the list included those for employees of the state departments of Transportation, General Services, Public Health, Corrections and Rehabilitation, Industrial Relations and Water Resources, as well as the state judiciary.\nNo elected officials were on the list of government emails.\nGledhill said state tech workers routinely check for evidence that state emails are being improperly used, and some have been found in the past. She would not say whether the state had linked any government emails to Ashley Madison.\nSo far this year, state departments have been notified more than 100 times of possible misuse of email, she said.\nThe email addresses were a hot topic at the state Capitol on Friday, workers said.\nOne state employee whose email was on the list, and who spoke on condition of anonymity so as not to jeopardize his job, said he did not recall using the email to sign on to the Ashley Madison site.\nHe said he might have done so just to see what the site was about. He said he has not used its services.\n“I’m certainly not saying that there is no possibility that I created a profile. I just honestly don’t have a recollection of doing so,” the employee said.\nAnother state worker said he was worried about the appearance of his email address on the hackers’ list, but denied he ever paid for the website’s service.\n“I honestly can’t remember if I ever visited the site out of curiosity,” he said, adding, “I can’t say I am 100% sure I never went into the site via pop-ups.”\nPatrick.mcgreevy@latimes.com\nAbigail.sewell@latimes.com\nTwitter: @mcgreevy99, @sewella\nMcGreevy reported from Sacramento, Sewell from Los Angeles. Times staff writer Anthony Pesce in Los Angeles contributed to this report.\nALSO:\nJosh Duggar calls himself ‘the biggest hypocrite,’ admits cheating on wife\nCalifornia state government, L.A. County emails linked to Ashley Madison site\nHacked infidelity website Ashley Madison offers free profile deletion",
    "label": 3
}