{
    "index": 303,
    "text": "Good news: The robots may not destroy us after all.\nA few weeks ago, I wrote a column that outlined the worries of big thinkers such as Stephen Hawking and Andrew Yang who are predicting a wave of job destruction caused by automation, robots and artificial intelligence.\nMichael Mandel begs to differ. Mandel is chief economic strategist at the Progressive Policy Institute. He and Bret Swanson, president of Entropy Economics LLC, just completed a study for the Tech CEO Council that foresees a rather bright economic future brought about by technological innovation.\nI recently interviewed Mandel and he made a compelling argument that the application of technology to the physical economy will, in time, produce more jobs, higher wages, greater productivity and all kinds of as-yet-unimagined business activity. The two doomsday narratives that are currently circulating — that robots will steal jobs and that productivity will lag more or less permanently — are as wrong as the 19th century fears that electrification would put people out of work, Mandel said.\n1 / 51 la-1491523602-y7ephyarj1-snap-image (David Horsey / Los Angeles Times) 2 / 51 la-1491368625-0bgh58ihw8-snap-image (David Horsey / Los Angeles Times) 3 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 4 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 5 / 51 Top of the Ticket cartoon (David Horsey / Los angeles Times) 6 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 7 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 8 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 9 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 10 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 11 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 12 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 13 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 14 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 15 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 16 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 17 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 18 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 19 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 20 / 51 Trump inspires millions to take to the streets -- to oppose him. (David Horsey / Los Angeles Times) 21 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 22 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 23 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 24 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 25 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 26 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 27 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 28 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 29 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 30 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 31 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 32 / 51 Cartoon caption contest winner at the DENT conference in Sun Valley, Idaho: Jon Duval, executive director of the Ketchum Community Development Corporation. (David Horsey / Los Angeles Times) 33 / 51 Old radicals and big media descend on Selma (David Horsey / Los Angeles Times) 34 / 51 Horsey imagined the creation of the Ann Coulter phenomenon in this cartoon from 2007. (David Horsey / Los Angeles Times) 35 / 51 This David Horsey drawing is a reconfiguration of a cartoon he first published in 2006. (David Horsey / Los Angeles Times) 36 / 51 Donald Sterling, owner of the L.A. Clippers, should give Cliven Bundy a call. After Sterling loses his NBA franchise and the deadbeat Nevada rancher loses his cattle, the two old racists will both need a buddy. Maybe they can team up together and open an all-white rodeo. (David Horsey / Los Angeles Times) 37 / 51 Besides sending a chill up the spine of the international community, Vladimir Putin has accomplished one other thing by seizing Crimea and threatening the rest of Ukraine: Putin has brought back the bear. (David Horsey / Los Angeles Times) 38 / 51 The right-wing insurrection at the Bundy ranch in Bunkerville, Nev., has taken another weird turn with new revelations about the family history of Cliven Bundy. (David Horsey / Los Angeles Times) 39 / 51 See full story» (David Horsey / Los Angeles Times) 40 / 51 See full story» (David Horsey / Los Angeles Times) 41 / 51 See full story» (David Horsey / Los Angeles Times) 42 / 51 See full story» (David Horsey / Los Angeles Times) 43 / 51 See full story» (David Horsey / Los Angeles Times) 44 / 51 See full story» (David Horsey / Los Angeles Times) 45 / 51 David Horsey / Los Angeles Times (David Horsey / Los Angeles Times) 46 / 51 See full story» (David Horsey / Los Angeles Times) 47 / 51 See full story» (David Horsey / Los Angeles Times) 48 / 51 See full story» (David Horsey / Los Angeles Times) 49 / 51 See full story» (David Horsey / Los Angeles Times) 50 / 51 See full story» (David Horsey / Los Angeles Times) 51 / 51 See full story» (David Horsey / Los Angeles Times)\nIn fact, Mandel suggested, we are on the edge of a technological transformation every bit as revolutionary as the advent of electricity. Already, a dynamic new digital economy has arisen (think Microsoft, Apple and Google). The next step is to apply information technology to industries that deal with physical things.\nAdvertisement\nMandel pointed out that this is already happening in two areas. The first is fracking. Technological innovations have enabled extraction companies to access heretofore unreachable energy reserves and, though this progress comes with a controversial environmental cost, there is no question fracking has created good-paying jobs and enhanced economic activity.\nThe second is e-commerce. Beyond the digital component, e-commerce is about getting physical products shipped and delivered and the result is jobs for a lot more folks than just those who write computer code. Mandel points to Kentucky, where the big rise in e-commerce employment is transforming the state’s economy. It is an early example, he said, that the blessings of technology are “breaking out of the digital ghetto of the coastal states.”\nWhat about the jobs that will be lost to technological change, such as the truck and taxi drivers who will be put out of work once autonomous vehicles take to the road? The transformed economy will create many new and more stable jobs, Mandel insisted. Disruption is unsettling, he agreed, but it is wrong to focus only on disruption and not on the large gains and unimagined opportunities that await in the new economy.\n“Dystopia does not have a historical precedent,” Mandel said. Instead, there are repeated examples of the reinvigorating power of new technology. During the first half of the 20th century, General Electric and General Motors became industrial giants offering high-wage employment thanks to innovations in technology and production methods. There may no longer have been jobs for whalers, blacksmiths and woodcutters, but most people were happy with the change.\nAmericans rightly perceive the period just after World War II as a time of prosperity and abundant employment when the country’s middle class was solidified, but Mandel pointed out that the 1950s economy was built on innovations that came in the decades before and was preceded by the Great Depression and a lot of postwar talk about stagnation. He believes we are now at the beginning of another cycle that will lead to dramatic economic growth. It won’t happen tomorrow, he said, and, in fact, it may take an additional 15 years.\n“The future will take longer to come than you expect, but then it will come in a rush,” Mandel said.\nMandel does not have nightmares about robots. Instead, he told me, “I wake up each day to see what we’ll be capable of tomorrow.”\nNot a bad way to start the day or to develop smart policies for the future.\nDavid.Horsey@latimes.com\nFollow me at @davidhorsey on Twitter\nTo read the article in Spanish, click here",
    "label": 2
}