{
    "index": 264,
    "text": "(CNN) France picks its new president Sunday. Emmanuel Macron, of the newly formed En Marche party, faces off with Marine Le Pen of the National Front. Macron, who led narrowly in the first vote on April 23, has been endorsed by former President Barack Obama. President Donald Trump has praised Le Pen's populism and views on immigration but has not endorsed her. I reached out to CNN Paris correspondent Melissa Bell for her perspective on today's vote and what it means for France -- and the United States. Our conversation, conducted via email and lightly edited for flow, is below.\nBell: A word on polls, first of all. The polling in France has proved much more accurate than the polling in either the British referendum or the US presidential election. French pollsters had explained to me in the run-up to the first round of voting that they did not believe they were likely to get caught out in the same way. They explained that France has long had a far right and a far left vote and that they are far more used to weighting their results than Anglo-Saxon pollsters.\nThe \"vote that dare not speak its name\" is something that they are better equipped to hear because they are more used to factoring it in. And so it proved. In the first round of voting on April 23, the pollsters were very close to the final result. There is no reason to think that this won't also be true in the second.\nThe concern has been that some external factor might come and disrupt the process ahead of the run-off. France's two-round system gives the French the luxury of voting with their hearts in the first round and their minds in the second. Or, as the French sometimes put it, of voting in favor of someone in the first and then against someone in the second. Which means that there has been little doubt in the minds of many people that even though Le Pen got through the first round, she would be less likely to get past the second.\nThe worry though has been of something like a big terrorist attack disrupting the period leading up to the second round vote and giving the advantage to the far right, which has put security and the fight against radical extremism at the heart of its campaign. In the end it appears to be another type of external event that is causing the disruption: the massive and carefully timed Macron leaks\nFrance is taking the leaks very seriously, threatening legal action against any who might try to share the contents of the leaked documents. The blackout period in which we find ourselves means that the French will not know what is in the leaked documents and, therefore, whether they are merely embarrassing or more damaging than that. And so they will go to the polls with this confusion hanging over them. Having said that, I do not believe that this could in any way allow a Le Pen victory. It might cause her score to be slightly above what it might have been but probably marginally.\nCillizza: Le Pen was all the buzz in the first vote. But it feels like there has been less interest in her since. Why?\nBell: The \"entre-deux-tours,\" which began on April 23 and ends tomorrow morning, really marked a new phase of the campaign. And one during which Le Pen was considered to have started strong. The first week following the first round really saw her dominate the headlines and the campaign. She made a number of television appearances in which she seemed more gracious and presidential than she had in the past. She seemed to have the upper hand and many people began to wonder if perhaps she had been underestimated.\nBut then the big \"entre-deux-tours\" debate put an end to that. Rather than continue what had appeared a winning strategy and looking to win the election rather than the debate, she went on the attack from the very first minute of the live broadcast, setting the tone for what became a brutal two-and-a-half-hour war of words between the two candidates. She came off far worse, weak on the economy and Europe, and generally out of her depth. From then on in, it all went downhill, with protesters turning up at her events and images of her fleeing dominating the headlines.\nCillizza: We hear a lot about terrorism and immigration as issues in the race. Are they the dominant ones French people are voting on? Or is there other stuff that we don't hear about in the states?\nBell: Immigration and terrorism have been put center stage by the far right and have, as result, been central. But Le Pen's message goes further than that; it is really that she wants to make France great again by making it French again. In a sense immigration and dealing with terrorism are just the first stage in what she seeks.\nShe has really ramped up the nationalist rhetoric of late. She¹s also adopted an economic program that is very left wing. She wants to beef up France¹s already-substantial welfare state, leave the European Union and introduce economically protectionist measures to help boost the economy. There is a lot of President Trump in what she sells. And she has regularly said that she believes that his victory merely foreshadowed her own.\nCillizza: If Macron wins, having started a totally new party, what does that tell us about the state of the French political system? What about if Le Pen wins?\nBell: It tells us several things. That the French were really ready for change because this is quite revolutionary. Macron wants to get rid of the party career politicians that have dominated French politics for decades and who tend to be recycled not for years but for decades. He wants to choose his ministers and the MPs that he will be putting forward in June¹s parliamentary elections from civil society. He has already redrawn France¹s political map by pushing out of the first round the two candidates of the parties that have shared power in France since 1958. In that perhaps France has managed where Britain and the US had failed: To find a progressive answer to the need for change and to stop the populist wave.\nIf Le Pen wins, it tells us that once again the anger of a part of the electorate that we have trouble hearing has proved far stronger than anyone had imagined. But this time with far more serious consequences since a French president has far more unchecked power in his (or her) hands on a national level than an American one. And the changes she is promising including the withdrawal from the Euro, could shake global markets for years to come.\nCillizza: Finish this sentence: \"If Macron wins, his relationship with President Trump will be ________.\" Now, explain.\nBell: \"Complicated.\" Emmanuel Macron represents all that Donald Trump is not. He represents the world order that Trump has kicked against: Consensus based on the idea of shared values rather than the single-minded pursuit of individual interests. He is pro-European and pro-globalization. He will represent a boost to the camp of world leaders who worry about populists and want them contained.",
    "label": 3
}