{
    "index": 201,
    "text": "(CNN) Within minutes of the start of James Comey's testimony in front of the Senate Judiciary Committee today , two things became very clear:\n1. None of the senators were particularly happy with Comey.\n2. Comey really couldn't care less.\nDemocrats -- led by ranking member Dianne Feinstein -- went at Comey's decision to send a letter to Congress on October 28, 2016 that signaled that the investigation into Hillary Clinton's email server had been re-opened after new emails had been discovered on a computer shared by Anthony Weiner and top Clinton aide Huma Abedin. They also bashed Comey over his decision to slam Clinton for poor judgment in his July announcement that no charges would be brought against her in the email investigation.\n\"Why didn't you just do the investigation as you would normally, with no public announcement?,\" asked Dianne Feinstein (Calif.), the highest ranking Democrat on the committee.\nRepublicans went slightly easier -- though not much -- on Comey, questioning whether any evidence existed that President Trump's campaign had colluded with Russia and questioning why Comey had concluded that neither Clinton, Abedin or anyone else in the the candidate's inner circle shouldn't be charged with mishandling classified information.\n\"A cloud of doubt hangs over the FBI's objectivity,\" Judiciary Committee Chair Chuck Grassley (Iowa) said, adding: \"The public's faith in the FBI, in Congress, and our democratic process has been tested lately.\"\nRough stuff.\nJUST WATCHED Comey: No regrets about Clinton email probe Replay More Videos ... MUST WATCH Comey: No regrets about Clinton email probe 01:04\nThrough it all, Comey kept his voice even and measured and a smile on his face. And, from the start of the hearing, he offered his explanation for why he sought to inform Congress of a re-opening of the Clinton investigation -- and never backed down off that message.\nThat explanation? His investigators came to him on Oct. 27 with metadata from Weiner's computer that showed thousands of Clinton emails. They also told him they wouldn't be able to go through them all by election day. Comey went public, for fear of being seen as something short of wholly transparent if and when Clinton was elected.\n\"It was a hard choice, I still believe in retrospect the right choice,\" Comey said. \"I can't consider for a second whose political fortunes will be affected.\"\nTime and again, he was pressed by Democratic Senators on those decisions. And time and again he calmly explained that he saw himself between a rock and a hard place -- and chose the best available option, even if it wasn't a particularly attractive one.\nJUST WATCHED Comey: Clinton, Trump probes treated the same Replay More Videos ... MUST WATCH Comey: Clinton, Trump probes treated the same 00:54\nIn short, Comey was entirely content to play the villain that both sides portrayed him to be. (A January Quinnipiac poll showed that just 23% of respondents approved of the job Comey is doing while 49% disapproved.)\nFor Democrats, that's as a government official who badly overstepped his duties when he offered a detailed report on Clinton's email server activities and then re-opened the investigation just days before the election.\nFor Republicans, it's as a too-timid law man -- unwilling to upset the apple cart either by indicting Clinton or dismissing the Russian collusion story out of hand.\nComey appears entirely unconcerned by his lack of popularity, seemingly holding it as a point of pride. Much of that attitude is born of the fact that he is in the middle of a 10-year term in the job. (Comey was confirmed on a 93-1 vote back in 2013.) While he can be removed at the will of the president, Comey seems to worry very little about that that possibility.\nMy guess is that Comey sees the dislike from both sides as evidence he is doing his job right.\nThis pointed exchange with Hawaii Sen. Mazie Hirono, a Democrat, says it all:\nHirono: But we know that you were very concerned about what might happened if it came to light that you had possibly gone easy on Mrs. Clinton and therefore that you were concerned about the political ramifications of your decisions.\nComey: I was not.\nHirono: So you did not consider that your statements about a person who was running for president would not have a negative effect on her?\nComey: I tried very hard not to consider what effect it might have politically. I tried very hard to credibly complete an investigation that had gotten extraordinary public attention and my judgment, and people can disagree about this, was that offering as much transparency as possible about what we did, what we found, and what we think of it, was the best way to credibly complete the investigation. I wasn't thinking about what effect it might have on a political campaign.\nHirono: I find that very hard, hard to believe that you did not contemplate that there would be political ramifications to your comments.\nDemocrats cheered Hirono. Comey just smiled and moved on.",
    "label": 3
}