{
    "index": 390,
    "text": "Will Samantha Bee upstage White House Correspondents' Dinner?\nShow Caption Hide Caption Samantha Bee hosts 'Not the White House Correspondents' Dinner' Late-night TV star Samantha Bee was pulling in celebrities for the first \"Not the White House Correspondents' Dinner\" on Saturday — a tongue-in-cheek play on the real bash Time\nWASHINGTON — Washington’s once-glitzy “nerd prom” is about to get overshadowed.\nLate-night TV star Samantha Bee was pulling in celebrities for the first “Not the White House Correspondents’ Dinner” on Saturday — a tongue-in-cheek play on the real bash, where journalists, the president and, in recent years, lots of bold-face names have mingled.\nBut President Donald Trump was skipping the White House Correspondents’ Association gala, instead marking his 100th day in office with a rally in Pennsylvania. No president had declined an invitation since Ronald Reagan in 1981, and he was recovering from an assassination attempt. Still, Reagan phoned in some friendly, humorous remarks.\nWHCA dinner organizers wanted to put the focus on the First Amendment and the role of the press in democracy. The scheduled headliners were Bob Woodward and Carl Bernstein, set to present journalism awards. Woodward told The Washington Post the two planned to speak about “the First Amendment and the importance of aggressive but fair reporting.”\nLook for the celebrities at Bee’s event: TV stars such as Alysia Reiner of Orange Is The New Black, Retta of Parks and Recreation and Matt Walsh of Veep were expected at her after-party.\nThe correspondents’ group, as usual, booked a master of ceremonies: Hasan Minhaj of The Daily Show. Broadcast coverage was to begin at 9:30 p.m. on C-SPAN, followed by Bee’s event airing on TBS at 10 p.m.\nJeff Mason, the WHCA president, said this year would have been different even if Trump had attended, “based on the tension that has existed in the relationship and some of the things he has said about the press. We were preparing for a different dinner either way.”\nTrump has called the media “fake” and “dishonest” and even “the enemy of the people.” In an emailed fundraising appeal before leaving for Pennsylvania, Trump cited among the accomplishment over his first 100 days, “We fought back against the media’s lies.”\nMason promised that Minhaj would use his comedy chops, without “roasting the president in absentia.”\n“People don’t want to come to a dinner and feel bored or preached at. Hopefully neither of those things will happen,” Mason said.\nBee, who hosts TBS’ Full Frontal weekly show, said she planned to focus on celebrating the press.\n“We’re intending our show to really focus on honoring the press for all of the work that we vampire from them, all the hard work that people do that go into making a show like ours possible,” she told The Associated Press this past week.\nThe dinner began in 1921, and last year, for President Barack Obama’s final appearance, the crowd included Will Smith, Emma Watson, Kerry Washington, Helen Mirren and model Kendall Jenner.\nMost people trace the development of the celebrity guests to 1987, when then-Baltimore Sun reporter Michael Kelly brought Fawn Hall, the secretary in the center of the Iran-Contra affair.\nContributing: Associated Press writer Jocelyn Noveck",
    "label": 3
}