{
    "index": 177,
    "text": "The White House is saying nothing about questions related to President Trump's tweet alluding to the existence of audio tapes of a dinner conversation with former FBI Director James Comey.\nFULL COVERAGE: The firing of James Comey\nWhite House Press Secretary Sean Spicer has dodged repeated questions about the tapes and the conversation itself a total of seven times in the past few days.\nFollowing Mr. Trump's tweet on May 12th, where the president threatened that Comey \"better hope there are no tapes\" of the conversation, Spicer told reporters he had \"talked\" with the president about the tweet in question, and said that the president \"had nothing to add on the topic.\"\nJames Comey better hope that there are no \"tapes\" of our conversations before he starts leaking to the press! — Donald J. Trump (@realDonaldTrump) May 12, 2017\nThere are two different anecdotes from that January dinner -- one that says that Mr. Trump asked for Comey's loyalty during the course of the dinner, and Comey told associates he declined, saying instead that he would always be honest. Mr. Trump said of their dinner that Comey had told him that he was not the subject of an FBI investigation.\nWhen asked pointblank at the same briefing if anyone in the White House had an audio recording of what unfolded during the dinner, Spicer said he was \"not aware\" of whether such a recording exists.\nSpicer continued to deny reporters' inquiries about the tapes two more times at the May 12 briefing.\nIn Monday's briefing, Spicer reiterated his non-answer about the tape's existence, refusing to provide any more details on just what the president meant in his tweet, saying only that Mr. Trump has \"made it clear\" what his position is.\nAsked if the White House would cooperate with requests made by both Republicans and Democrats to provide additional information, in writing, over the existence of any tapes -- Spicer stuck with his same refrain, telling reporters it was clear what Mr. Trump's position is on the issue.\nAnd when asked to clarify just what that position was? Spicer answered \"he has nothing further to add.\"\nRep. Adam Schiff, D-California, called the conversation between Trump and Comey \"highly unethical\" on CBS News' \"Face the Nation\" on Sunday.\n\"The fact that they had a private conversation in which the president, by his own admission, was discussing the future of Director Comey in that job and the president brings up whether he's under investigation? Highly unethical. At a minimum unethical,\" Schiff said. \"If he was then trying to impede the investigation in any way, maybe beyond unethical. But deeply disturbing. Again, a threat to our system of checks and balances.\"\nSen. Chuck Schumer, D-New York, echoed Schiff's statements on the Senate floor on Monday, calling for Trump to turn over any tapes to Congress and investigators.\n\"The fact that the President has said he may have taped Mr. Comey makes the need for a special prosecutor all the more important. If it's true, if there are tapes, a special prosecutor would have the ability to obtain these tapes, undeterred, and then can examine them to and see what wrongdoing, if any, has occurred,\" added Schumer.\nMr. Trump, however, denied he asked Comey for a loyalty pledge when asked by Fox News earlier this week.\n\"No, no I didn't, but I don't think it would be a bad question to ask,\" he said. \"I think loyalty to the country, loyalty to the United States is important. You know, I mean, it depends on how you define loyalty, number one. Number two, I don't know how that got there, because I didn't ask that question.\"",
    "label": 3
}