{
    "index": 166,
    "text": "WASHINGTON -- The FBI is investigating meddling by the Russians in the U.S. election and whether anyone on the Trump team colluded with them. Former FBI Director James Comey was heading that investigation, so does firing him put the president in legal jeopardy?\nWithin hours of President Trump's tape tweet, a pair of top Democrats had sent a letter to the White House counsel, requesting \"copies of all recordings regarding this matter.\"\n\"The president's actions this morning,\" they warned, \"raise the specter of possible intimidation and obstruction of justice.\"\nThey're just the latest Democrats to suggest that the president broke the law.\n\"There may be a cover-up,\" Sen. Richard Blumenthal, D-Connecticut, said in a press conference.\n\"He may be obstructing justice,\" Sen. Dick Durbin, D-Illinois, said.\n\"President Trump has fired this guy because the dragnet's tightening in the Russia investigation,\" Sen. Tim Kaine, D-Virginia, said.\nThe U.S. criminal code defines obstruction of justice as \"corruptly or by threats or force\" attempting \"to influence, obstruct, or impede, the due administration of justice.\"\nExhibit A, Democrats say: Mr. Trump's own explanation for why he fired Comey.\n\"When I decided to just do it, I said to myself, this Russia-Trump thing is a made-up story,\" Mr. Trump told NBC News Thursday.\n\"I would go crazy if a client of mine said something like that,\" attorney Robert Bennett says.\nThe veteran lawyer has defended Republicans and Democrats, including former President Clinton during the Monica Lewinsky scandal.\n\"It's so stupid what he's doing,\" Bennett says of Mr. Trump.\nBut based on what the public knows, Bennett doesn't believe there's enough evidence for an obstruction of justice case against Mr. Trump.\n\"If I were defending the case, I would say, he knows it's not going to end the investigation. If anything, the FBI will get more energized by this, which I believe they will,\" Bennett says.\n\"He is guilty, in my opinion, of violating every major principle of crisis management. He's certainly acting guilty,\" Bennett says.\nIt's important to note that the congressional standard for obstruction of justice is sometimes lower than the courts'. Neither Mr. Clinton nor Richard Nixon, for example, ever faced criminal charges for obstruction of justice, but they were both impeached for it.",
    "label": 2
}