{
    "index": 429,
    "text": "Obama unveils design, vision for future presidential library\nShow Caption Hide Caption Obama Presidential Center is one step closer to being built Former President Obama and First Lady Michelle Obama unveiled the design plans for the Obama Presidential Center. Veuer's Nick Cardona (@nickcardona93) has that story. Buzz60\nCHICAGO — Former president Barack Obama on Wednesday unveiled the conceptual design of his future presidential library and museum in the city's historic Jackson Park — and laid out his vision for using the center to transform a swath of Chicago that's been disproportionately impacted by crime and poverty.\nThe design envisions three buildings — a museum, forum and library — surrounded by a public plaza in the city park designed by Frederick Law Olmsted and Calvert Vaux on Chicago's South Side.\nThe museum, the tallest of the three buildings, will hold exhibition space, public spaces, offices and education and meeting rooms, according to the Obama Foundation. The forum and library buildings are intended to be used for study and foundation programming. Obama said his foundation, which is overseeing the project, is also looking into the possibility of locating a Chicago Public Library branch on the site.\n\"If you ask a lot of people outside of Chicago, about Chicago, what's the first thing they talk about? They talk about the violence,\" Obama said at a forum to unveil the plans. \"Jackson Park feels different than Lincoln Park or Millennium Park,\" added Obama, referring to the downtown and North Side parks in more affluent areas of the city. \"It's not as good as it could be.\"\nThe plan calls for the museum to anchor the northern end of the plaza on the sprawling campus of the presidential center, while the roofs of the library and forum buildings are to be covered with plantings to create new park land. The total size of the center is estimated to range 200,000 to 225,000 square feet. Obama said he envisions adding a sledding hill to the park — something he said his wife said she always wanted when she was growing up on the South SIde — as well as play lots and paddle boats for the lagoon in the park.\nObama also said he hopes the presidential center will become a hub for artists like Bruce Springsteen, Chance the Rapper and Spike Lee to use to teach young people about music and film.\n\"What we want this to be is the world premiere institution for training young people in leadership to (help them) make a difference in their communities, in their country and in their world,” he said.\nObama traveled to Chicago to hold a forum about the plans and unveiled the renderings of the presidential center campus, designed by husband-and-wife architects Tod Williams and Billie Tsien and estimated to cost $500 million. The museum is expected to be completed by 2021.\nConstruction of the Obama presidential library, like the nation’s 13 other presidential libraries, will be paid through private donations. Upkeep of the libraries are funded by American taxpayers.\nThe Obamas, who continue to live in Washington while their younger daughter finishes high school, chose to unveil the plans in the city’s South Shore neighborhood, the once working-class neighborhood where the former first lady was raised and that more recently has been beset by the scourge of gun violence that has overwhelmed the city for the last 16 months. The city has tallied more than 950 murders since the beginning of 2016, with the bulk of the killings in predominantly African-American and Latino neighborhoods on the city's South and West sides.\nIn late March, seven people were murdered over a 12-hour period within blocks of each other in South Shore, including a 27-year-old man and 23-year-old woman who were fatally shot as they drove near the venue where the Obamas held the announcement.\nObama spoke directly to the violence impacting the city and the need for the presidential center to begin engaging in the community before construction is completed. To that end, Obama said that he and his wife will donate $2 million help fund the Chicago summer jobs program, a youth program that aims to provide job training and summer work for at-risk youth.\n\"We don't want to wait for a building,\" Obama said.\nThe northern edge of the South Shore neighborhood abuts Jackson Park. Tiger Woods is also set to design a golf course to replace the current course in the city park, leading to hopes for revitalization of the area as well as concerns from some in the community that gentrification of the neighborhood may be inevitable.\nThe University of Chicago, which the Obamas picked to host the library, predicts that project will have a $220 million annual impact for the city and could create nearly 2,000 permanent jobs. About 800,000 visitors annually are expected to visit the library and museum celebrating the nation’s first African-American president, according to the university’s projections.\nRead more:\nIn rolling out plans for the presidential center, the former president has said he wants the presidential center to be more than an archive or museum, but also an incubator to affect change.\n\"It's about more than buildings or jobs or contracts,\" Obama said. \"It's about hope. It's about belief. It's about a story that our kids tell themselves.\"\nFollow USA TODAY Chicago correspondent Aamer Madhani on Twitter: @AamerISmad",
    "label": 3
}