{
    "index": 27,
    "text": "— -- Health care coverage for pre-existing conditions has been a major sticking point in the negotiations around the new GOP health care plan -- and a source of mixed messages from Republicans and Democrats about what the bill would actually do.\nPresident Donald Trump said in an interview on Monday that the bill would cover pre-existing conditions as well as Obamacare did. \"I want it to be good for sick people. It's not in its final form right now,\" he told Bloomberg News on Monday. \"It will be every bit as good on pre-existing conditions as Obamacare.\"\nBut Democrats have attacked the plan as getting rid of coverage for people with pre-existing conditions, like congestive heart failure, epilepsy, kidney disease, multiple sclerosis, paralysis, severe mental illness, Alzheimer's, dementia and pregnancy.\nSo who's right? Here what you need to know about pre-existing conditions and the GOP health care plan:\nHow will this affect Americans with pre-existing conditions?\nThe amendment to the current GOP health care plan would effectively undermine Obamacare's protections for people with pre-existing conditions, allowing states to apply for a waiver from national pre-existing conditions rules. But it would not leave them uninsured: states would be required to create a high-risk pool to cover those individuals.\n\"Even if a state gets a waiver, there are multiple layers of preexisting condition protections, like continuous coverage,\" said Speaker Paul Ryan, explaining the plan on Thursday. A fact sheet released by Ryan's office says states can only get out of the pre-existing conditions coverage requirement \"if that state has chosen to take care of the people through other risk-sharing or reinsurance mechanisms.\"\n\"The amendment is very clear: Under no circumstance can people be denied coverage because of a pre-existing condition,\" reads the fact sheet. But the waiver would lift the prohibition on insurers charging sick consumers more for health insurance if their coverage has lapsed.\nConservative members of the GOP caucus who did not support the previous version of the Republican health care plan say this amendment will ultimately keep premiums lower. But moderate Republicans are wary of what the bill might mean for people with pre-existing conditions back home.\nRepublicans are struggling to find the necessary support to pass the bill, and whip counts show the fate of the bill in the House is unclear.\nHow many Americans will this plan affect?\nMore than 52 million Americans -- roughly 27 percent of adults under 65 years old -- have a pre-existing condition that would make them un-insurable before Obamacare, according to a December 2016 study from the Kaiser Family Foundation.\nMany of these people have coverage through an employer or other government coverage, but this group of people would be affected if they were ever to lose their insurance. Kaiser notes that states in the deep South have even higher rates of pre-existing conditions, where one in three or more Americans have pre-existing conditions in Alabama, Kentucky, Mississippi and West Virginia.\nIt includes 30.4 million people in states that Trump won and another 21.2 million people in states that Hillary Clinton won in the 2016 presidential election -- that's 28.0 percent of people in Trump states and 24.6 percent of people in Clinton states, according to an ABC News analysis of Kaiser data. That's also 25.4 million people in states with a unified Republican state government, which would be most likely to apply for waivers and create separate high-risk pools.\nAnother Kaiser Family Foundation poll showed that a majority of Americans -- 53 percent -- say they or someone in their household has a pre-existing condition.",
    "label": 2
}