{
    "index": 767,
    "text": "Dimitri Vervitsiotis\nDonald Trump talked a big game on the campaign trail about standing up to big corporations and putting the interests of hardworking Americans first.\nBut as president, Trump has repeatedly broken his promises – and now, he’s dealing a blow to Americans saving for retirement.\nAdvertisement\nIn February, he set in motion a process to kill a common-sense rule that would keep financial advisers from siphoning off money from the clients who trust them. Right now, predatory financial advice cheats investors out of about $17 billion every single year. Under the new rule, that money would stay with the customers.\nThis new consumer protection, also known as the “fiduciary rule,” was slated to take effect today, but President Trump has delayed it for 60 days – and may kill the rule altogether. The rule would require financial advisers to act in their customers’ best interest ― not in their own interest or in the interest of their investment firm. Just like doctors take an oath to act in the best interest of their patient’s and lawyers take an oath to act in the best interests of their clients, financial advisers responsible for protecting the long-term financial health of Americans should be required to follow a high standard of care.\nBefore this rule existed, financial advisers could recommend products whose sales generated bonuses, commissions, or prizes for the advisers, but that could cost their clients significantly more in higher fees.\n“The Trump White House has picked special interest and industry groups over hardworking Americans.”\nAdvertisement\nBut with the new rule, ordinary Americans can trust that their financial adviser is working for them and not recommending investments to line the adviser’s own pockets. And the many financial advisers who already do put their clients’ interests first would no longer have to compete on an uneven playing field with those who are more interested in making a quick buck than they are in making sure their customers can build a secure retirement for themselves and their families.\nEven though the rule hasn’t been fully implemented yet, it’s already benefitting working families. Because the proposed rule was scheduled to go into effect, some major investment firms have slashed prices on their funds. Some have taken their worst, highest-fee products off the shelves. Others have eliminated some of the most predatory commission-based sales practices altogether, and some have even created brand new products that are less expensive and better for consumers. In other words, the facts are clear: this rule is good for investors and good for advisers who put their clients first.\nBut despite these clear benefits, the Trump White House has picked special interest and industry groups over hardworking Americans. He has picked giant corporations over retirees.\nSixty days may not seem like a big deal, but according to economists at the Economic Policy Institute, just this two-month delay will cost Americans saving for their retirement a collective $3.7 billion dollars. And this is just the beginning. If President Trump succeeds in delaying this rule further or in killing this important consumer protection, the special interests and big corporations he rallied against will score a victory — a $17 billion a year victory — and the American people will be the ones left with the bill.\nPresident Trump should make good on his campaign promises to stand up to the financial industry and give up on reversing the new fiduciary rule.\nAdvertisement",
    "label": 3
}