{
    "index": 112,
    "text": "Department of Justice cracks down on sanctuary cities\nAUSTIN, Texas -- The Texas Legislature on Wednesday passed a ban on so-called \"sanctuary cities\" that allows police officers to ask about a person's immigration status and threatens sheriffs and police chiefs with jail time if they don't work with federal authorities.\nRepublican Gov. Greg Abbott has pledged to sign the bill into law, which could now come quickly.\nThe GOP-led Senate passed the bill Wednesday despite objections from Democrats, who call the bill a \"show-me-your-papers\" measure that will be used to discriminate against Latinos.\nThe term \"sanctuary cities\" has no legal definition, but Republicans want local police to help federal immigration agents crack down on criminal suspects in the U.S. illegally.\nThe bill allows the state to withhold funding from local governments for acting as sanctuary cities.\nRepublicans have a strong majority in the Legislature and shoved aside Democratic objections to push the bill, even as President Donald Trump's efforts to withhold federal funding for sanctuary cities have hit roadblocks in federal courts.\nThe Texas bill allows police to inquire about the immigration status of anyone they detain, a situation that can range from arrest for a crime to being stopped for a traffic violation. It also requires local officials to comply with federal requests to hold criminal suspects for possible deportation.\n\"We do not want illegal criminals back on the street. This is about the rule of law. It's always been about the rule of law,\" said bill sponsor Sen. Charles Perry, a Republican from Lubbock. He dismissed the concerns of racial profiling and harassment as \"fearmongering.\"\nTexas doesn't currently have any sanctuary cities, but that hasn't stopped Abbott and Republican legislative leaders from pushing aggressively to ban them.\nSally Hernandez, the sheriff of Travis County, which includes liberal Austin, enraged conservatives by refusing to honor federal detainer requests if the suspects weren't arrested for immigration offenses or serious crimes such as murder. Hernandez softened her policy after Abbott cut funding to the county, saying decisions would be made on a case-by-case basis. She has said she will conform to the state's ban if it becomes law.\nLt. Gov. Dan Patrick said the bill \"will ensure that no liberal local official can flaunt the law.\"\n\"There is no excuse for endangering our communities by allowing criminal aliens who have committed a crime to go free,\" Patrick said.\nFierce resistance has come from Texas Democrats and immigrants' rights organizations, as well as from some in law enforcement and top business lobbies. Opponents say it opens the door to discrimination and intimidation. Many sheriffs and police chiefs in heavily Democratic areas warn that it would make their jobs harder if immigrant communities -- including crime victims and witnesses -- become afraid of the police.",
    "label": 3
}