{
    "index": 338,
    "text": "“Mark my words,” Donald Trump said when he announced he was running for president nearly two years ago. He would build a wall on the southwest border, and Mexico would pay for it.\nThat promise, the most indelible aspect of Trump’s political branding, has endured. It still generates some of the loudest applause during Trump’s speeches, as it did at a weekend rally to mark his first 100 days in office.\nBut over the past week, Trump gave up on pushing Congress to include the billions needed for the wall in the spending plan that lawmakers expect to pass this week. There is little sign that Mexico will be compelled to pay for it, as Trump has so often vowed. And administration allies are increasingly trying to redefine “the wall” as something other than what Trump described in the campaign.\nThe wall may be the perfect metaphor for Trump’s administration so far: It remains a White House priority. Trump’s harsh rhetoric about it has probably helped stem the flow of illegal border crossings, stirring widespread fear in immigrant communities. But the physical wall itself remains very much in doubt, in part because members of Trump’s party seem unwilling to pay for it and members of his administration do not think it is completely necessary.\n“It is clearly a defeat for the president” for the money not to be in the current spending bill, said Mark Krikorian, executive director of the Center for Immigration Studies, a think tank in Washington, D.C., that advocates for reducing immigration levels.\nAdvertisement\n“At a minimum there’s no appetite for it,” said Angela Kelley, a senior strategic advisor for immigration at Open Society Policy Center, which favors looser immigration restrictions. “That could grow into an allergic reaction.”\nThe $1-trillion deal to keep the government open through September, agreed to by the White House and congressional leaders late Sunday, does not include money for new fencing or new border agents requested by the Trump administration.\nIt does include $1.5 billion for border security, a concession Democrats might not have made without the pressure from Trump on border spending. But that money is allocated for technology and maintenance of existing infrastructure at the border.\nThe most notable new barrier in the spending plan: $50 million to upgrade the fence around the White House, requested after a wave of intruders began hopping the existing fence during the Obama administration.\nSean Spicer, Trump’s press secretary, said the border security money in the spending plan could help with planning, technology and other preliminary aspects of the wall. He promised that Trump would push for more when he gets a chance to negotiate the 2018 spending bill, his first full-year spending plan.\n“This is a down payment on border security,” Spicer said.\nBut Republicans in Congress, their spokespeople and even administration officials these days often define the wall as a catch-all for border security, rather than a permanent physical structure.\n“There are places where a permanent physical barrier, a wall makes sense,” said Michael Steel, a former GOP leadership aide. “There are other places where it’s less practical and there are other options. But the overall goal remains the same.”\nTrump’s own homeland security secretary, John F. Kelly, offered a similar assessment in April.\n“It’s unlikely that we will build a wall or physical barrier from sea to shining sea,” he testified before the Senate Homeland Security Committee. Under questioning from Sen. John McCain (R-Ariz.), he agreed that the wall could be interpreted as a combination of drones, towers, fences, technology to detect tunnels and other electronic means combined with border guards. “The wall is all of that,” he said.\nThat approach would mirror policies pursued by Trump’s predecessors and would roughly follow the strategy advocated by officials at the Border Patrol union, who have said, for example, that fences are often preferable to solid walls because they are harder to hide behind.\nEven Trump allowed during a speech in Georgia on Friday that the wall would be “in certain areas,” a departure from his long-held description of a solid uninterrupted barrier that would grow higher by a few feet every time he was doubted.\n“Obviously, where you have these massive physical structures you don’t need — and we have certain big rivers and all,” Trump added, cryptically.\nOfficial cost estimates for a wall vary widely — from $12 billion to $38 billion, all the way to a nearly $70 billion estimate by Senate Democrats.\nAlthough popular among Trump’s supporters, the wall has never been a top priority for hard-line immigration policy advocates, who argue that a combination of changes, including tougher internal enforcement, would do more to stem illegal immigration.\nNor do most Americans expect Trump to actually build it, surveys indicate. In a YouGov poll conducted last week, 51% of adults said they did not think Trump would build a wall, while only 29% said he was likely to accomplish that goal. The share of adults in the poll who said Trump would likely not achieve the goal was higher than for any of the campaign promises YouGov asked about.\nBut there is tension between broad public opinion and Trump’s supporters. Republicans in the YouGov poll were far more likely to believe the wall would get built. And other polls, which show only about 30% to 40% of Americans want a wall built, show much greater support among Republicans, especially conservatives.\n“I don’t know that they care whether it’s a Chinese wall,” said former House Speaker Newt Gingrich, who has advised Trump. “...They saw it as a symbolic statement that he was going to [crack down on] people crossing into the United States illegally.”\nGingrich said those counting out Trump’s ability to pressure Congress for more wall funding suffer from “historical amnesia” that presidents sometimes need time to win their initiatives and “the desire to minimize Trump because he didn’t get it by waving a magic wand.”\nTrump’s harsh rhetoric and a handful of enforcement changes have helped reduce illegal border crossings without a new barrier. U.S. Customs and Border Protection reported that 16,600 people were apprehended and deemed inadmissible at the southern border in March, a 64% decrease from the same month in 2016.\nTrump has celebrated that victory, but is wary of resting on it.\n“You know, we have done so well at the border, a lot of people are saying, ‘Oh, wow, maybe the president doesn’t need the wall,’ ” Trump told the raucous crowd at his 100-day rally in Harrisburg, Pa., on Saturday night. “We need the wall to stop the drugs and the human trafficking. We need the wall.”\nTrump, who feeds off his crowds’ enthusiasm, appeared to veer off script as the audience grew louder. “We will build a wall, folks, don’t even worry about it,” he said. “Go to sleep. Go home, go to sleep, rest assured.”\nEven as Trump talks up the wall, the ground beneath it has shifted. On Saturday, he did not ask, “Who’s going to pay for it,” once a signature line at his campaign rallies that prompted the crowd to chant “Mexico” in unison.\nThe Mexican government, which sees the wall as an insult, has insisted it would never entertain funding it, and Trump has not offered a plan that would force the issue.\nTo pass the spending bill, Trump needed Democrats, both in the Senate where Republicans hold a narrow majority and in the House where hard-line conservatives often vote against spending bills regardless of which party crafts them. Those dynamics will surely continue and could grow even thornier.\nAdvocates on both sides of the immigration debate predicted that Democrats’ victory on the latest spending bill will embolden them to demand more in future negotiations. Indeed, some Democrats were openly gloating Monday.\n“If Congress refuses to fund your stupid wall during your honeymoon period, what makes you think we will ever fund it?” tweeted Rep. Ted Lieu (D-Torrance).\nTrump allies argue that increases the urgency of nailing down the money quickly.\n“It is essential he wins this,” said Krikorian. “Even if the wall did nothing, it would be important to get it through, because it is so essential to the message of controlling immigration.”\n»\nStaff writers Lisa Mascaro and Michael Memoli contributed.\nnoah.bierman@latimes.com\nTwitter: @noahbierman\nALSO:\nHow Maxine Waters became ‘Auntie Maxine’ in the Age of Trump\nHere’s what’s driving North Korea’s nuclear program — and it might be more than self-defense\nSpending bill includes $2 million increase for NEA after Trump proposed eliminating funds",
    "label": 3
}