{
    "index": 295,
    "text": "(CNN) Congressional investigators are running into new challenges with their Russia probes, facing a mountain of records to sift through, uncertainty about the leads they are chasing and partisan disagreement over whether there was any collusion between the Kremlin and Trump advisers.\nIn interviews with CNN, a number of House and Senate lawmakers said that they expect both panels' investigations to drag on well into the fall -- and possibly even into 2018. And there is a high degree of skepticism over whether the two panels would eventually be able to reach any sort of bipartisan agreement on a central question: Did the Russians privately coordinate with Trump officials in an attempt to sway the elections?\n\"Everyone sees things through their partisan lens,\" one lawmaker said.\nFormer acting Attorney General Sally Yates, along with James Clapper, the former director of national intelligence, will appear before a Senate Judiciary subcommittee Monday to give testimony that could help investigators learn more about Trump associates' alleged ties to Russia, including former national security adviser Michael Flynn.\nAnd as FBI Director James Comey also plans a trip to Capitol Hill this week, investigators are struggling to determine whether some Trump campaign advisers, including former campaign chairman Paul Manafort and former foreign policy adviser Carter Page , secretly worked with Russians to help sway the elections . The committee has recently sent a range of letters asking for Trump associates to detail their meetings with Russians, including to Page. He declined Friday to provide that information to the panel, citing surveillance that occurred over his communications during the Obama years.\nBut the lawmakers also don't know if the meetings Trump associates took with Russians were simply aimed at helping their own companies and bolstering their business connections. It's uncertain whether the investigators will be able to talk to any of the Russians who allegedly met with Trump officials.\nAnd the work ahead, they say, is staggering.\n\"This is not hyperbole: The amount of documents that we have to go through is as tall as I am,\" said GOP Sen. James Lankford of Oklahoma, who stands at 5 feet 10 inches.\nA trip last week to CIA headquarters in Langley, Virginia, was intended to clarify some key questions lawmakers have -- but it only led to more that investigators are trying to answer as they sift through the data supporting the intelligence community's January report that Russian President Vladimir Putin ordered a cyber-campaign to sway the elections to benefit President Donald Trump.\nPlus, the Hill inquiries are navigating around an FBI probe into possible Trump campaign ties with Russian officials that some key lawmakers believe could take more than a year to complete.\nOver the weekend, a former US official has confirmed to several news organizations, including CNN, that Trump's transition team warned Flynn about the risks of communicating with Russian Ambassador Sergey Kislyak weeks before the two discussed sanctions over the phone. Flynn later resigned over mischaracterizing that conversation to Trump administration officials.\nThe Senate intelligence committee will get a chance to question Comey next Thursday when he plans to publicly brief the panel. The panel eventually wants to talk to at least 35 witnesses, some of whom likely will also be interviewed by the FBI.\nBut perhaps the biggest challenge: Going through the mounds of documents that the intelligence community has provided them, especially with less than a dozen staff members on the Senate side to help sort through the records.\nComparing the matter to the Ken Starr probe of Bill Clinton in the 1990s, Lankford said: \"That took three years and that's a pretty narrow set of issues. We should be much faster than that, but it's not going to be three months.\"\nDemocrats who want to move quickly on the investigation acknowledge that the probe could very well slip into 2018, potentially making it even harder to reach consensus in the heat of a midterm election season when control of Congress will be at stake.\n\"I would think by the August recess would be very aggressive\" to finish the investigation, said Sen. Martin Heinrich of New Mexico, a Democrat who sits on the Senate intelligence panel.\nHeinrich said the committee could quickly reach consensus on some elements of the inquiry -- including the \"active measures\" the Russians employed.\n\"But on some of the harder questions where it's going to take some time, and every time we find something about that, it adds a new layer of questions, I would be cautious about setting a specific timeline at this point,\" Heinrich said.\nHouse intelligence committee\nIn the House, the inquiry had stalled for weeks amid a partisan dispute over Chairman Devin Nunes' actions and whether he had grown too close to the White House.\nBut after he stepped aside last month amid revelations he was facing a House Ethics Committee inquiry, the new head of the Russia investigation, Texas Republican Rep. Mike Conaway, and the top Democrat on the committee, Adam Schiff of California, have tried to take steps to show the investigation is back on track.\nSchiff and Conaway have agreed to an initial list of around 30 witnesses to interview, along with a public hearing to take testimony from Yates, who had privately warned that Flynn could have been compromised by the Russians.\n\"We are currently sending out invitations for witnesses to testify and requests for pertinent documents,\" Conaway and Schiff said in a joint statement last week.\nYet, given the partisan makeup of the panel, the belief among some Democrats that Trump campaign associates may have committed crimes, and Republicans pushing back at the possibility of collusion, several members of the committee don't think that a bipartisan consensus is possible.\nAnd that was evident, sources say, at a closed-door briefing with Comey last week, with many of the House intelligence committee questions splitting along partisan lines: Republicans pushing for answers on the leaking of classified information, with Democrats grilling Comey for information on collusion.\nExamining ties to top Trump aides\nMoreover, House and Senate investigators are still trying to understand the exact nature of some of the meetings between Russians and Trump campaign officials. And the investigators are reviewing intelligence on the actions of some of the big-name Trump associates, including Page, Manafort, Flynn and Trump son-in-law Jared Kushner, before scheduling interviews with them.\n\"Most of it is complicated,\" said Sen. Angus King, independent of Maine, who sits on the panel. \"We are talking about a lot of people.\"\nThe challenge for members also is easily accessing and reviewing the classified documents, since many are housed at secure facilities, like CIA headquarters in Langley and at the National Security Agency in Ft. Meade, Maryland. That will only add more time to the inquiry.\n\"This is different than other inquiries we deal in,\" said Florida Sen. Marco Rubio, a GOP member of the Senate intelligence committee, citing the logistical issues in accessing the high volume of documents. \"I wouldn't put a timeline on it. This is an unprecedented effort.\"\nAfter the Senate intelligence committee returned from Langley last week, Sen. Mark Warner, the vice chairman of the panel, said it would be an \"iterative\" process, as the full committee was reviewing a batch of new documents from the NSA.\n\"But I can also tell you patience has never been my virtue,\" he said.",
    "label": 3
}