{
    "index": 289,
    "text": "(CNN) Much has been written about how President Trump's election has had a profound impact on the Republican party. What's drawn less attention -- but deserves more! -- is how Trump is affecting Democrats.\nSure, we've seen coverage of how Trump's election has emboldened the liberal left whose call for confrontation at all times has become the rallying cry of the party. ( This New Yorker profile of Senate Minority Leader Chuck Schumer describes the rapid evolution from compromise to confrontation well.)\nWhat's drawn less attention is how Trump's presidency has convinced liberals that every bad thing whispered about any Republican is, by default, true. Consider that in the last week alone, liberal outrage has been sparked on (at least) four occasions by alleged incidents that simply aren't accurate.\n1. There was no health care vote beer celebration\nAs the House was voting on the American Health Care Act, Vice News's Alexandra Jaffe spotted cases of beer being brought into the Capitol. She tweeted about it:\nCases upon cases of beer just rolled into the Capitol on a cart covered in a sheet. Spotted Bud Light peeking out from the sheet — Alexandra Jaffe (@ajjaffe) May 4, 2017\nThat tweet became the basis of an outrage campaign among liberals. This headline , from Mic, is indicative of the early coverage: \"Republicans celebrated taking away Americans' health insurance with cases of beer.\" (Mic has since changed the headline to: \"Reports of beer delivery to GOP health care celebration called into question.\")\nLess than a half hour later, Jaffe tweeted again , noting that the beer wasn't, in fact, for a celebration party for House Republicans. (She had never implied it was.)\nHere are the beers. Asked if they were going to a GOP conference meeting & he said \"no, different meeting,\" no further details pic.twitter.com/ugS8oW4kGj — Alexandra Jaffe (@ajjaffe) May 4, 2017\nDidn't matter! By then, the idea of Republicans cracking beers while voting to take away health care from millions of people was already surging across the Internet. (Look at how many retweets Jaffe's original tweet received versus how many the second tweet got.)\n2. Rape and sexual assault would not be pre-existing conditions\nJUST WATCHED Spicer pressed on pre-existing conditions Replay More Videos ... MUST WATCH Spicer pressed on pre-existing conditions 02:00\nImmediately following the passage of the AHCA last Thursday, a talking point emerged: If this bill became a law, being raped or sexually assaulted would qualify as pre-existing conditions and, therefore, would make it much harder for the victim to get health insurance.\n\"The notion that AHCA classifies rape or sexual assault as a preexisting condition, or that survivors would be denied coverage, is false...this claim relies on so many factors — including unknown decisions by a handful of states and insurance companies — that this talking point becomes almost meaningless.\"\n3. The FCC is not really targeting Stephen Colbert\nJUST WATCHED Partisan politics, late night TV in Trump era Replay More Videos ... MUST WATCH Partisan politics, late night TV in Trump era 10:05\nThe Federal Communications Commission announced that it was investigating complaints following late-night talk show host Stephen Colbert's controversial comments about President Trump and Russian president Vladimir Putin.\nLiberals cried foul, insisting that the Trump administration was trying to stifle criticism -- an abrogation of the 1st amendment. More like standard operating procedure, according to CNN media reporter Frank Palliotta . As an FCC spokesman told him: \"We review all consumer complaints as a matter of standard practice and rely on the law to determine whether action is warranted. The fact that a complaint is reviewed doesn't speak one way or another as to whether it has any merit.\"\n4. The chief usher was not fired over a disagreement with the Trumps\nJUST WATCHED Watch CNN's video report on the first female White House usher leaving Replay More Videos ... MUST WATCH Watch CNN's video report on the first female White House usher leaving 01:02\nThe firing of White House chief usher Angella Reid , the first woman to hold that job, was seized on as the latest piece of evidence that Trump and his administration was nothing more than an old boys club -- openly hostile to women and minorities.\nTurns out, according to Axios reporting , that Reid got along well with the President and First Lady but was far less popular with the staff of the White House she oversaw. \"When her departure was announced to the residence staff yesterday morning, workers burst into applause,\" Axios reported.\nIn each of these four instances -- and all of these have been in the last week! -- liberals, fueled by Twitter outrage, jumped to conclusions that portrayed Trump and other Republicans in the poorest possible light. And, on each occasion, the fuller story either totally or mostly rebutted the version of the story the left had seized on.\nTrump's presidency presents Democrats with lots and lots of legitimate issues on which to push back -- from the travel ban to the ongoing questions about Trump officials' ties to Russia to the president's refusal to release his tax returns.\nBy embracing every single tweet or whisper as yet another piece of full-proof evidence of just how terrible Republicans are, Democrats run the risk of appearing like the boy who cried wolf to the public -- and in the process taking some steam out of the very legitimate questions they are asking about the Trump administration.",
    "label": 3
}