{
    "index": 411,
    "text": "Sanders backs Trump protests, questions Electoral College\nShow Caption Hide Caption Bernie Sanders backs Trump protests, questions Electoral College Sen. Bernie Sanders called for “rethinking” the Electoral College and warned President-elect Donald Trump that he should expect more street protests if he pursues divisive policies. USA TODAY\nVermont Sen. Bernie Sanders, the surprisingly strong challenger for the Democratic presidential nomination, sat down Sunday with USA TODAY's Capital Download to talk about last week's election stunner, the future of the Democratic Party and his new book, being published Tuesday by Thomas Dunne Books, Our Revolution: A Future to Believe In. Questions and answers have been edited for length and clarity.\nQ: If you had been nominated, would you have won?\nSanders: Monday-morning quarterbacking is always easy. The answer is, I don’t know. Nobody knows. I certainly wish I had had that opportunity. Some of the polls out there suggest that might have been the case.\nQ: How much overlap was there between you and Donald Trump in your appeal?\nSanders: There is an overlap, that Trump very successfully understood a lot of people are angry. They feel the economy of this country is not working for them. I mean, Trump was incredibly weak, and its ahistorical, the lack of specificity that he had in any of his proposals. Boy, Hillary Clinton had 87 different proposals all lined up and Trump said, ‘We’re going to do this great. It’s going to be excellent. Really excellent.’ What are you talking about? ‘Excellent, fantastic program.’ No details, no nothing. ...\nThe overwhelming stuff on television had to do with political gossip. Know everything you want to know about Hillary’s emails and Donald Trump’s attitude toward women. Why is the middle class in decline? Why are we the only major country not to have paid family leave? Why aren’t our kids able to afford to go to college? Those are the issues that we have got to talk about. Does corporate media talk about it? No. ...\nIt is naive to not understand who owns the media in America, the major media: large, multinational conglomerates. What is their goal? Their goal is to make money. Is there a basic conflict between making money for large media and having a serious discussion on issues that impact working people? Yeah, I think there are.\nQ: We see anti-Trump demonstrations cropping up across the country. Is that a good thing?\nSanders: We have a First Amendment. People are angry. People are upset. And they want to express their point of view that they are very frightened, in very, very strong disagreement with Mr. Trump, who has made bigotry the cornerstone of his campaign. ...\nI think that people are saying, ‘Mr. Trump, we have come too far in this country fighting discrimination and bigotry. We’re not going back. And if you’re going to continue that effort, you’re going to have to take us on.’ ...\nWe may want to take a look at the whole Electoral College, which is seating a man for president who didn’t get the most votes. This is something we need a serious discussion on. This campaign revolved around 15 states of the country, right? Battleground states. My state of Vermont is a strong Democratic state; no one paid attention. Wyoming is a Republican state; nobody paid attention to Wyoming. Is that a good way?\nQ: Would it be good to change the Electoral College?\nA: I think you ought to think about this. ... I think we want to rethink that.\nQ: Is it fair to say you wrote this book on the assumption Clinton would win?\nSanders: I thought there was a 2-1 shot she was going to win. I was not one of those who was shocked by a Trump victory. ...\nQ: You were in the minority to think there was even a one in three shot that Donald Trump would win.\nSanders: Look, I campaigned in 46 states in this country. The punditry and the inside-the-Beltway mentality really has very little understanding of what’s going on with working people. It’s really almost embarrassing. ...\nYou’re a working person, you can’t afford child care for your kids. Why is it after working your whole life you can’t afford to send your kid to college? Why is it that you’re having a decent job at a factory, and that factory has gone to China? Why is it that you’re seeing almost all new income and wealth go to the top 1%? People are angry and they’re frustrated.\nQ: You’re supporting Minnesota Congressman Keith Ellison for Democratic national chairman. Is he going to win?\nSanders: He stands a good chance....\nIt’s not just this election where it is still hard to believe that Trump won. But Republicans control the Senate. They control the House. They have done phenomenally well over the past eight years in state legislatures around the country, in governor races. And people are asking: How does it happen that a political party which wants to give tax breaks to billionaires, which nobody supports; which wants to cut programs for working people; wants to cut Social Security, Medicare and Medicaid; many of whose members do not even believe in the reality of climate change – how in God’s name do these guys win elections? Well, the Democratic leadership of today hasn’t figured this out. It is time for profound change. ...\nWhat this book is about -- and I know people are going to say, ‘Oh my God, Bernie talks about the economy, talks about health care, talks about immigration, talks about criminal justice, talks about all these things how boring can it be?’ I know it will be criticized. Boring. It’s wonky. But I think we got to begin talking about real issues.\nQ: There are quite a few charts in your book.\nSanders: (Laughs) Yes.\nQ: Are you going to run another term in the Senate in 2018?\nSanders: Probably, but I haven’t made that decision.\nQ: Is it conceivable you would run for president again?\nSanders: You know, it’s conceivable that I may fly to the moon.\nQ: With all respect, it’s not conceivable that you may fly to the moon.\nSanders: If Elon Musk (founder of SpaceX) called me, I could go to Mars. See, you’re wrong. I’m going to make Mars a progressive planet. I’ll be there first, planting the flag. People don’t think big enough!",
    "label": 3
}