{
    "index": 497,
    "text": "Deputy Attorney General Rosenstein to brief senators Thursday on Comey firing\nShow Caption Hide Caption Full Senate to be briefed on Comey firing Deputy Attorney General Rod Rosenstein will be questioned by the Senate Thursday, explaining why he recommended the firing of former FBI Director James Comey. Nathan Rousseau Smith (@fantasticmrntae) explains. Buzz60\nWASHINGTON — Deputy Attorney General Rod Rosenstein will brief senators on Thursday about President Trump’s decision to fire former FBI Director James Comey.\nThe closed-door, all-senators briefing, which he agreed to last week, is set for 2:30 p.m., a spokesman for Senate Majority Leader Mitch McConnell, R-Ky., announced on Monday.\nSenate Democratic Leader Charles Schumer, of New York, had called on McConnell to arrange the meeting, and signaled Democrats plan to push for a special prosecutor to take over the probe.\n\"I hope that senators from both sides of the aisle will use this opportunity to seek the full truth regarding Director Comey’s firing, to press the Deputy Attorney General to make way for a special prosecutor, and to ensure the administration will preserve and make public any audio recordings of conversations between the President and the former director,\" Schumer said in a statement.\nRosenstein, along with Attorney General Jeff Sessions, recommended that President Trump dismiss Comey, citing his controversial handling of the investigation into former secretary of State Hillary Clinton’s use of a private email server.\nBut Democrats, and some Republicans, have been skeptical of that reasoning, given that the FBI is investigating possible collusion between President Trump’s campaign and the Russian government.\nFeeding that premise, Trump told NBC last week that he was thinking of \"this Russia thing\" when he made the decision, calling it a \"made-up story.\" He also said he had already planned to fire Comey regardless of Rosenstein's recommendation.\nRead more:\nThe ultimate decision on whether to seek an outside counsel falls to Rosenstein because Sessions has recused himself from any involvement in the Russia probe. Rosenstein has indicated that he is not yet inclined to do that, a person familiar with the matter said Friday.\nOn Sunday, Schumer told CNN he would support calls to block the nomination of a new FBI Director until a special prosecutor is appointed.\nHouse Democratic Leader Nancy Pelosi on Monday also called for a full House briefing from Rosenstein, decrying the \"distressing disparity of information being made available to the Senate.\" She also asked House Speaker Paul Ryan to have Comey brief House members, noting that he has been invited to testify in the Senate.\n\"The people’s representatives on both sides of the Capitol must have the opportunity to hear from and interrogate the key figures in the FBI Director’s firing,\" she wrote in a letter to Ryan on Monday.\nContributing: Kevin Johnson, USA TODAY",
    "label": 2
}