{
    "index": 86,
    "text": "Republicans like Tom Reed who voted for the AHCA are now facing enraged voters.\n— -- Rep. Tom Reed of New York, who was among the Republican members of Congress to vote for a bill to repeal and replace Obamacare, held a string of hometown forums on Saturday where he was lambasted by crowds of angry voters and signs that read, \"GOP Disaster\" and \"Why do you want to kill my daughter?\"\nReed, whose district in upstate New York includes the cities of Ithaca and Corning, held three town hall meetings where the overwhelming majority of attendees had questions about health care. The congressman was met with boos and jeers throughout the forums, with people repeatedly chanting \"Shame!\" and \"Vote him out!\"\nAt the event in the town of Busti, a couple hundred people packed into a small firehouse holding up signs that read, \"Agree,\" \"Disagree\" or \"Lies,\" depending on Reed's answers. Some of the harsher signs read, \"This is not a victory lap. This is a walk of shame\" and \"Fire Reed.\"\nOne man, who had recently donated his kidney, said he was told he's now considered to have a pre-existing condition.\n\"Now that I have a pre-existing condition, my cost of health care could go up significantly or I could lose health care,\" he said to Reed in front of the crowd in Busti.\nAnother person in the room interrupted the man, calling him a \"hero\" for his kidney donation and then said he was being \"punished\" for his good deed.\nOn Thursday, the House of Representatives narrowly passed the the American Health Care Act on a 217-213 vote, with all Democrats and 20 Republicans voting no. The measure, which would repeal large parts of former President Barack Obama's legacy legislation, is now before the Senate.\nIn a statement Thursday, Reed hailed the House's passage of the health care plan as \"a great victory\" that will provide property tax relief for New Yorkers \"who are unfairly forced to foot the bill for Medicaid.\"\n\"Today is a great victory for the American people. We are finally on the path to fixing our broke and broken health care system,\" Reed said.\nThe congressman also said the American Health Care Act \"upholds protections for pre-existing conditions and the expansion of Medicaid, which help our most vulnerable populations,\" although one of the most controversial provisions of the bill would give the states the option of seeking a waiver to allow insurance companies to raise premiums for people with pre-existing conditions.\nReed was among the first Republican House members to confront angry constituents at town hall meetings this weekend. Other Republican as well as Democrat House members are scheduled to hold more town hall meetings in their home districts around the country in the coming days.\nPhotos posted on social media show Reed addressing his first town hall of the day in Dunkirk, with some people holding signs declaring: \"Keep your profits off my healthcare,\" \"So long farewell Tom Reed\" and \"No conscience no heart.\"\nReed tweeted photos of him engaging with attendees and thanked people for coming to the morning and afternoon meetings in Dunkirk, Busti and Hinsdale.\n'Nobody dies because they don't have access to health care'\nAn Idaho Republican congressman is facing criticism for a comment about the health care bill that he made at a town hall in his district Friday.\nA video posted on YouTube shows the Republican congressman responding to a woman who suggested that people die from a lack of access ti health care.\n“That line is so indefensible,” Labrador said. “Nobody dies because they don’t have access to health care.”\nHis remark sparked an uproar at the event in Lewiston.\n'If you want to run for Congress, you had your chance'\nIt doesn't appear to be only the House Republicans who voted for the measure who are taking heat.\nWisconsin's Republican governor, Scott Walker got into a heated exchange with a Democratic county official in his state over the House bill at an event Friday to promote tourism.\nA video of the exchange shows Outagamie County Executive Tom Nelson approaching the Republican governor as he was about to speak with reporters. Nelson claimed that 300,000 people in northeast Wisconsin could lose their insurance if the American Health Care Act becomes law.\n\"This is a big deal. Three hundred thousand people in Northeast Wisconsin,\" Nelson told the governor.\n\"If you want to run for Congress, you had your chance,\" Walker said, repeating essentially the same reply several times during their exchange.\nNelson, a Democrat, ran unsuccessfully for Congress last year, losing to Republican Mike Gallagher, who voted in favor of the American Health Care Act.\nWalker also told Nelson that the House bill is not something that Wisconsin has to deal with at this point.\n\"It's not in front of us right now. It's not in front of this stage,\" Walker continued. \"The plan is, I'm going to wait for what the Senate and the president do and see from there.\"\nTheir conversation was captured on video by ABC affiliate WBAY and continues for several minutes.\nNext steps for the health care bill\nThe American Health Care Act is now before the Senate, and the Senate Budget Committee must review it to determine which portions are in compliance with the rules of reconciliation, under which the bill only requires 51 Senate votes for approval.\nRepublicans hold a slim majority in the Senate but several members are already wary of the health care plan.\n“At the end of the day, I think it'll be a Senate bill and then those two bills at some point will have to come together and we'll get started on that Senate bill immediately,” Sen. Roy Blunt, R-Missouri, a member of Senate leadership, told ABC News on Thursday.\nWhite House Deputy Chief of Staff Rick Dearborn said the Trump administration has its work cut out for it to push the bill through the Senate, but he doesn't think they'll be starting over on the legislation.\n\"I don't think there's a start from scratch,\" Dearborn told ABC News' Political Director Rick Klein and Chief White House Correspondent Jonathan Karl on the \"Powerhouse Politics\" podcast.\n\"Will there be some changes? Of course, the Senate is a different animal than the House,\" he continued. \"But I think we feel really good where we are. There's a proposal that will now go the Senate. We'll work with Senate leadership and the committee chairmen and the rank and file.\"",
    "label": 2
}