{
    "index": 43,
    "text": "The bill now heads to the Senate.\n— -- House Republicans have passed their ambitious plan to repeal and replace Obamacare, after several fits and starts, sending the measure to the Senate, where it is expected to be significantly revised.\nThe bill passed the House in a narrow 217-213 vote. All Democrats opposed the bill.\nFollowing the House vote, House Republicans celebrated with a press conference at the White House Rose Garden with President Donald Trump, Vice President Mike Pence, and Health and Human Services Secretary Tom Price. Trump touted the bill as a \"great plan\" even though they got \"no support from the other party.\"\nHe congratulated and thanked House Speaker Paul Ryan and praised House Republicans for coming together.\n\"What we have is something very, very incredibly well-crafted,\" Trump said of the bill.\n\"This has really brought the Republican Party together,\" Trump added. \"As much as we've come up with a really incredible health care plan, this has brought the Republican Party together. We're going to get this finished.\"\nAnd on Thursday night, he tweeted, \"It was a GREAT day for the United States of America! This is a great plan that is a repeal & replace of ObamaCare. Make no mistake about it.\"\nEven though the bill has passed the House, there are major roadblocks ahead in the Senate, where the bill is expected to undergo significant changes.\nHowever, Trump said he feels \"confident\" the bill will pass through the Senate and said it \"will get even better.\"\n\"It's going to be an unbelievable victory when we get it through the Senate and there's so much spirit there,\" Trump said.\nDemocrats warned that the changes will leave Americans worse off.\n“Make no mistake, many people will die as a result of this bill,” Rep. Debbie Wasserman Schultz, D-Florida, said.\nRepublicans, who have been promising to repeal and replace Obamacare for seven years but have struggled to coalesce around a specific legislative proposal, said they planned on keeping their promise to constituents.\n“Our constituents did not elect us to do what is easy. They elected us to do what is right,” Rep. Diane Black, R-Tennessee, the chairwoman of the House Budget Committee, said on the floor.\nRepublicans rallied at the Capitol this morning before the vote, listening to the “Rocky” theme song. House Majority Leader Kevin McCarthy of California showed Republicans a photo of Gen. George Patton with a quote from him, “Accept the challenge so that you can feel the exhilaration of victory.”\nRep. Ann Wagner of Missouri told ABC News that the meeting was “all smiles” and that “the line of the day was out of ‘Braveheart’ — ‘Freedom!’”\n“We have the votes,” McCarthy told reporters after the meeting.\nWhile Republicans held the vote without an updated analysis of its effects from the nonpartisan Congressional Budget Office, many defended the decision to move forward without the projections.\n“I know we’re doing the right thing,” freshman Rep. Brian Mast, R-Florida, an Army vet who lost both legs in Afghanistan and represents a swing district, told reporters as he left the meeting.\nAn earlier analysis of the bill from the CBO -- before several amendments were added -- projected that 24 million additional Americans would be uninsured by 2026 and that it would reduce the deficit by $337 billion, compared to the Affordable Cart Act. The bill also restructures Medicaid payments to the states, reducing federal spending.\nA compromise amendment designed to attract votes would give states the ability to opt out of certain Obamacare provisions, including essential health benefits requiring coverage of mental health services, prescription drugs and maternity care.\nThe amendment would also allow states to opt out of another mandate that prevents insurers from charging consumers with pre-existing conditions more for coverage.\nABC News' John Parkinson and Mary Bruce contributed to this report.",
    "label": 3
}