{
    "index": 360,
    "text": "It’s something of a relief, if a mixed one, that the drought has surged into the role of the latest scourge to freak out California.\nIt’s a relief in the sense that it means that the California economy, so recently frighteningly rocky, has receded as the top-billed problem facing the state, even if the recovery is more patchy and vulnerable than anyone might wish.\nBut it’s mixed, of course, because the drought carries its own dangers, and the ultimate solution — rain — remains wholly out of the power of politicians or everyday Californians.\nWater and Power is The Times’ guide to the drought. Sign up to get the free newsletter >>\nFresh signs arrived last week that Californians are taking the drought seriously — and taking it seriously across the state, which has not always been the case during past droughts.\nAdvertisement\nState water officials announced Thursday that urban water users had exceeded Gov. Jerry Brown’s demand in June by trimming usage by 27%. That followed a May cutback of almost 29%, which, like June’s figure, was above Brown’s mandatory 25% cut.\nThe other sign that residents are taking the state’s water woes seriously was a new poll by the Public Policy Institute of California, which said that almost 6 in 10 people considered the drought the most important environmental issue facing California. A year ago, only 35% of Californians held the same view.\nThe drought has set off alarms about the longer-term effects of global warming, the poll found. All told, almost 2 in 3 Californians said climate change had contributed to the current drought. It was a view held in all areas of the state, dissolving the usual split between coastal liberals and inland conservatives.\n#drylandsCA: A road trip during California’s drought >>\nAsked if climate change poses a threat to California’s economy and quality of life, 79% of residents said it did. That question underscored the fact that the state’s burgeoning ranks of minority voters are driving environmental concerns: 90% of Latinos saw climate change as a threat, as did 88% of Asians and blacks. A smaller 70% of white voters were similarly concerned.\nThe high level of concern, if sustained, could reinforce political change. The poll found that nearly two-thirds of Californians wanted the state to set its own climate change policy and not leave it to the federal government, a view shared by Brown, a Democrat, and his predecessor, Republican Arnold Schwarzenegger, both of whom have pushed California to be ahead of the pack.\nThe political potency of the drought could also be seen in two unrelated events.\nOn Thursday, Lt. Gov. Gavin Newsom announced a challenge to entrepreneurs to solve the state’s water needs. The winning teams will work with the Silicon Valley-based Singularity University, which will connect them with tech experts and potential financial backers.\nNewsom, in a statement, said his goal was “to activate the incredible talent and ingenuity of Californians and the SU global community to solve 21st century challenges with 21st century solutions.”\nThe second occurrence has blanketed the radio airwaves in Southern California for weeks. The traffic-stalled have heard Los Angeles Mayor Eric Garcetti bantering in two ads with comedian and actor Steve Carell about water. Specifically, the wasting of it.\n“You know the water’s still running, right?” Garcetti says to Carell in one, after Carell notes that he’s brushing his teeth.\n“Do I get a ticket?” Carell replies.\n“No, Steve. But every Angeleno needs to pitch in and save water,” Garcetti says.\nIn a second ad, Garcetti gently upbraids Carell’s neighbor for watering the lawn for three days running.\n“How about we politely let our neighbors know that outdoor watering is limited to two days a week?” Garcetti says.\n“Can we scream those words?” Carell asks.\n“No, Steve, but maybe you could come up with a fun creative way to say it?” Garcetti responds, before the two settle on the slogan “Twice is Nice.”\nBoth Newsom and Garcetti have undeniable public roles in warning Californians about the limited supply of water and conjuring ways to improve it down the road. Newsom is the second in command of the state, albeit in an often frustrating role with few defined responsibilities unless the governor is out of state. (Newsom was acting governor during Brown’s recent visit to Italy.)\nGarcetti is chief executive of the state’s biggest city, a place that in past droughts didn’t get with the water-saving program entirely.\nBut the duo’s political ambitions also could be seen in their embrace of drought solutions.\nNewsom has already announced his run for governor in 2018, and will be positioning himself as a candidate who gets the new sharing economy and would blast apart what he considers archaic bureaucracies that don’t deliver the swift and personalized service Californians have come to expect from companies like Amazon.\nThe drought challenge fits in, as it seeks to mine new technologies to solve a problem that has confounded California regularly over generations.\nGarcetti is widely believed to have statewide aspirations, but surely knows that Los Angeles politicians have a lousy track record in seeking the governorship or a U.S. Senate seat, particularly when running against candidates from the more politically active north.\nThe mayor has multiple needs in the coming years, but chief among them are running the city in a way that leaves him popular and broadening his reach to voters who live outside the borders of Los Angeles.\nConveniently, the radio ads are broadcast across all of Southern California, potentially introducing Garcetti to millions of voters to whom he is less known — and with a subject that most in the state find hugely important.\ncathleen.decker@latimes.com\nTwitter: @cathleendecker\nFor more on politics, go to www.latimes.com/decker.",
    "label": 3
}