{
    "index": 316,
    "text": "To read the polls and hear the pundits, President Trump’s first 100 days have been an utter disaster, ranking among the worst in history. But that’s not how Karen Malady sees it.\nThe 59-year-old accountant was drawn to Trump’s unconventional candidacy from the start, unlike other Republicans who came around reluctantly. She saw him as an outsider and disrupter, and his first months in office proved her right, she said, about that and other things, too.\nLike no matter how much he tries, some won’t ever give Trump a fair shake.\n“He’s trying to build a foundation to protect this country, and they just pick apart the little things,” Malady said, as fading daylight slanted into the headquarters of the Fraternal Order of Eagles, a nonprofit charity. “‘This person was picked on, and, oh, by the way, this person is of that nationality, so that makes him a racist.’\n“No,” she said with a small shake of her head, “they take that little they can and they dig with it.”\nAdvertisement\nThe anger and aggrievement that fueled Trump’s unlikely election, the sense of abandonment by a self-interested political establishment and sneering condescension from the know-it-alls, hasn’t faded in the months since Trump took office.\nIf anything, it has deepened here in Pueblo County, a longtime Democratic stronghold that Trump narrowly won in November. In nearly three dozen interviews with Trump voters — Democrats, independents and Republicans who had their doubts — not one said they regretted supporting him.\nThey see a president besieged and beset not just by Democrats, a hostile media and haughty academics — all, they say, fashioned from the same cloth — but by his fellow Republicans in Congress, who seem more interested in clinging to office than helping bring about the change Trump promised.\nDespite the resistance, they say, he has delivered on his promise to fight for American jobs, browbeating corporate executives and toughening the country’s trade policies through executive orders. He sent a don’t-mess-with-us message to the world by bombing Syria and Afghanistan. He installed Neil M. Gorsuch on the Supreme Court, cementing a conservative majority for possibly decades to come.\nThe result has been a backlash startling in its ferocity: left-leaning protesters taking to the streets, pundits foaming, lawmakers sputtering.\nSteve Carson, 61, cast his first-ever presidential ballot to vote for Donald Trump. (Matthew Staver / For The Times)\nTrump is shaking things up, said Steve Carson, 61, a retired welder who approvingly assayed the president’s start from a stool at the Chug-A-Mug tavern in Pueblo’s worn Bessemer neighborhood.\n“If we’re not going to follow what’s been in place forever, people’s lives are going to change,” said Carson, a self-described independent who cast his first-ever presidential ballot to vote for Trump. “And a lot of them don’t want things to change.”\nIn short, if all those people in Washington and places like Hollywood and New York are so riled up, Trump supporters suggest, that means he must be doing something right.\n::\nSteel is what helped make Pueblo great and still forges much of its identity.\nThe Colorado Fuel and Iron Co., or CF&I to locals, was built up by the Rockefeller family early in the 20th century. Its billowing smokestacks sustained generations of blue-collar families and delivered on their dreams. Passage into the middle class — a nice home, a car, a pickup, a boat — was possible for even a high-school dropout.\nA Russian conglomerate now owns the steel mill in Pueblo. (Matthew Staver / For The Times)\nThat abruptly changed with the recession and steel industry crash of the early 1980s. More than 5,000 workers were laid off in one day and unemployment topped 20%, as major employers including a meat-packing plant, dog food manufacturer and big piston maker shut down.\nEven though the community has long since rebounded — February’s unemployment rate was just 4.9% — today’s jobs generally aren’t as lucrative, and that helps explain Trump’s success.\n“He spoke to the angst that exists in a lot of communities in America over the decline of the middle class,” said Pueblo County Commissioner Sal Pace, a Democrat and backer of Hillary Clinton, who won Colorado.\nLocated in the high desert at the south end of the Front Range, Pueblo and its surrounding communities are home to about 165,000 people. Folks here are friendly — they’ll nod hello to a stranger — and the outdoorsy lifestyle is far less expensive than Denver, two hours away.\nA sleek riverwalk bustles at night, and there is talk of building a minor league baseball stadium and expanding the Professional Bull Riders headquarters, to create an even bigger tourist draw.\nBoosters speak hopefully of branding Pueblo and its vibrant creative community as a more affordable version of Taos, New Mexico’s famed artist colony. (They are less inclined to tout the burgeoning legal-cannabis industry, even though tax revenues have allowed the county to offer a scholarship to every graduating high school senior.)\nBut take away the temperate climate and distant view of the Rockies and Pueblo could easily fit into one of those Rust Belt states that delivered the White House to Trump.\nJust a few blocks from the riverwalk, downtown’s tree-lined Main Street is dotted with vacant storefronts and small businesses where retail giants — Kresge, Woolworths, Montgomery Ward — once thrived. On a recent weekday morning, the only sound was the squeak of a rusty bicycle chain, laboring under the weight of its oversized rider.\nThe steel mill that was long the fulcrum of life here now employs between 700 and 800 workers, a mere fraction of the 12,000 at its peak.\nA community that prided itself on making big things — the spine of skyscrapers, railroads and bridges — and being a brawny part of America’s once-mighty steel industry has had to downsize its self-image and pare its ambitions.\n“We used to attract businesses that would bring 250, 300 jobs,” said Rod Slyhoff, 62, the longtime head of the Greater Pueblo Chamber of Commerce. “Now it’s 30 or 40.”\nTrump didn’t win here by much, just 390 votes out of nearly 79,000, but his victory marked the first time Republicans carried Pueblo County since President Nixon in 1972. Perhaps more important, Trump shook some voters of their old habits.\nGreg Smith was a Democratic activist and former precinct captain who supported Barack Obama in 2008. But over eight years he grew convinced that Democrats were more concerned with creating jobs for bureaucrats and passing along handouts than caring about people like him.\nHe works 110 hours a week and still can’t afford health insurance, Smith said from behind the bar at his Greenlight Tavern, which has operated downtown since the Depression. A homeless person collapses, he said, and rescuers show up, “put him in a room, give him a sponge bath, medication, and who pays for that? Me.”\nSmith, 59, voted for Trump and is glad he did.\n“I think he’s making a change,” Smith said, citing proposed cuts to the Environmental Protection Agency and the promise of lower taxes and fewer regulations. “The core of America is the entrepreneur, the small-business man. I think he has true concern for that.”\nGreg Smith, 59, behind the bar at his Greenlight Tavern in Pueblo. (Matthew Staver / For The Times)\nHistorians and other experts point to a singular lack of achievement in Trump’s first 100 days. Among their lengthy critique: He has not passed one major piece of legislation. He’s antagonized foreign allies. His proposed travel restrictions on Muslim-majority countries has stalled in court.\nMost spectacularly, his vow to repeal and replace President Obama’s signature healthcare law flopped in a Congress run by his own party.\nBut Trump supporters measure his accomplishments in other ways.\nHe’s boosted business confidence, surveys show, and the stock market has soared. “Anyone with a 401(k) has to be delighted,” said Marla Reichert, 52, head of the Pueblo County GOP.\nHe’s talked tough on terrorism and surrounded himself with military men who can turn those words into action. “It’s time to show the world we’re tired of being pushed around,” said Carson at the Chug-A-Mug.\nHe’s promoted a “buy American, hire American” policy, and just wait, Trump backers say. Maybe it’s unrealistic to bring 6,000 steel-making jobs back to Pueblo, says Reichert, whose father and grandfather both worked in the mill. “But why not 4,000?” she asked. “Why not 3,000?”\nCritics point to Trump’s frequent golf outings and taxpayer-funded trips to Florida, but that’s nothing more than sore-loser talk, the president’s defenders say. Obama golfed too, they note, and as for Trump’s costly travels, give him a break. “If he’s doing his job,” said Republican Adam Huskin, 30, a roofing contractor in upscale Pueblo West, “I don’t really care where he’s doing it from.”\nSome see a series of flip-flops: on NATO, on the Iranian disarmament deal, on support for the Federal Reserve chair, among many. Trump backers see something else entirely: the savvy of a deal-maker.\nTake China, for instance. Trump vowed to slap a fat tariff on the world’s most populous country but has since backed off, which strikes Tom Ready, a Pueblo West dentist, as perfectly sound.\n“We’re not going to go to war with our biggest trading partner,” said Ready, 73, a Republican who showed up at the Eagle club in a skull T-shirt promoting his motorcycle club, the Uglies. “He said, ‘OK, let’s work it out.’ What’s wrong with that? I don’t call it changing policies. I call it a better way of doing things.”\n::\nThe business of evaluating Trump on his first 100 days strikes many as arbitrary and silly, a sentiment matching the president’s pique.\n“What happened to the eight years Obama was in office?” demanded Republican Patti Kerkhoff. Trump was last on her list of 18 GOP candidates running in 2016, but he’s grown on her because he never seems to stop, with a tweet here and executive order there.\n“Promise, promise, promise, and the only change under Obama was that things got worse,” said the 66-year-old retired schoolteacher, finishing breakfast with her church group at a small cafe near the mill. “Trump has been in office for two months, and it’s like, ‘What’s happening? How come it’s not changed already?’”\nIn the front window a sign read “Stop TPP Now,” a reference to the Trans-Pacific Partnership, a proposed trade deal between the U.S. and several Asian countries. During the campaign Trump portrayed the pact as the kind of one-sided bargain that has ravaged Pueblo’s home-grown manufacturers.\nHe vowed to pull America out, and it’s a promise Trump has kept.\nBut that can’t change what’s already taken place. Today, three of Pueblo’s biggest employers are foreign-owned: a Danish corporation that manufacturers and assembles wind turbines; a Mexican cement maker; and the old CF&I, which is now part of the Russian steelmaker Evraz.\nPaul Gornick outside Pueblo Central High School. (Matthew Staver / For The Times)\nFor those born or raised here the sense of loss is passed on, like some hereditary ailment.\nPaul Gornick is 18, nowhere near old enough to remember CF&I’s glory days. But at a Rotary Club meeting, the high school senior — beard trimmed, hair neatly combed — spoke of the hulking smokestacks, most now idled, that loom over the cityscape like blackened gravestones.\n“Every time you pass by,” he said, “it’s a reminder of what used to be.”\nGornick was too young to vote in November, but if he had, he said, he would have backed Trump.\nmark.barabak@latimes.com\n@markzbarabak\nALSO\nTrump at the 100-day mark: Stable support but few achievements\nTrump White House touts achievements but downplays 100-day expectations",
    "label": 3
}