{
    "index": 308,
    "text": "Former national security advisor Michael Flynn’s legal troubles worsened Thursday when a House committee disclosed that the Pentagon inspector general is investigating whether the retired Army three-star general violated military rules by accepting foreign payments.\nFlynn was warned in 2014, when he was retiring from the military, not to accept payments from foreign governments without advance approval from the Pentagon, according to documents released Thursday by a House committee.\nFlynn subsequently accepted more than $500,000 from a Russian government-owned broadcasting company and from a lobbying company representing Turkey, according to the committee.\nThe Pentagon inspector general is investigating whether Flynn “failed to obtain required approval” to accept those funds, acting Inspector General Glenn A. Fine wrote in an April 11 letter to the House Oversight Committee, which is investigating Flynn’s foreign business ties.\nRetired military officers found to have violated the prohibition on accepting foreign payments can be ordered to return pension payments during the time of the violations, according to the Pentagon.\nAdvertisement\nThe committee probe is one of several in Congress looking at whether any of President Trump’s current or former aides improperly coordinated with Russian operatives during last year’s presidential campaign. The FBI is conducting a separate counterintelligence investigation.\nEarlier this week, the House committee said that Flynn also failed to disclose the foreign payments when he signed a government disclosure form required to renew his government security clearance in early 2016, shortly after he had returned from Moscow.\n“These documents raise grave questions about why Gen. Flynn concealed the payments he received from foreign sources after he was warned explicitly by the Pentagon,” Rep. Elijah Cummings (D-Md.), the top Democrat on the committee, said Thursday.\nRep. Jason Chaffetz (R-Utah), the committee chairman, separately released a letter that asked the acting Army secretary for a “final determination” as to whether Flynn had violated the law regarding the foreign payments.\nMilitary officers, including retirees, are barred under the Constitution from accepting payments, gifts or items of value from foreign governments without congressional permission.\nAfter leaving the military, Flynn opened a government relations company and became a top advisor to the Trump campaign last year. Trump subsequently named him White House national security advisor.\nBut Flynn was forced to resign after less than a month when news reports revealed he had misled Vice President Mike Pence and other top officials about his conversations in December with Russia’s ambassador about easing U.S. sanctions on Russia.\nThese documents raise grave questions about why Gen. Flynn concealed the payments he received from foreign sources. — Rep. Elijah Cummings (D-Md.)\nThe Defense Intelligence Agency, the Pentagon spy agency that Flynn headed before he retired, said that it had found no evidence that Flynn had sought permission to accept foreign government payments.\nThe DIA did not locate any records of Flynn “seeking permission or approval for the receipt of money from a foreign source,” Christine Kapnisi, the agency’s acting head of congressional relations, said in an April 11 letter to the House committee.\nFlynn accepted a $33,750 fee to attend a December 2015 gala in Moscow sponsored by RT, a Russian state-run TV network, and to attend a lunch where he sat beside Russian President Vladimir Putin.\nFlynn’s company, Flynn Intel Group, also received $530,000 last fall — at the height of the U.S. presidential campaign — for work that benefited the government in Turkey, the House committee found. Flynn retroactively disclosed that work last month on a federal disclosure form.\nFlynn was reminded when he retired that accepting unauthorized payments from foreign governments was prohibited, according to the DIA letter.\nHe “was advised of the legal restrictions concerning foreign compensations and instructed to report any potential receipt of compensations in advance,” DIA said.\nFlynn’s attorney, Robert Kelner, said his client briefed DIA before and after the Moscow event and that his appearance was arranged by a firm Flynn had retained to set up speaking events.\n“General Flynn provided two briefings to the Department — one before and one after” his trip to Russia, Kelner said in a statement. “The Department was fully aware of the trip.”\ndavid.cloud@latimes.com\nTwitter: @davidcloudLAT\nALSO\nWikipedia co-founder Jimmy Wales says he has a plan to fix fake news\nPresident Trump has backed off many of his provocative foreign policy promises\nThe mainstream and conservative media are living in different worlds. So are those who read them",
    "label": 2
}