{
    "index": 239,
    "text": "Washington (CNN) It's only been two days since its debut, but already reviews for Ivanka Trump's latest book, \"Women Who Work: Redefining the Rules for Success,\" are in.\nThey're not great. In fact, some are downright brutal. A sampling:\nIt gets an average 1.2 stars on BarnesandNoble.com.\nOver on Amazon.com, there's no middle ground. People either love it or hate it. Thirty-nine percent give the book, which is a guide for working women, five out of five stars. Two percent give it four stars, one percent give it three stars, and 0% give it two stars -- however a whopping 58% give it one star, the lowest rating.\nFor her part, Trump is playing up the positive, posting on her Instagram page Thursday morning a video of herself dancing at home with her two youngest children, with a caption touting \"little moments\" and a link to an article about her book in Working Mother magazine.\nHer family is also rallying around her, posting up a storm of proud and complimentary messages, some with links to buy the book, on their own social media pages.\nI'm so proud of my big sister @IvankaTrump on the launch of her #WomenWhoWorkBook! I can't wait to start reading it! 📖 A post shared by Tiffany Ariana Trump (@tiffanytrump) on May 2, 2017 at 7:15pm PDT\nTrump staffer Lynne Patton, who works in the White House as a senior adviser and director of public liaison, went the extra mile, posting a shot of herself and friends reading Trump's book in the lobby of the Trump International Hotel in Washington.\nMy favorite girls. At our favorite hotel. With our NEW FAVORITE BOOK! 😍📚 #WomenWhoWork A post shared by 🇺🇸 lynnepatton (@lynnepatton) on May 3, 2017 at 4:59pm PDT\nEven Trump's ex-stepmother, Marla Maples, got in on the book support campaign.\nLook who I spied in Atlanta airport today ✨So happy to share @ivankatrump #WomenWhoWorkBook Learn more at womanwhowork.com on how proceeds will benefit initiatives for women 💕🌷 A post shared by Marla Maples (@itsmarlamaples) on May 3, 2017 at 5:46pm PDT\nTrump is donating profits and the remaining portion of her book advance to charities, including Boys & Girls Clubs of America and The National Urban League, via her Ivanka M. Trump Charitable Fund.\nAdditionally, prior to the book's release, Trump said she would abstain from overt promotion due to ethics guidelines in her new role as special adviser to her father.\nIn a statement on her Facebook page, Trump wrote:\n\"In light of government ethics rules, I want to be clear that this book is a personal project. I wrote it at a different time in my life, from the perspective of an executive and an entrepreneur, and the manuscript was completed before the election last November. Out of an abundance of caution and to avoid the appearance of using my official role to promote the book, I will not publicize the book through a promotional tour or media appearances.\"\nThe reviews may not matter -- Trump's last advice guide, 2010's \"The Trump Card: Playing to Win in Work and Life,\" made it to The New York Times bestseller list.",
    "label": 2
}