{
    "index": 6,
    "text": "— -- As reporters for ABC News, our journey covering now-President Donald Trump began with on the campaign trail, where we covered his opponents during the primaries. Ever since, it has been the story of our careers, unlike anything we have previously reported on. The 2016 race featured two completely different candidates, and expectations for a Hillary Clinton win. Now, Trump's 100 days have represented a true shakeup in Washington, D.C.\nTrue to his campaign and life leading up to moving into 1600 Pennsylvania Avenue, President Trump has proven anything but predictable.\nThe following ABC News Reporters' Notebook includes a few highlights from our firsthand accounts of the days that have defined and sometimes rocked the young administration.\nJan. 20 – 4:30 a.m.\nI step out of my Uber a couple of blocks from 1600 Pennsylvania Avenue, the closest I can get to the White House because of beefed-up security on Inauguration Day. I walk over to take my place in line with the other journalists waiting to move through the extra layer of magnetometers that the Secret Service has set up for the day.\nThe feeling of history is palpable in the dark, early morning hours, and the sun would soon rise on President Barack Obama's final morning in the White House. By sunset, the presidential mansion would be home to a new resident: President Donald J. Trump.\n-Jordyn Phelps\nJan. 20 – 1:00 p.m.\nAn eerie state of silence and emptiness permeates the West Wing.\nThe wall in the press office that was decorated with newspaper clippings of pinnacle moments from the Obama administration –- the killing of Osama bin Laden and other major milestones -- is now just a blank space.\nThe frames throughout the West Wing that once featured photographs of Obama and administration officials now hang empty on the wall.\nThe offices and desks once occupied by the familiar faces of Obama's press aides are empty as well, soon to be filled with new, fresh-faced government employees.\nBut for a couple of hours at least, the White House is empty of its usual gatekeepers and occupants.\n-Jordyn Phelps\nPresident Donald Trump takes reporters questions during a news conference announcing Alexander Acosta as the new Labor Secretary nominee in the East Room at the White House on February 16, 2017. Getty Images\nFeb. 13 - 5:00 p.m.\nReporters are gathered outside of Sean Spicer's office, trying to find out from the White House press secretary if the president continues to have confidence in his embattled national security adviser, Michael Flynn, amid revelations that he misled Vice President Mike Pence.\nAfter Spicer's door closes, it appears we're in for a long wait.\nBut then, the president unexpectedly walks by -- apparently making his way from the Oval Office to the White House residence.\nReporters fumble with their phones to record the moment, as the president pauses by a framed photo on the wall from his inauguration the previous month.\n\"That's amazing,\" the president says, pointing to the crowds captured in the framed moment in time. \"Where did all these people come from?\"\nThough the president is eager to talk about crowd sizes, he declines to answer our questions about whether he continues to trust his national security adviser.\nLater that evening, Flynn resigns.\n-Jordyn Phelps\nMarch 4 - 6:35 a.m.\nThe sun is just rising and the palm trees are swaying on what seems to be a calm Saturday morning in Florida.\nAfter picking up some morning caffeine for my correspondent and crew ahead of \"Good Morning America,\" I am balancing coffees in one hand and holding a car door open with the other.\nMy phone buzzes with a notification that the president has just tweeted the following:\n@realDonaldTrump \"Terrible! Just found out that Obama had my \"wires tapped\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!\"\nI put down the coffees, partly spilling one in the process, and notify the network of the new tweet as quickly as my fingers can type on my iPhone. I then reach out to the president's press secretary and his deputy to see if the White House can provide any guidance or clarification on the bombshell accusation ahead of \"GMA.\"\nThat tweet is just the first in a rapid-fire succession from the president that morning. But then the president goes quiet. And so does the entire White House.\nNone of my usual sources at the White House answer my phone calls or emails that day. The silence is deafening.\nI spend the rest of my day holed up in my West Palm Beach hotel room, furiously trying to get in touch with someone, anyone, in the president’s orbit who could explain what evidence the accusations were based on. That question remains unanswered to this day.\n-Jordyn Phelps\nWhite House spokesman Sean Spicer speaks to the press aboard Air Force One as President Donald Trump returns to Washington,DC from Philadelphia on January 26, 2017. AFP/Getty Images\nMarch 15 - 8:45 a.m.\nI arrive at Andrews Air Force Base for my first trip on Air Force One with Trump. It's a cold, blustery day and we are about to embark on what feels just like a campaign swing -- Washington D.C. to Michigan to Tennessee and back -- hitting two states and seven different events.\nIt's a strange feeling. We are only two months into the Trump presidency and reporters are en route to a number of official events followed by the president’s second campaign rally of his presidency -- but this time, we're not on the campaign plane.\nI am \"pool\" reporter on this trip, which means I'm responsible for alerting every network (NBC, ABC, Fox, CNN and CBS) of the president's every movement and any editorial information if he makes a newsworthy announcement. That task can range from benign and routine to daunting and exhilarating.\n\"AF1 is wheels up to Detroit at 11:18 AM. Flight time about 1 hr 20 min. In addition to the pool, Tucker Carlson from Fox is on board AF1 today along with Mark Halperin and a camera crew. Sean Spicer came back to say hello before takeoff,” I email out to all of the networks.\n-Katherine Faulders\nMarch 15 - 1:16 p.m.\nThe president's motorcade arrives at the American Center for Mobility in Ypsilanti, Michigan.\nAt 1:55 p.m., we enter the venue and observe the president as he inspects 11 different American-manufactured vehicles before holding a roundtable with CEOs and union workers.\nEleven days later, the president has still not responded to questions about his bombshell accusation that the Obama administration wiretapped Trump Tower.\nThe roundtable concludes at 2:33 p.m. \"Mr. President, do you plan to apologize to the former president for your wiretapping accusations?\" I shout, my voice echoing through the warehouse.\nHe ignores me, turns around and walks out of the room.\n-Katherine Faulders\nMarch 15 - 3:47 p.m.\n\"AF1 is wheels down at 3:47 PM. Spicer gaggled mid-flight. Will send notes shortly,\" my email to the networks reads.\nWe've arrived in Nashville, Tennessee, for a campaign rally. The motorcade weaves through large crowds of mostly supporters, but some protesters as well. Then, news breaks that a Hawaii judge has issued a nationwide temporary restraining order against the latest iteration of the president's travel ban. We need to get a reaction from the White House.\nI spot Sean Spicer -- but he is mobbed by the president's supporters clawing to get a photo with the newly-minted, cable television-famous White House press secretary. He comes into the \"press pen,\" as we call it, and offers no comment on the judge's order.\nBut leave it to Trump. Coming out swinging, the president goes off -- and the crowd eats it up. Breaking the news to his supporters, he says the judge blocked \"a watered-down version of the first order ... that should have never been blocked to start with.\"\nThe crowd goes wild, thousands booing and hurling insults at a federal judge. Trump then tears into Clinton, and eventually, the crowd revives the ever-familiar campaign chant of \"Lock her up! Lock her up!\"\n127 days after the election, I wonder: was it ever truly over?\n-Katherine Faulders\nMarch 15 - 10:15 p.m.\nA dreary-eyed press corps is aboard Air Force One. Finally, a moment to exhale and for some, a brief moment of shut eye.\nNot so fast -- I spot a figure ahead of us with a red tie reflecting off the wall of the cabin. I feverishly scramble for my notebook, quickly scanning through the day's news in my head. In the process, I spill my tea all over myself. Notepad in hand, I start recording audio as I look up.\n\"Everything good, everything OK? That was quite an event,\" the president says of the rally.\nTrump tells us he'll be doing a lot more campaign rallies, citing the \"great spirit\" of his crowd in Nashville. He tells us Republicans will come up with a plan on health care, but says \"nothing's easy.\"\nIt's a quick visit that feels like an eternity. I write up the president's remarks verbatim for the remainder of the flight before I'm able to exhale for good this time. We land at 10:34 p.m. The president is back at the White House at 11:01 p.m.\n-Katherine Faulders\nApril 7 - 11:00 a.m.\nJudge Neil Gorsuch's swearing-in at the White House is a high point following weeks of turmoil, including the Russia investigation and Trump's unfounded wiretapping claims.\nBut there is nothing that can dull the moods of multiple White House aides who seem to suggest that installing a conservative justice on the Supreme Court makes the tumultuous campaign worth it.\nIt's a beautiful, sunny day in Washington and I make my way into the White House Rose Garden. The garden is in full bloom. To my right I spot Spicer, smiling and mingling with guests. Straight ahead I see the president's chief of staff, Reince Priebus, who gives me a wave.\nThe sitting Supreme Court justices begin to file in, sitting in the front row along with the wife of late Supreme Court Justice Antonin Scalia.\nAs I frantically type notes on my phone, it would be easy to overlook the history being witnessed by millions on the other side of the camera. The president, though, appears right at home -- used to the spotlight, and very much aware of the gravity of the moment and what it potentially means for the future of the American justice system.\nThe administration still points to this as the seminal achievement of Trump's first 100 days. The White House marks it as an early legislative victory, despite the upheaval of Senate rules that was needed to make it happen.\n\"I can say this is a great honor,\" the president says before adding, off script: \"I got it done in the first 100 days. That's even nice.\"\n-Katherine Faulders",
    "label": 3
}