{
    "index": 301,
    "text": "The economy stumbled at the start of 2017, expanding at its slowest pace in two years in a demonstration of the difficulty President Trump will have in boosting growth to a much stronger sustained level.\nTotal economic output, also known as gross domestic product, increased at just a 0.7% annual rate from January through March as consumer spending posted its worst performance in more than seven years, the Commerce Department said Friday in its first of three official estimates.\nThe economy grew at a 2.1% annual rate in the fourth quarter of last year.\n“Growth of less than 1% means the wheels are up but the economy’s engines cannot gain any altitude,” said Chris Rupkey, chief financial economist at Mitsubishi UFG Financial Group in New York.\n“Trump’s economics team needs to step up their game as the economy is starting out the year in a hole,” he said.\nAdvertisement\nCommerce Secretary Wilbur Ross said the report showed that the economy needed help from tax cuts and regulatory reductions promised by Trump.\n“Business and consumer sentiment is strong, but both must be released from the regulatory and tax shackles constraining economic growth,” Ross said.\nAnalysts had forecast a first-quarter slowdown, but the 0.7% growth was below expectations. It was the worst since the first quarter of 2014, when unusually bad weather in much of the country and a West Coast port dispute caused the economy to contract at a 1.2% annual rate.\nIn unveiling a tax overhaul plan this week that would slash business rates, Treasury Secretary Steven T. Mnuchin said the administration hoped that it would lead to sustained growth of 3% a year.\nBut economists said an aging U.S. population and unhealed scars from the Great Recession made that a stretch.\nFriday’s data highlighted the difficulties. Although consumer confidence has improved significantly since Trump’s election in November, that didn’t lead Americans to open their wallets after he took office.\nConsumer spending grew just 0.3% in the first quarter, down from 3.5% the previous quarter.\nThe slowdown was driven by a steep drop-off in purchases of long-lasting durable goods, such as automobiles, appliances and electronics. After an 11.4% increase in the fourth quarter, those purchases declined 2.5% in the first three months of this year.\nThe last time consumer spending was weaker was the fourth quarter of 2009, just six months after the Great Recession officially ended.\nOverall growth also took a hit from a decline in spending by federal, state and local governments. And unseasonably warm weather appeared to cause spending on utilities to drop.\n“A cold winter can lead to delays in construction activities. A warm one, as was the case this year, can produce lower utility bills,” said Brian Schaitkin, senior economist at the Conference Board.\n“Sky-high consumer confidence and rising wages suggest that spending should bounce back quickly during the rest of the year, driving the economy to overall growth of around 2% in 2017, in line with long-term trends,” he said.\nThere were some positive signs in an otherwise downbeat report.\nBusiness investment, which has been sluggish the last couple of years, increased sharply. The 9.4% increase was more than 10 times the previous quarter’s number and the best since the fourth quarter of 2013.\nThe change was driven by a ”significant surge” in oil and gas exploration and drilling as oil prices have rebounded, Ross said. .\nAnd U.S. exports increased 5.8% in the first quarter, reversing a 4.5% decline the previous quarter.\njim.puzzanghera@latimes.com\nTwitter: @JimPuzzanghera\nUPDATES:\n1:35 p.m.: This article was updated with comments from Commerce Secretary Wilbur Ross.\n6:50 a.m.: This article was updated with comments from Chris Rupkey of Mitsubishi UFG Financial Group and Brian Schaitkin of the Conference Board.\nThis article originally was published at 6:15 a.m.",
    "label": 3
}