{
    "index": 357,
    "text": "Targeting California’s recent record-low voter turnout, Gov. Jerry Brown on Saturday signed a measure that would eventually allow Californians to be automatically registered to vote when they go the DMV to obtain or renew a driver’s license.\nThe measure, which would also allow Californians to opt out of registering, was introduced in response to the dismal 42% turnout in the November 2014 statewide election.\nThat bill and 13 others the governor signed Saturday, will “help improve elections and expand voter rights and access in California,” Brown’s office said in a statement.\nSIGN UP for the free Essential Politics newsletter >>\nSome 6.6 million Californians who are eligible to register to vote have not registered, according to Secretary of State Alex Padilla, who supported the legislation as a way to increase voter participation.\nAdvertisement\n“The New Motor Voter Act will make our democracy stronger by removing a key barrier to voting for millions of California citizens,” Padilla said Saturday. “Citizens should not be required to opt in to their fundamental right to vote. We do not have to opt in to other rights, such as free speech or due process.”\nThe law takes effect Jan. 1, but the new registration process will not be offered until the state completes work on a new voter registration database called VoteCal, which is expected around June 2016, the time of the presidential primary election.\nCurrently, driver’s license applicants are asked whether they want to register, and if they do, they are supposed to be given a paper registration form to fill out, although activists say that does not always happen.\nThe new system would register applicants when they visit a Department of Motor Vehicles office to get a new license or renew an expiring one, unless they opt out, and without having to fill out a new paper form.\n“It’s removing the first barrier to voting, which is registration,” said Assemblywoman Lorena Gonzalez (D-San Diego), the bill’s author, on Saturday. “It’s going to lead to millions more Californians being registered to vote, which means more people we can talk to.”\nVoting rights activists, including CalPIRG Executive Director Emily Rusch, said the voter registration bill was much-needed medicine for a system that is ailing.\n“A well-functioning democracy depends on the participation of its citizens,” Rusch said, noting that the registration gap is most severe for young people. Only 52% of eligible youth 18-24 were registered to vote before the last election.\nBrown also signed a bill that permits county elections officials to offer conditional voter registration and provisional voting at satellite offices during the 14 days immediately preceding Election Day. The measure would make voting more convenient, according to Sen. Benjamin Allen (D-Santa Monica), the author of SB 439.\nAnother bill signed by the governor will make voting more convenient by allowing voters who use vote-by-mail ballots to drop them off at secure boxes to be located throughout the community before election day. Boxes at shopping malls and libraries would make it easier to cast ballots, officials say.\nThe measure by Sen. Fran Pavley (D-Agoura Hills) requires the secretary of State to develop guidelines for the use of drop-off boxes, including security measures, by Jan. 1, 2017.\nNEWSLETTER: Get the day’s top headlines from Times Editor Davan Maharaj >>\nPavley said there was some ambiguity in existing law that made her bill necessary.\nShe noted that in the election last November, Los Angeles County, which has 10 million residents, had one drop-off location.\n“This may have contributed to the fact that only 38% of voters in Los Angeles County used [vote-by-mai] -- nearly 20% lower than any other county in the state,” Pavley said.\nThe governor also signed a bill that will speed up election returns by allowing county elections officials to begin counting votes before the close of the polls on election day.\nAssemblyman Marc Steinorth (R-Rancho Cucamonga) introduced that bill, AB 363.\nBrown also approved a bill allowing Monterey and Sacramento counties to hold some all-mail ballot elections, joining San Mateo and Yolo counties in experimenting with the practice. That measure, AB 1504, was introduced by Assemblyman Luis Alejo (D-Watsonville).\nALSO\nCalifornia sets new rules for medical pot industry\nCiting past budget anxiety, Gov. Brown vetoes several new tax credits\nBrown vetoes transparency bills for troubled state utilities commission",
    "label": 3
}