{
    "index": 443,
    "text": "After House passage, the Senate is likely to start over on the health care bill\nShow Caption Hide Caption GOP health care bill passes house House OKs GOP bill erasing much of Obama's health care law, answering campaign pledge and sending measure to Senate. (May 4) AP\nWASHINGTON — The health care bill that Republican leaders pushed quickly through the House on Thursday is expected to undergo major changes in the Senate, where some moderate GOP senators have already come out against the legislation.\nThe Senate will review the House bill but will write its own version over the next few weeks, said Sen. Lamar Alexander, R-Tenn., chairman of the Health, Education, Labor and Pensions Committee.\n\"We want to get it right,\" Alexander said Thursday on the Senate floor. \"There will be no artificial deadlines.\"\nIf the Senate passes its own bill, the House will either have to approve the Senate version or negotiate a compromise with senators, Alexander said. Any compromise bill would need to be approved by both the House and Senate before being sent to President Trump to sign.\nHouse Republicans, who have been vowing to repeal and replace Obamacare since its passage in 2010, passed a bill Thursday to unravel many of the Affordable Care Act's popular consumer protections, do away with the mandate for individuals to maintain health insurance and end expanded Medicaid eligibility. The vote was hastily called after Republicans wooed moderates with a last-minute amendment to provide $8 billion to help patients with pre-existing conditions afford higher premiums.\nThe 217-213 vote underscored sharp divisions over the legislation, which is a long way from becoming law but still represents a major victory for House Republican leaders and President Trump. It comes less than two months after House Speaker Paul Ryan, R-Wis., was forced to cancel a vote on an earlier version of the bill because it did not have enough Republican support to pass. Not a single Democrat voted for the bill.\nRead more:\nUnlike House members, senators \"want to make sure we know what our bill costs,\" Alexander said. The House passed its legislation before the non-partisan Congressional Budget Office had time to analyze it to estimate what it would cost and how many Americans it would insure. CBO had estimated that the original House bill would have lead to 24 million fewer people having insurance by 2026, but it would cut federal budget deficits by $337 billion.\nSen. Rob Portman, a moderate Republican from Ohio, said Thursday he is worried about how the House bill could affect his constituents. Ohio is one of 32 states that expanded its Medicaid program for low-income residents under Obamacare.\n\"I’ve already made clear that I don’t support the House bill as currently constructed because I continue to have concerns that this bill does not do enough to protect Ohio's Medicaid expansion population, especially those who are receiving treatment for heroin and prescription drug abuse,\" Portman said in a statement. \"We have an opioid crisis in this country, and I’m going to continue to work with my colleagues on solutions that ensure that those who are impacted by this epidemic can continue to receive treatment.\"\nAt the same time, Portman said, Obamacare cannot be sustained as insurance premiums and deductibles \"continue their steep climb.\"\n\"Congress must take responsible action that lowers health care costs, but these changes must be made in a way that does not leave people behind,\" the senator said.\nSimilarly, Sen. Dean Heller, R-Nev., said he wants to repeal Obamacare \"in a way that benefits Nevadans, but I think that the current bill falls short.\" Nevada is one of the states that expanded Medicaid under Obamacare.\n\"I will not support it in its current form in the Senate, and am confident that what the Senate considers and approves will be different from the House bill,\" Heller said in a statement. \"We cannot pull the rug out from under states like Nevada that expanded Medicaid and we need assurances that people with pre-existing conditions will be protected.\"\nAnother moderate Republican, Sen. Susan Collins of Maine, said \"at this point, there seem to be more questions than answers about (the bill's) consequences.\"\n\"This is an extremely important debate with significant implications for millions of Americans,\" she said. \"We need to spend the time necessary to get this right and work to achieve the goal of expanding access to health care that is truly affordable and accessible.\"\nDemocrats are united against the Republican bill to replace Obamacare, and Republicans have a slim majority of just 52 senators. That means GOP leaders can afford to lose just two Republican votes. That would give them a 50-50 tie, which Vice President Pence could break in favor of the bill.\nRepublicans are using a budget procedure that allows them to pass the legislation with a simple majority of 51 votes rather than the 60-vote super-majority required to approve most major legislation. The procedure, called reconciliation, effectively stops Democrats from mounting a filibuster to block the bill.\nRead more:\nSenate Minority Leader Chuck Schumer, D-N.Y., appealed to his Republican colleagues Thursday to slow the process down and work with Democrats.\nHe said the House bill, despite the late addition of $8 billion, would still cause insurance premiums to go up 20% in the first few years while increasing average costs by more than $1,500 a year for middle-class Americans. He also criticized a provision that would allow insurers to dramatically increase what they could charge older Americans in comparison to younger consumers.\n\"It harms the American people in so many ways,\" Schumer said. \"It doesn't have to be this way. Republicans could drop these efforts for repeal, drop these attempts which are undermining our health care system and causing insurers to flee the marketplace, and work with Democrats. Our door is open.\"\nHouse members may not recognize their bill by the time the Senate gets done with it, said Jack Pitney, a political scientist at Claremont McKenna College in California.\n\"I think as this goes through the Senate and they have time to read this thing, in the end a lot of the House’s work will be undone,\" he said.\nHouse conservatives will have to decide whether the moderating changes the Senate is likely to make are more politically palatable to them that rejecting the chance to repeal Obamacare, Pitney said.\n\"The Senate's fix for the bill may end up looking a lot like Obamacare,\" he said.\nContributing: Deirdre Shesgreen and Michael Collins",
    "label": 3
}