{
    "index": 382,
    "text": "It’s a political gambit that President Trump seems to think will pay off: Let the federal government grind to a halt.\n“Our country needs a good ‘shutdown’ in September to fix mess,” he tweeted last week.\nThe unconventional proclamation from the unconventional president raised concern from both sides of the aisle.\nHis comments came as lawmakers agreed to a $1-trillion bipartisan budget bill that funds the federal government through September, which means another battle and potential government shutdown looms this fall.\nUnder a shutdown, thousands of federal employees would go without pay and national parks would close, among other things. In short: It will upset a lot of people.\nHere’s a look at the key players and fallout from recent government shutdowns.\nHow it happened\nIt’s simple — the battle over healthcare closed the government.\nThat year, House Republicans, angered by President Obama ’s Affordable Care Act , repeatedly offered resolutions during budget negotiations that would have defunded the healthcare law. These resolutions were rejected by the Democratic-controlled Senate , which led to a budget impasse.\nThe government shut down for more than two weeks after Congress was unable to agree on a budget for the new fiscal year, leaving nearly 800,000 federal employees out of work without pay.\nOn the political front, the ramifications went both ways.\nMembers of the bipartisan budget conference Sen. Jeff Sessions (R-Ala.), Rep. Paul D. Ryan (R-Wis.), Sen. Patty Murray (D-Wash.) and Rep. Chris Van Hollen (D-Md.) speak to the media the day after Congress voted to ending a 16-day government shutdown. (Win McNamee / Getty Images)\nWinners\nSen. Harry Reid (D-Nev.)\n(Alex Wong / Getty Images)\nThe then-Senate majority leader was a vocal Democratic critic of Republican-led efforts to defund President Obama’s healthcare bill. He relentlessly castigated Republicans for their tactics to defund Obamacare, which ultimately led to the shutdown.\n“You know with a bully you cannot let them slap you around, because they slap you around today, they slap you five or six times tomorrow. We are not going to be bullied,” Reid told reporters.\nIn the end, Reid came out of the shutdown with a bolstered reputation as a fighter of Democratic causes and earned plaudits from Obama.\nObamacare\n(Gary Friedman/Los Angeles Times)\nAt the time, the botched rollout of the healthcare law drew daily headlines. Web sites for healthcare exchanges didn’t work and the administration had few answers. Still, the healthcare law was able to remain intact and public scorn focused on Republicans as the government remained shuttered for 16 days and federal employees nationwide stayed home. Republicans thought their efforts would prove fruitful.\nSen. John McCain (R-Ariz.)\n(T.J. Kirkpatrick / Getty Images)\nIn the months and weeks leading to the shutdown, McCain served as a voice of reason for the Republicans. He insisted that it would be unwise for the party to allow a shutdown over Obamacare.\n“I campaigned in 2012 all over this country for months: ‘Repeal and replace Obamacare.’ That was not the mandate of the voters. If they wanted to repeal Obamacare, the 2012 election would have been probably significantly different,” he said at the time.\nUltimately, his efforts faltered as Republicans charged ahead with efforts to defund Obamacare and the government shutdown.\nLosers\nHouse Speaker John A. Boehner (R-Ohio)\n(Alex Wong / Getty Images)\nHe failed to rein in the most conservative grassroots wing of his party. Boehner was the middle man of sorts in negotiations between Democrats, moderate Republicans and conservative activists. Two years later, he resigned because of the strong opposition he faced from the Republican caucus.\nSen. Ted Cruz (R-Texas)\n(Andrew Burton / Getty Images)\nWhile Cruz raised his national profile as a staunch critic of Obamacare, he also made a lot of enemies. Weeks before the shutdown he delivered a 21-hour talkathon on the Senate floor, assailing the health care law — a move that drew scorn from Democrats and Republicans alike. Cruz’s vocal opposition to the law helped establish him as a force within the GOP grassroots and set him up for a presidential run in 2016.\nDebbie Wasserman Schultz (D-Fla.)\n(Carolyn Kaster / Associated Press)\nPublic opinion polls consistently showed that Republicans were blamed for the government shutdown. Even so, the former Democratic National Committee chairwoman was unable to turn that into victory in the 2014 midterm. Many Democrats fault her leadership as a factor in the party’s sweeping losses in the midterm election.\nHow it happened\nThis battle over funding Medicare , public education and environmental initiatives pitted President Clinton against Republican House Speaker Newt Gingrich . It turned into the longest government shutdown in the country’s history. The shutdown came in two phases, with government services being shuttered from Nov. 14-19, 1995; then from Dec. 16 until Jan. 6, 1996. In total, the government closed for 27 days.\nPresident Clinton and bipartisan leaders meet at the White House on Dec. 30, 1995, for talks on the federal budget. (Greg Gibson / Associated Press)\nWinner\nPresident Clinton\n(Marcy Nighswander / Associated Press)\nHe stood firm in his battle with the Republican-controlled Congress. Clinton wanted a budget that increased expenditures on, among other things, Medicare and public education, but Republicans wanted to slow government spending. This led to months of negotiations — the government closing, opening, then closing again — and through it all, Clinton’s public approval ratings dipped only slightly. He easily won reelection in November 1996.\nLoser\nHouse Speaker Newt Gingrich (R-Ga.)\n(J. Scott Applewhite / Associated Press)\nAfter sweeping gains in the 1994 midterm election, Republicans were emboldened and ready for a showdown.\n\"He can run the parts of the government that are left, or he can run no government,\" Gingrich told reporters weeks before the first shutdown. \"Which of the two of us do you think worries more about the government not showing up?\"\nNews reports at the time also noted that Gingrich was open to a shutdown after Clinton made him exit the rear of Air Force One after the two attended the funeral of slain Israeli leader Yitzhak Rabin. The comments made the Republican leader appear petty. In the end, after weeks of a shutdown, Republicans ultimately conceded to Clinton and Democrats.\nWhat’s happening now\nLast week Congress passed a $1-trillion budget that funds the federal government through September. However, the budget bill does not allocate funds for Trump’s much-promised border wall. It’s the first bipartisan piece of legislation of the Trump presidency and funding for his signature proposal is nowhere to be found. The bill, however, does have funding for border security and increases to defense spending — both of which were touted as wins by the Trump administration.\nSenate Majority Leader Mitch McConnell (R-Ky.), flanked by Sen. Cory Gardner (R-Colo.), Sen. John Barrasso (R-Wyo.) and Sen. John Thune (R-S.D.), speaks to the media about the recent spending bill that averted a government shutdown. (Aaron P. Bernstein / Getty Images)\nKey players\nPresident Trump\nIt’s clear Trump does not like to lose and does not like bad headlines. By all accounts, Trump and his policies did not come out on top in the budget deal.\nTrump blamed the Senate rules, which require 60 votes to pass most legislation, for the exclusion of key priorities from the spending bill.\nThis has in turn led some conservatives to push for Trump to support a government shutdown if Congress does not heed his policies this fall. Trump has always trusted his gut instinct in politics — so far it’s seemed to benefit him — and his comments will be closely watched this fall.\nHouse Speaker Paul D. Ryan (R-Wis.)\n(J. Scott Applewhite / Associated Press)\nHe's often had to stake out a position when Trump tweets. Indeed, this time was no different. Ryan alluded to Trump’s qualms with Senate rules.\n“Look, we’ve got a long ways to go between now and September, but I share the president’s frustration,” Ryan told reporters. “What a lot of people in America don’t realize is appropriations bills, they take 60 votes to pass. They can be filibustered. So, all appropriations bills therefore have to be bipartisan because Democrats can always filibuster an appropriations bill. Having said all that, I feel very good about the wins that we got with the administration in this bill.”\nSenate Minority Leader Charles E. Schumer (D-N.Y.)\n(J. Scott Applewhite / Associated Press)\nHe’s Trump’s chief critic in Congress and warned the president that a government shutdown is not wise.\n“The president's threat to shut down the government in September is just a very, very bad idea because it would hurt so many average folks,” Schumer said recently. “I strongly urge my colleagues, and they have already ... said they have no desire to shut down the government. That is not the way to govern. That is not the way to come up with bipartisan compromise.”\nVoters\nPublic opinion is not on Trump’s side when it comes to talk about a government shutdown.\nIn a Politico/Morning Consult poll released in April, 65% of voters said that Congress should “take all necessary steps to avoid a government shutdown.”\nOther polls show similar disapproval among voters toward a government shutdown.\nSupport our journalism Already a subscriber? Thank you for your support. If you are not, please consider subscribing today. Get full access to our signature journalism for just 99 cents for the first four weeks.\nkurtis.lee@latimes.com\nTwitter: @kurtisalee",
    "label": 3
}