{
    "index": 373,
    "text": "Good morning, and welcome to the Essential California newsletter. It’s Wednesday, April 26, and here’s what’s happening across California:\nTOP STORIES\nThe riots this time\nNearly 6 out of 10 Angelenos think another riot is likely in the next five years, increasing for the first time after two decades of steady decline, according to a Loyola Marymount University poll of Los Angeles residents that has been taken every five years after the 1992 disturbances. That’s higher than any other year except for 1997, the first year the survey was conducted, and more than a 10-point jump compared with the 2012 survey. Los Angeles Times\nNames to remember\nWhen the riots began 25 years ago, two names were on everyone’s mind: Rodney King and Latasha Harlins. King survived his beating at the hands of police; Harlins, 15 at the time, was shot by a South Korean-born shopkeeper who received a light prison sentence for his actions. Los Angeles Times\nAdvertisement\nPlus\n— Former Los Angeles Times columnist Sandy Banks breaks down how the L.A. riots changed everything and nothing. A&E\n— L.A. Times columnist Steve Lopez writes that in today’s South L.A., struggling residents now face a pressure point they didn’t feel in 1992: gentrification. Los Angeles Times\n— The riots as reflected in film. Los Angeles Times\n— The youngest riot victim: a baby born with a bullet wound. Fox LA\nWith the 25th anniversary of the L.A. riots fast approaching, your Essential California team wants to hear your memories of those chaotic days. Email your memory to benjamin@latimes.com, and please keep it concise.\nAudit criticizes UC system\nA blistering and contested state audit released Tuesday found that the University of California system’s administration pays top workers salaries significantly higher than that of similar state employees, has provided millions of dollars in benefits not typical to the public sector and failed to disclose to the Board of Regents and the public that it had $175 million in budget reserve funds. Los Angeles Times\nSanctuary Cities 1, Trump 0\nA federal judge placed a nationwide hold Tuesday on President Trump’s order to strip funds from municipal governments that refuse to cooperate fully with immigration agents. The San Francisco-based judge, William H. Orrick III, said Trump’s order unconstitutionally infringed on the rights of local governments. This ruling comes after San Francisco and Santa Clara County filed lawsuits challenging the order. The suits argued the directive violated the 10th Amendment, which protects states from federal government interference. Los Angeles Times\nL.A. STORIES\nCity of Stars: Los Angeles celebrated “La La Land” Day with aerial dancers, a jazz band and Mayor Eric Garcetti playing a song from the movie on the piano. Los Angeles Times\nCashing in: The Banc of California’s former CEO was paid more than $10 million last year, which is four times the amount he was paid in 2015. Orange County Register\nRaucous town hall: A town hall meeting sponsored by U.S. Rep. Ted Lieu devolved into chaos when a bunch of Donald Trump supporters disrupted the predominantly Democratic crowd calling for the president’s impeachment. L.A. Daily News\nIMMIGRATION AND THE BORDER\nBreaking a treaty? Antonio Rascón, chief Mexican engineer on the International Boundary and Water Commission, said in an interview with NPR that some border wall proposals he has seen would violate a 47-year-old treaty governing the shared waters of the Rio Grande. NPR\nNot so fast: Trump has backed off the fight for the funding of the proposed border wall for now. The White House says they’ll regroup in the fall. Los Angeles Times\nPOLITICS AND GOVERNMENT\nNew revelation: Documents reportedly show the lease Derick Almena and a partner signed for the Ghost Ship warehouse planned an illegal use from the start — an artist collective that was not allowed under zoning laws — and that the building owner had approved the use. The Mercury News\nSome students must be happy: Because of a labor dispute at a Northern California elementary school, students don’t have any homework. Fox40\nA scientist runs: A former chemistry professor at Cal State Fullerton will challenge longtime Rep. Ed Royce (R-Fullerton). Phil Janowicz now runs an education consulting firm and is a first-time candidate. Los Angeles Times\nAnother scientist runs: Volcano scientist Jess Phoenix is running for Congress in the 25th Congressional District. She decided to run after Trump was elected and says that the current representative, Republican Steve Knight, has mishandled environmental problems and disregarded the science needed to address them. Washington Post\nCRIME AND COURTS\nTale of two bails: A California woman whose friends raised $35 million for her bail is under house arrest, while a man who can’t afford $75,000 bail must decide whether to plead guilty or stay behind bars. The Guardian\nA fatal chase: A driver was shot and killed by Long Beach police after a high-speed pursuit came to an end Tuesday morning in Bellflower, authorities said. Los Angeles Times\nBlood sport: Behind barn doors in Fresno County were nearly 100 roosters, all them taken from an alleged cockfighting ring in Kerman. ABC 30\nTHE ENVIRONMENT\nCheck out these cacti! We’ve seen plenty of weeds pop up after the rains, but the cacti of California are also shining brighter than ever. New York Times\nCALIFORNIA CULTURE\nNew mural fun: An “Ed Ruscha Monument” mural will arrive in May. The massive mural will go up on the side of the American Hotel at 303 S. Hewitt St. in the Arts District. L.A. Downtown News\nFor sale! You can live in the home in which Marilyn Monroe was found dead in 1962. It’s going to cost you $6.9 million to move into the Brentwood home, which is described as an “authentic 1929 Hacienda.” Los Angeles Times\nA different wine country: Baja California isn’t too far of a drive, and its wine country is something to behold. The vineyards and culinary marvels beckon in the austere backcountry of the Valle de Guadalupe in Mexico. New York Times\nWithout the NEA: Piece by Piece is a nonprofit organization that provides low-income and previously homeless people with free mosaic art workshops that help them build skills, self-confidence and, eventually, income. If the budget of the National Endowment for the Arts is slashed, the program will probably go kaput. Los Angeles Times\nCALIFORNIA ALMANAC\nLos Angeles area: sunny Wednesday, partly cloudy Thursday. San Diego: partly cloudy Wednesday and Thursday. San Francisco area: showers Wednesday, cloudy Thursday. Sacramento: cloudy Wednesday, partly cloudy Thursday. More weather is here.\nAND FINALLY\nToday’s California Memory comes from Dean Paul:\n“It was Wednesday, April 29, 1992 — a seemingly normal workday. I was working at Hughes Aircraft in El Segundo. We started to hear that due to the Rodney King verdicts, civil unrest was breaking out. From the rooftop of our 12-story building, we could see smoke from fires to the east. After some time, it was announced that we should all go home early to be with our families. I headed west on Grand Avenue to take Vista del Mar north toward my home in West L.A. It took over two hours to drive one mile, then traffic improved somewhat. It was even scarier watching the events on TV at home!”\nIf you have a memory or story about the Golden State, share it with us. Send us an email to let us know what you love or fondly remember about our state. (Please keep your story to 100 words.)\nPlease let us know what we can do to make this newsletter more useful to you. Send comments, complaints and ideas to Benjamin Oreskes and Shelby Grad. Also follow them on Twitter @boreskes and @shelbygrad.",
    "label": 3
}