{
    "index": 299,
    "text": "Secretary of State Rex Tillerson on Friday urged the United Nations Security Council to impose new economic sanctions on North Korea, warning of a “catastrophic” outcome if the world fails to block Pyongyang’s rush to develop a nuclear warhead that it can put atop a long-range missile.\nIn his debut speech at the U.N., Tillerson also urged Security Council members to further isolate Kim Jong Un’s government by suspending or downgrading diplomatic relations with Pyongyang, and threatened to slap penalties on third-party countries that don’t comply with existing sanctions.\nHours after Tillerson spoke, North Korea’s military launched a ballistic missile from north of Pyongyang that apparently crashed nearby or in waters just offshore. U.S. Pacific Command spokesman Cmdr. David Benham said in a statement that the missile “did not leave North Korean territory.”\nThe White House said President Trump was briefed on the launch. It’s not known if the missile was meant as a rebuke to the White House, or was just the latest of at least seven short- and mid-range missile tests Pyongyang has conducted this year, several of which have failed.\nEither way, it served to keep nerves on edge in Washington and other capitals over North Korea’s growing nuclear capabilities, a threat that the White House considers its most immediate international concern.\nAdvertisement\n“Failing to act now on the most pressing security issue in the world may bring catastrophic consequences,” Tillerson told the Security Council. “Additional patience will only mean acceptance of a nuclear North Korea.”\nHe said the threat of a North Korean nuclear attack on Seoul or Tokyo is real and that it is “likely only a matter of time” before Pyongyang gains the ability to launch a nuclear-armed missile at the U.S. mainland, probably California.\nTillerson’s address to foreign ministers from the 14 other nations in the Security Council was part of a White House campaign to ratchet up pressure on Pyongyang before it can conduct its sixth underground nuclear test or test-launch its first intercontinental ballistic missile.\nHe spoke a day after President Trump warned that a “major, major conflict” with North Korea was possible, although he said he was seeking a diplomatic solution.\n“There is a chance that we could end up having a major, major conflict with North Korea. Absolutely,” Trump told Reuters in an interview ahead of his 100th day in office on Saturday. “We’d love to solve things diplomatically but it’s very difficult.”\nThe standoff over North Korea’s determined push to expand its nuclear arsenal and to develop more powerful missiles has sparked tensions since the mid-1990s, and previous diplomatic efforts under Presidents Clinton, Bush and Obama all ultimately failed.\nU.S. arms experts believe Pyongyang is within several years of building a nuclear warhead small enough and robust enough for a missile to carry it across the Pacific, and then survive the intense heat of reentry into the atmosphere.\nThe Pentagon sent an aircraft carrier strike force and a nuclear submarine to northeast Asia in the past week in what U.S. officials described as a show of support for allies South Korea and Japan, as well as a warning to North Korea about going too far.\nTrump’s national security team also briefed members of Congress, including an unusual briefing in a White House annex for the 100 members of the Senate.\nMost Pentagon planners say Kim’s military, which has thousands of artillery pieces in range of Seoul, South Korea’s capital, could inflict significant damage on the city of 10 million if hostilities broke out. Korean missiles also can reach Japan.\nThe White House has sought to convince China to do more to rein in North Korea, its neighbor and communist ally, and Trump has repeatedly praised Chinese President Xi Jinping for his cooperation on the issue.\nAfter the missile launch, Trump on Friday tweeted: “North Korea disrespected the wishes of China & its highly respected President when it launched, though unsuccessfully, a missile today. Bad!”\nNorth Korea disrespected the wishes of China & its highly respected President when it launched, though unsuccessfully, a missile today. Bad! — Donald J. Trump (@realDonaldTrump) April 28, 2017\nBut Tillerson found little support at the U.N. from China and Russia when he called for new penalties on entities and individuals that support North Korea’s nuclear and missile programs, and for nations to better enforce sanctions already in place, said to be among the most stringent ever used.\nTillerson called on nations to sever trade with Pyongyang, to discontinue guest worker programs involving North Koreans, and to ban imports, especially coal. China, which is the outlet for 90% of North Korea’s foreign trade, suspended all coal imports from the country in February.\nThe U.S. “would much prefer countries and people in question own up to their lapses and correct their behavior themselves, but we will not hesitate to sanction third country entities and individuals supporting [North Korea’s] illegal activities,” Tillerson said.\nChina and Russia are both permanent members of the Security Council and thus could veto additional sanctions.\nTheir diplomats cautioned against Washington’s threat to use military force. China’s foreign minister called for resuming long-stalled negotiations to ease the crisis.\n“It is necessary to put aside the debate over who should take the first step and stop arguing who is right and who is wrong,” Chinese Foreign Minister Wang Yi told the Security Council. “Now is the time to seriously consider resuming talks.”\nTillerson didn’t rule out future talks, but he said North Korea had to “exhibit a good-faith commitment” to abide by existing U.N. resolutions by abandoning its nuclear program, something Kim’s government has sworn it will not do.\n“We will not reward their bad behavior with talks,” he said.\nTillerson repeated a recent flurry of U.S. warnings that the Trump administration is prepared to use military force, if necessary, to constrain North Korea from developing a nuclear threat.\n“All options for responding to future provocation must remain on the table,” Tillerson said. “Diplomatic and financial levers of power will be backed up by a willingness to counteract North Korean aggression with military action if necessary.”\ntracy.wilkinson@latimes.com\nFor more on international affairs, follow @TracyKWilkinson on Twitter\nALSO\nNorth Korea’s latest missile test fails, U.S. says\nWe went to North Korea. You asked hundreds of questions. Here’s what we found\nFull Senate, in rare move, goes to White House grounds for classified North Korea briefing\nUPDATES:\n5:45 p.m.: This article was updated with a tweet by President Trump.\nThis article was originally published at 3:55 p.m.",
    "label": 3
}