{
    "index": 475,
    "text": "Indiana's alternative Medicaid program shows tradeoffs of charging recipients for care\nShow Caption Hide Caption Verma sworn in to run Medicare, Medicaid The federal agency that oversees health insurance programs for tens of millions of American consumers has a new leader. VP Pence has sworn in Seema Verma as administrator of the Centers for Medicare and Medicaid Services. (March 14) AP\nWASHINGTON – More than half the low-income people who qualified for Indiana’s alternative Medicaid program failed to make a required monthly payment for the top tier of benefits – a key feature of the program Vice President Mike Pence insisted on as a condition to expanding the health care program when he was Indiana’s governor.\nThat's according to a new evaluation of the Healthy Indiana Plan, a program designed by Indiana health care consultant Seema Verma, who – as the new administrator for the Centers for Medicare and Medicaid Services – can now grant other states permission to impose similar monthly fees.\nOpponents say the department of Health and Human Services should not allow other states to do this, because this study and other research has shown requiring poor people to pay is a barrier to care.\nHouse Republicans passed a bill to repeal and replace the Obama-era Affordable Care Act last week, but its future remains uncertain. If progress on a health care plan stagnates, the Trump administration will focus even more on trying to make changes through state waivers – and Verma, along with HHS Secretary Tom Price, have already told states they want to be as permissive as possible.\nYet critics of Indiana’s program said the new evaluation shows Indiana’s complicated program doesn’t work well and shouldn’t be used as a model for other states. “It’s time to really step back and think about this as an experiment and whether it’s successful,” said Judy Solomon, vice president for health policy at the left-leaning Center on Budget and Policy Priorities.\nFor its part, the state says only a small share of those who missed a payment ended up losing their health care for the state’s required six-month lockout period. Most ended up in a lower tier of coverage with fewer benefits and some cost-sharing requirements. “We’ve seen relatively few people actually be subject to the six-month lockout,” said Joe Moser, Indiana’s Medicaid director.\nRead more:\nVerma and Price have encouraged states to seek permission to try new ways of running Medicaid, which is jointly financed by states and the federal government.\nOther states appear to be interested. Kentucky, Maine and Wisconsin are actively exploring requiring monthly payments for Medicaid recipients.\nIndiana’s program was seen as pushing the limits on what states could do when it was approved by the Obama administration on a three-year trial basis in 2015. Indiana has asked the Trump administration to extend the program through 2021.\nRecipients must pay between $1 to $100 a month – depending on their income – to enroll in a higher coverage tier, which comes with dental and vision benefits. The HIP Plus level is the only program available to those above the poverty line, while those below can still qualify for the HIP Basic level.\nOf the 590,315 Hoosiers determined eligible for Medicaid during the 22 months after Indiana expanded eligibility, 55 percent either never made the first payment or missed one while on the program.\nNearly nine in ten ended up in the lower-tier plan as a result, according to an evaluation done for the state and submitted to the federal government.\nThe next largest share – 14% – never enrolled.\nAnother 4% were unenrolled because their income was too high to qualify for the lower tier.\n“The evaluation makes clear that Healthy Indiana's complicated use of premium payments is not working,” said Joan Alker, executive director of Georgetown University’s Center for Children and Families. “More than half of the enrollees have missed a payment at some point and as a result are bouncing around in and out of coverage sources or no coverage at all. These are very poor people for whom premiums are a hardship.”\nOf those who left the program after missing a payment, 61% who responded to a survey said they couldn’t afford to pay or were confused about the payment process. Another 22% either had other insurance or their income rose, making them ineligible.\nOf those who qualified for the program but never made an initial payment, 44% said they couldn’t afford the monthly payment or were confused about it. Another 26% either got insurance elsewhere or their income rose, making them ineligible.\nFewer than half of those who left the program or never made an initial payment had insurance when surveyed by Lewin Group for the state. Of those who did, most were covered through an employer.\nPence insisted on including monthly payments as a condition for expanding Medicaid through the Affordable Care Act. He argued the payments promote personal responsibility and better decision making by patients who have “skin in the game.”\nIt's a sentiment shared by Verma. “The Healthy Indiana Plan is about empowering individuals to take ownership for their health,” Verma said during her confirmation hearing.\nDr. Jennifer Walthall, secretary of Indiana's Family and Social Services Administration, said the monthly payment requirement is “probably the most looked-at component” of HIP. In a statement about the new report, she said Indiana will “continue to improve” the program “as we address findings through evaluations.”\nAs an indication that the monthly payments aren’t too burdensome, Moser, Indiana's Medicaid director, said the state expected about half the participants would choose HIP Plus, the higher tier of benefits which require the payments. But more than 60% are in that category, he said.\n“The level of skin-in-the-game payments was a lot more reasonable than I ever anticipated,” said Carl Ellison, president and CEO of the Indiana Minority Health Coalition.\nCombined participation in both tiers of coverage is “just a tick below” what was expected, said Brian Tabor, the incoming president of the Indiana Hospital Association, which pushed hard for Indiana to expand Medicaid.\nAbout 250,000 of the estimated 350,000 Hoosiers who became newly-eligible have been enrolled, said Tabor, who expects that to go up to about 300,000.\nThe insurance companies which offer the Medicaid plans say Indiana’s payment requirements and two-tiered system is more costly to administer. But Catherine Zito, senior government relations director of Anthem’s Indiana Medicaid operations, said recipients are more involved with their care because having to make an initial payment before accessing the system prompts them to ask questions about the services they could get and how to get them.\n“It kind of created engagement with our members from the get-go,” Zito said.\nSome who work with newly-eligible recipients say the dental benefits available in the higher tier are the main draw for people who could qualify for the basic level without making a monthly payment.\nThe payments got into a Personal Wellness and Responsibility Account, which help pay for services. The POWER accounts are supposed to make patients more efficient users of health care – getting preventive care, not seeking unnecessary care and comparing costs of services.\nAbout one in four people making their monthly payments are getting help doing so, according to the latest evaluation, most often from a family member.\n“That calls into question this notion that we’re empowering people to make decisions about their health care,” said the Center on Budget and Policy Priorities' Solomon.\nBut Jason Fricke, senior director of operations for MDwise which also offers Medicaid plans in Indiana, said the monthly payments are still an incentive for smarter use of services even if someone else is paying for them.\nThat's because money left in the POWER accounts can be rolled over, he said. “That’s just one piece of the responsibility.\"",
    "label": 3
}