{
    "index": 472,
    "text": "Sally Yates warned White House that Michael Flynn was vulnerable to Russian blackmail\nShow Caption Hide Caption Yates warned White House of 'possible blackmailing' Former Attorney General Sally Yates testified that she warned President Trump's White House that Michael Flynn was susceptible to blackmail by Russia. USA TODAY\nWASHINGTON — Days before she was fired as acting attorney general, Sally Yates was so troubled that then-National Adviser Michael Flynn misled Vice President Mike Pence about his communications with the Russian ambassador that she warned the White House counsel he was vulnerable to blackmail and could even face criminal charges.\nFor the first time publicly, Yates recounted before a Senate Judiciary panel on Monday the details of a Jan. 26 meeting – and a follow up session the next day – in which she alerted Don McGahn, the White House counsel, that Flynn had lied to administration officials about his conversations with Russian ambassador Sergey Kislyak before Trump's inauguration.\n\"You don’t want a situation where a national security adviser could get blackmailed by the Russians,’’ Yates told the panel.\nFlynn's contacts with the ambassador, according to officials who have previously described the communications, involved discussions with the ambassador about sanctions the Obama administration imposed on Russia. Those conversations were secretly monitored by federal authorities, as are most communications involving foreign diplomats.\nPence, for his part, had said he had been assured by Flynn that the subject of sanctions was not raised in the Kislyak conversations.\nCiting the classified nature of how the communications were obtained, Yates declined to elaborate on the intercepts or how she got her information. But she said the anxiety about Flynn's actions was so great within the Justice Department that members of its national security division were consulted, as were other intelligence officials across the government.\n\"Compromise was the No. 1 concern,'' Yates said, referring to the possibility that Russian officials, aware that Flynn had misled the White House, could blackmail him by threatening to expose his lies and tank his career.\n\"It was a whole lot more than one White House official lying to another,'' Yates said. \"It involved the vice president of the United States.\"\nIn their meeting, Yates said McGahn asked her at one point whether Flynn should be immediately dismissed. Yates said she offered no opinion on Flynn's continuing service, but conveyed the \"urgent'' nature of her concerns.\nTwo days before her first meeting with McGahn, Yates said FBI agents interviewed Flynn about his conversations with Kislyak. After informing McGahn that Flynn had been questioned by law enforcement, Yates said McGahn asked: \"How did he do?''\n​Yates declined to describe Flynn's interview with McGahn because it was then part of an active counterintelligence investigation.\nEighteen days later, ​after Yates' warnings were made public, Flynn was forced to resign.\nHis departure ended the shortest tenure of any president's national security adviser – and stoked further suspicion about the ties between Trump associates and Russian officials.\nBy then, Yates was already gone.Just four days after Yates' first meeting with the White House counsel, President Trump fired the career federal prosecutor for her actions on a separate matter. A holdover from the Obama administration, Yates had instructed Justice lawyers not to defend Trump's travel ban.\nSome Republicans seized on that decision Monday, including Texas Sen. Ted Cruz, suggesting that her actions were partisan. But Yates defended her directive on the travel ban on citizens from seven Muslim-majority countries, saying that there were “constitutional concerns’’ about the language of the president's executive order and that she was “not convinced that it was lawful.”\nYates also claimed that the Office of Legal Counsel, the Justice department office that advises the president on legal matters and had previously approved Trump’s order, was specifically instructed not share its deliberations with Yates and other interim Justice leadership before the travel ban was made public. She did not detail who instructed the OLC not to share its views with her and other top Justice officials.\n\"Not only were we not consulted, we weren't even told about it,'' Yates told Cruz.\nThe specter of Yates' testimony was not lost on Trump, who unleashed a series of pointed tweets before and after the hearing.\n\"Sally Yates made the fake media extremely unhappy today,'' Trump said after the more than three-hour session. \"She said nothing but old news!\"\nEarlier in the day, before the hearing even started, Trump sought to distance the administration from Flynn while suggesting that Yates may have leaked information about her actions related to the former national security adviser.\n\"General Flynn was given the highest security clearance by the Obama Administration - but the Fake News seldom likes talking about that,'' Trump said. \"Ask Sally Yates, under oath, if she knows how classified information got into the newspapers soon after she explained it to W.H. Council (sic).''\nYates told the panel she had never been a source of such information.\nIn separate news on Monday, officials confirmed Monday that former President Obama warned Trump not to hire Flynn during their post-election Oval Office meeting back in November, because of his ties to Russian officials.\nThe Russia story shows no signs of letting up. For the past several days, Flynn and former Trump advisers, including Carter Page, Paul Manafort and Roger Stone have become the subjects of fresh scrutiny about their Russian ties.\nThe Senate Intelligence Committee, which along with the House Intelligence Committee is probing Russian interference in the 2016 elections, recently asked the advisers to provide information about their activities.\nFlynn also is now under investigation by the Pentagon Inspector General for failing to inform Defense Department officials about seeking payments from foreign governments.\nFormer Director of National Intelligence James Clapper also appeared at Monday's Senate hearing with Yates.\nThe U.S. intelligence community, under Clapper's leadership, accused Moscow of orchestrating a campaign of cyberattacks to hack Democratic political organizations and release stolen information to undermine confidence in the American election. At the time intelligence authorities issued that finding late last year, Clapper said Monday that he was not aware that the FBI already was in the midst of a full-blown counterintelligence inquiry, exploring charges of possible collusion between Trump campaign associates and Russian officials.\nThe Justice Department wants Sally Yates to keep quiet The Justice Department has reportedly told Sally Yates that she needs their permission to talk about what she did and heard as acting Attorney General. Matt Hoffman reports. Buzz60\nSen. Lindsey Graham, R-S.C., who led Monday's Senate subcommittee hearing, said the panel's examination is necessary to \"hold [Russia] accountable.''\n\"Based on evidence presented by our intelligence and law enforcement communities, I believe Russia interfered in our election,'' Graham has said. \"I do not believe it changed the outcome, but I have no doubt they interfered.''\nDespite the ongoing probes into Russian election interference, Yates stole the show.\nEven as she repeatedly declined to provide detailed information about the Justice Department's scrutiny of Flynn, citing the classified nature of the review, the details she did provide had committee members often leaning forward in their chairs.\n\"My purpose in telling them (the White House) was so they could act,'' Yates said.\nYates' own journey to the witness chair has been long and politically fraught.\nIn March, when Yates' attorney had notified the Justice Department and White House of her intent to appear at a previously scheduled House Intelligence Committee hearing, the attorney was warned that Yates' testimony could contained privileged communications that might be barred.\nUltimately, Yates' scheduled March 28 appearance was canceled.\nTrump spokesman Sean Spicer has since indicated that the White House had no objection to Yates' testifying. Flynn, meanwhile, has sought immunity from any possible prosecution. Both the House and Senate Intelligence committees, in the midst of continuing Russia probes, have indicated that it is too early in their investigations to cut a deal for Flynn's testimony. Separately, preliminary discussions about Flynn's prospects for immunity in the FBI investigation also have yielded no agreement.\nFlynn's attorney, Robert Kelner, declined to comment Monday.",
    "label": 2
}