{
    "index": 407,
    "text": "Congress passes short-term funding bill to avoid government shutdown\nShow Caption Hide Caption Congress passes funding bill to avoid shutdown Both House and Senate approve a short-term spending bill that keeps government open for at least another week. (April 28) AP\nWASHINGTON — With just hours left until a government shutdown at midnight, Congress passed a stopgap funding bill Friday that will keep the government open for another week.\nHouse members voted 382-30 to approve the legislation, which gives lawmakers until midnight on May 5 to try to reach a compromise on legislation to fund the government through the rest of fiscal year 2017, which ends Sept. 30. The Senate approved the weeklong funding bill by voice vote Friday, and President Trump has said he will sign it into law.\n\"The fact that we are here again at the last minute just trying to keep the government open is sad,\" said Rep. Jim McGovern, D-Mass. \"Once again, we have a manufactured crisis at the edge of a cliff.\"\nCongressional leaders and the White House wanted to prevent an unpopular shutdown, which would have closed national parks and monuments, delayed tax refunds and furloughed thousands of federal workers. The shutdown would have taken effect Saturday — Trump's 100th day in office — unless Congress acted.\nRead more:\n\"Today's measure shows the American people that we are making a good faith effort to keep our government open.\" said House Rules Committee Chairman Pete Sessions, R-Texas. \"While this is not ideal, I support this effort to provide our colleagues with more time to reach a final agreement on legislation to fund the government through the fiscal year.\"\nDemocrats decided to support the stopgap measure after it became clear that House Republicans would not force a vote this week on a new version of their bill to repeal and replace the Affordable Care Act, better known as Obamacare. Minority Whip Steny Hoyer, D-Md., and other Democrats said they would vote against the weeklong bill to fund the government if GOP leaders went ahead with a health care vote.\nHoyer said he feared that Republicans were trying to push the bill through to give Trump a big victory for his first 100 days. However, Speaker Paul Ryan, R-Wis., said he would not bring the health care legislation to the floor until he is sure he has the votes to pass it. Many moderate Republicans expressed concern this week about the latest version of the bill.\nFederal programs would continue to be funded at existing levels under the stopgap measure approved by Congress. The resolution would also extend health care benefits for retired union coal miners through May 5. There is bipartisan support for making those benefits permanent.\nThe government has been operating on a temporary spending bill that Congress passed in December to fund agencies through April 28.\nLawmakers will return to work Monday with just five days to reach a deal or face another possible shutdown. Two major stumbling blocks to a compromise were largely resolved this week.\nOn Tuesday, Trump backed off his demand for immediate funding for a Southwest border wall, deciding to fight for money in the 2018 budget instead. Democrats had warned that the issue would result in a shutdown because of their fierce opposition to the wall. Some border-state Republicans also oppose the barrier, calling it expensive and ineffective. The Department of Homeland Security has estimated that the wall will cost nearly $22 billion, but Democrats have said the price tag could be as high as $70 billion.\nOn Wednesday, the White House backed off its threat to stop paying federal subsidies that help low-income Americans pay for health insurance under the Affordable Care Act.\nDemocrats want language in the final bill to ensure that subsidies owed to health insurance companies under Obamacare are paid so that insurance premiums don't increase for low-income families by 15% or more. Trump had threatened to withhold the payments to force Democrats to bargain on a health care bill to replace the ACA, but White House officials said Wednesday that those payments will continue.\nHowever, other sticking points remain.\nHouse Minority Leader Nancy Pelosi, D-Calif., said there are still disagreements over a rule that requires financial advisers to act in the best interests of clients saving for retirement. Democrats want to protect the rule in the funding bill but Republicans want to scrap it, saying it is confusing and burdensome.\nDemocrats also are seeking health care funding for Puerto Rico, which is expected to run out of Medicaid money this year, resulting in nearly 1 million residents losing their medical coverage. Trump has denounced Democrats' efforts as a taxpayer \"bailout\" of Puerto Rico. The U.S. territory receives less than half the Medicaid funding that states receive.\nRep. Tom Cole, R-Okla., who serves on the House Appropriations Committee, said he believes Republicans and Democrats can reach a bipartisan deal next week to fund the government through September. House leaders have said they intend to introduce a funding bill Monday night, setting up a vote on Thursday.\n\"I'm confident we'll be back here with a bill the American people can be proud of,\" Cole said.\nDespite his concessions, Trump is expected to win support for increased defense spending and border security that does not include the wall.\nTrump sent Congress an emergency request for $33 billion in the 2017 bill that included $30 billion in extra spending for defense and combat operations and $3 billion for border security, including the wall. Congress is likely to give the president more than $15 million in additional defense spending and some extra money for border security.",
    "label": 3
}