{
    "index": 1,
    "text": "— -- President Donald Trump is blaming former President Barack Obama for not fully vetting Trump's former national security adviser Michael Flynn after it was revealed that Flynn received payments from foreign governments without approval from military officials in 2014.\nIn an interview with Fox News released today, the president said that Obama officials bear responsibility for the oversight -- not his own administration, which tapped Flynn for the post.\n\"He was approved by the Obama administration at the highest level. And when they say we didn’t vet, well, Obama, I guess, didn’t vet, because he was approved at the highest level of security by the Obama administration,\" Trump said. \"So when he came into our administration, for a short period of time, he came in, he was already approved by the Obama administration and he had years left on that approval.\"\nFlynn resigned from the post in February.\nBoth the Republican and Democratic leaders of the House Oversight Committee say Flynn may have broken the law by accepting the payments for giving a speech to Russian state television and lobbying on behalf of the Turkish government. Committee Chairman Jason Chaffetz, R-Utah, said in a statement that \"by all appearances\" Flynn violated that law, and asked the secretary of the Army to \"make a final determination\" on whether Flynn broke it.\nThe Defense Department's inspector general has launched an investigation into Flynn. Documents also show that Flynn was warned against receiving payments from foreign governments without congressional approval by the Defense Intelligence Agency.\n“These documents raise grave questions about why Gen. Flynn concealed the payments he received from foreign sources after he was warned explicitly by the Pentagon,” said Rep. Elijah Cummings, D-Maryland, the top Democrat on the oversight panel, in a statement.\nFlynn maintained a top secret security clearance even after he was pushed out of his Obama administration role at the Pentagon in 2014.\nTrump also said that he was \"disappointed\" in how Republicans handled major issues like health care and tax reform.\n\"I’m disappointed that it doesn’t go quicker,\" Trump said. \"I like them a lot. I have great relationships, don’t forget most of them I didn’t even know. But many of them, like the Freedom Caucus, came and I see them all the time, 'We love our president, we’re doing this for our president.' You look at that, you look at the moderates, it’s the same thing. I’m disappointed. I’ll tell you Paul Ryan’s trying very, very hard. I think everybody is trying very hard. It is a very tough system.\"",
    "label": 2
}