{
    "index": 384,
    "text": "Former acting Atty. Gen. Sally Yates testified Monday for the first time that she warned White House lawyers at least twice in January that President Trump’s national security advisor at the time, Michael Flynn, “could be blackmailed” by Moscow, may have violated criminal statutes and had misled Vice President Mike Pence about his dealings with Russian officials.\n“We believed that Gen. Flynn was compromised,” Yates, a career prosecutor, told a Senate Judiciary subcommittee investigating Russia’s role in the 2016 election.\n“To state the obvious, you don’t want your national security advisor compromised with the Russians,” she said. “You don’t want the Russians to have leverage over the national security advisor.”\nFlynn, a retired Army three-star general, was forced to resign as Trump’s top national security aide 18 days after Yates first alerted the White House on Jan. 26, but only after news stories revealed the existence of a transcript of Flynn’s conversations with Russian Ambassador Sergey Kislyak. The diplomat’s calls were recorded as part of routine U.S. intelligence monitoring of ranking foreign officials.\nAt issue is whether Flynn improperly indicated to Kislyak that the Trump administration would ease or reverse economic sanctions that President Obama had imposed on Moscow in retaliation for Russian interference in the U.S. presidential campaign. Flynn denied doing so, and Pence later issued a similar denial.\nAdvertisement\nYates’ detailed chronology of two meetings and several calls with White House Counsel Donald McGahn about Flynn’s conduct conflicted with White House claims that Flynn was not ordered to resign immediately because she had only given a general “heads up” of a potential problem.\nHer testimony adds to Flynn’s potential legal problems, outlining concerns at the highest level of the Justice Department that Flynn’s conversations with the Russian diplomat during the transition may have violated the law. He has not been charged with a crime.\nIt also highlighted the mounting pressure the White House faces from three congressional investigations into Russia’s interference in the election. In March, the FBI confirmed it is conducting a separate counterintelligence investigation into whether any of Trump’s current or former aides improperly coordinated with Russian intelligence.\nFormer Director of National Intelligence James R. Clapper, who also testified Monday, warned that Russia’s efforts to influence the election posed a threat to democracy, and that the hacking and leaking of Democratic Party emails were a worrying taste of the future.\n“I believe they are emboldened to now continue such activities, both here and around the world,” Clapper said. “And I believe they will continue to do so.”\nSen. Lindsey Graham (R-S.C.), who headed the hearing, said it was vital to get to the bottom of Moscow’s role in the election.\n“The Democratic Party of 2016 were the victims this time. It could be the Republican Party in the future,” Graham said. “We’re all in the same boat.”\nYates, a career federal prosecutor, was named deputy attorney general by Obama in 2015. She served as acting attorney general for 10 days after Trump was inaugurated on Jan. 20.\nYates testified that she and a senior official in the national security division at the Justice Department met with McGahn, the top White House lawyer, on two consecutive days a week after the inauguration in a secure office at the White House to discuss statements by Flynn and others “that we knew not to be the truth.”\n“We weren’t the only ones who knew of this,” Yates said. “The Russians also knew.”\nYates said that after FBI agents had interviewed Flynn on Jan. 24 she believed it was “critical that we get this information to the White House in part because the vice president was unknowingly making false statements to the American public. And we believed Gen. Flynn was compromised with regard to the Russians.”\nYates refused to go into detail about Flynn’s communications with the Russians and did not refer to transcripts of the intercepted calls, noting that it was classified. In response to questions, she denied leaking any classified information about the case to the news media.\nBut she laid out the timeline of her contacts with the White House, saying she called McGahn two days after the FBI had interviewed Flynn to request a face-to-face meeting.\nShe went over that afternoon “to warn the White House of something we were very concerned about, so they could take action,” Yates said of her Jan. 26 meeting in McGahn’s office.\n“We walked the White House counsel through Flynn’s underlying conduct in a fair amount of detail — what Gen. Flynn had done and how it been falsely reported,” she said.\nShe said McGahn called her back the next morning and asked her to return to his office that afternoon. In that second meeting, she said, he asked, “Why does it matter [to Justice] if one White House official lies to another White House official?”\nShe said Flynn’s misstatements about his dealings with Russian officials were “getting more and more specific,” making him more vulnerable to potential blackmail.\nShe said that McGahn asked whether Flynn should be fired and that she replied it was up to the White House. She said McGahn also asked whether disciplining Flynn could interfere with the FBI case, and Yates said it would not.\nHe also asked her whether Flynn might be subject to criminal prosecution, Yates recalled. She told him that the “underlying conduct,” referring to Flynn’s conversations with Kisylak, “was problematic.”\nMcGahn also asked “to look at the underlying evidence against Flynn.” Since it was a Friday, Yates said she would consider it over the weekend. On Monday, Jan. 30, she called him back and agreed to his request.\nTrump fired Yates, a holdover from the Obama administration, that afternoon after she announced that the Justice Department would not go to court to defend an executive order seeking to bar travel from seven mostly Muslim countries.\nIn her testimony Monday, Yates said that she had concluded that the executive order was unlawful and that it was her duty to say so. Since then, three federal courts have blocked the order, and a similar subsequent order, as unlawful.\nThe hearing opened hours after it emerged that Obama had warned then-President-elect Trump two days after the election in November against picking Flynn as his national security advisor.\nObama delivered the warning, which first was disclosed by NBC News, when he met Trump for 90 minutes in the Oval Office, according to a former senior Obama administration official.\nObama had not planned on saying anything about Flynn, the former official said, but he told Trump he should “think twice” about hiring him after they got into a conversation about personnel.\nWhite House Press Secretary Sean Spicer said Monday that Obama made clear to Trump that he “wasn’t exactly a fan” of Flynn, who had criticized the Obama White House policy on Iran after he left the Pentagon.\n× White House Press Secretary Sean Spicer responds to reports that President Obama had warned Donald Trump about hiring Michael Flynn two days after the election.\nAhead of the Senate hearing, Trump sought to distance himself from Flynn, citing the decision by the Defense Intelligence Agency to extend Flynn’s security clearance after he retired in 2014.\n“General Flynn was given the highest security clearance by the Obama Administration — but the Fake News seldom likes talking about that,” he tweeted Monday morning.\nOther officials said Flynn’s clearance as a retired general was lower than he subsequently needed to be national security advisor.\nTrump also urged lawmakers to ask Yates about the leak of information about Flynn.\n“Ask Sally Yates, under oath, if she knows how classified information got into the newspapers soon after she explained it to W.H. Counsel,” he tweeted, referring to Yates’ conversation with McGahn.\nUnder questioning, Yates said she had not leaked the information and did not know who did, because it occurred after she was fired.\nAfter the hearing, Trump issued several further tweets, saying that Yates “made the fake media extremely unhappy today — she said nothing but old news!”\n“The Russia-Trump collusion story is a total hoax, when will this taxpayer funded charade end?” he said.\nFlynn and Kislyak were in touch in late December, including on the 29th, the day the Obama administration levied sanctions in response to a determination by U.S. intelligence agencies that Russian President Vladimir Putin’s government had interfered in the U.S. campaign in an effort aimed in part at helping Trump win.\nIn his testimony, Clapper repeated a previous statement, in a TV interview, that he was not aware of evidence of collusion between the Trump campaign and the Russian government. But he also said that he had not been informed of the FBI’s counterintelligence investigation before he left office, because it was a law enforcement matter.\nRepublican lawmakers asked Clapper about reports that the identities of some Trump aides might have been improperly revealed in intelligence reports — a process known as unmasking — despite rules requiring them to be kept confidential in most cases.\n“At no time did I ever submit a request” to unmask Trump associates in intelligence reports “for personal or political purposes,” Clapper said. “Nor am I aware of such a request by anyone else.”\nYates gave a similar assurance that she did not seek to unmask anyone on Trump’s team and did not know who did.\ndavid.cloud@latimes.com\nTwitter: @davidcloudLAT\nALSO\nTrump’s multiple residences, large jet-setting family and commuter marriage drive up first family travel and protection costs\nTrump’s lawyers are heading back to court to revive his foreign travel ban\nWhat it’s like to be a teen in L.A. with a parent in the U.S. illegally\nUPDATES:\n4:18 p.m.: This article was updated with additional details from Clapper’s testimony at the hearing.\n1:45 p.m.: This article was updated with additional details from the hearing and Yates’ testimony.\nThis article was originally published at 11 a.m.",
    "label": 3
}