{
    "index": 99,
    "text": "Comedian Hasan Minhaj takes up the stage at the White House Correspondents Dinner\nThe annual glitzy White House Correspondents Dinner went on Saturday night, without President Trump, White House aides and even many of the marquee parties being canceled.\nThe night's headliner, Hasan Minhaj of \"The Daily Show\" on TV's Comedy Central, roasted Mr. Trump -- and the press -- during his time on stage, despite saying he had been told not to.\n\"We've got to address the elephant that's not in the room,\" he cracked. \"The leader of our country is not here. And that's because he lives in Moscow. It's a very long flight. As for the other guy, I think he's in Pennsylvania because he can't take a joke.\"\nBob Woodward, the legendary Washington Post reporter who broke the Watergate scandal, urged journalists to pursue truth aggressively, whether \"revered\" or \"reviled.\"\nWoodward made the comments moments after President Trump, who skipped the dinner to hold a rally in Harrisburg, Pennsylvania, spent much of his own speech disparaging outlets like MSNBC and CNN as \"fake news\" and untrustworthy. Mr. Trump said he was happy to be with \"much better people\" than Washington press corps.\nWoodward addressed Trump's habit of calling reporters \"fake news\" directly, in an evening that focused on the value of the First Amendment, free speech and the freedom of the press.\n\"Mr. President, the media is not fake news,\" Woodward said, to applause.\nBut Woodward suggested that no matter how the press is treated, reporters should do their jobs diligently -- particularly when opinion polls show most Americans distrust the media.\n\"This is no time for self-satisfaction or smugness,\" Woodward said, urging reporters to \"not have a dog in the political fight except to find that best attainable version of the truth.\"\nMinhaj, meanwhile, made jokes about outlets like MSNBC and CNN, but ultimately called on reporters to work diligently with Mr. Trump in the White House. After all, reporters have to work twice as hard with half the credit, he said.\n\"Now you know what it feels like to be a minority,\" Minhaj joked.\nMinhaj also joked about Mr. Trump's 3 a.m. tweets, saying that since Mr. Trump doesn't drink, every tweet he posts is sent sober.\nMinhaj ending by saying \"only in America\" can a first-generation Indian-American, Muslim kid get on stage and roast the president of the United States. That, he said, shows, \"even the president is not beyond the reach of the First Amendment.\"\nCBSN Originals recently returned to Erie, Pennsylvania to reconnect with locals who hoped a fresh approach in Washington would bring about change in their struggling home town. Airing on May 21 at 8 p.m. EST, \"America | Redefining Hope\" looks at how that hope has evolved.",
    "label": 2
}