{
    "index": 376,
    "text": "Los Angeles Mayor Eric Garcetti secured one of his biggest accomplishments last year with passage of Measure M, the sales tax hike slated to deliver $120 billion for transportation projects over four decades.\nThat victory was achieved, in part, through the hard work of nonprofit groups and grass-roots activists who pushed for more investment in rail, buses and ways of making walking and bicycling safer. Now, some of those same advocates are voicing dismay over Garcetti’s budget plan, saying it does too little to prevent traffic deaths.\nGarcetti called this week for $16.6 million to go to the city’s Vision Zero initiative, which seeks to end traffic fatalities on city streets by 2025.\nMayoral aides say that’s a dramatic increase from this year’s allocation of $3 million. But Jessica Meaney, who heads the transportation advocacy group Investing in Place, said the program will need twice as much money to begin seriously reducing the number of deaths on city streets.\n“The promise of Measure M was to be able to get around the city with more options. But we need to make sure we can get around the city alive,” said Meaney, who intends to press the council to put more money into Vision Zero.\nAdvertisement\nCity officials have been facing competing demands on how to divvy up what’s expected to be an influx of state and local transportation money. Safe-streets advocates are pushing hard for Vision Zero, noting that 260 people were killed in traffic collisions in 2016, an increase of almost 43% over the prior year.\nOthers have been pushing for the city to start repairing the its most deteriorated streets, which have been ignored since the 2008 recession. Those roads — with a ranking of D and F from engineers — are by far the most expensive to fix, costing up to $500,000 for every mile of a street lane, city officials say.\nGarcetti is seeking to spend $34 million on such streets in the coming fiscal year, reconstructing more than 60 lane-miles, said Matt Szabo, the mayor’s deputy chief of staff. That strategy would simultaneously address the need for repairs and street safety, he said.\nThe boulevards that receive repairs will be along the city’s “high injury network” of dangerous streets, where 65% of pedestrian deaths occur. As those D and F streets are rebuilt, they will be upgraded with safety features planned under Vision Zero, such as enhanced crosswalks at intersections, Szabo said.\n“The message [Garcetti’s] intending to send with this proposal is that fixing our streets and making them safe are not exclusive of one another,” Szabo said. “So we’re increasing dramatically the budget for fixing our worst roads, and we’re increasing fivefold the budget for Vision Zero.”\nCouncilman Mike Bonin, a Garcetti ally who raised money for the Measure M campaign, disagrees with the mayor’s approach on transportation spending. Filling potholes and reconstructing roads is not the strategy that will seriously reduce traffic deaths, said Bonin, who heads the council’s Transportation Committee.\nBonin said he intends to rework the mayor’s plan to send a greater share of transportation funds to Vision Zero.\n“Our first year of Vision Zero was really, really underfunded, and the problem [of traffic deaths] actually got worse this year,” he said. “So we really need to make a significant investment in this.”\nVision Zero spells out an array of safety improvements, including painting more visible crosswalks and retiming traffic signals to give pedestrians more time to cross the street. More significant overhauls could include new medians and left-turn lanes or the removal of traffic lanes.\n“To really reduce traffic fatalities, those physical improvements to change the street design are essential, and expensive,” said Deborah Murphy, executive director of the pedestrian advocacy group Los Angeles Walks.\nMurphy said she will press lawmakers to shift funds from the budget for D and F streets to Vision Zero. That issue has already divided some council members.\nBonin’s committee voted 3 to 2 last month to recommend that three-fifths of Measure M’s local funding go toward Vision Zero initiatives. Councilmen David Ryu and Paul Koretz dissented, saying a greater share of the funds should go to fixing D and F streets.\nSome have pointed out that Measure M was specifically billed — both in mailers and on social media — as a way to fill potholes. Ryu, who favors Garcetti’s transportation plan, said city leaders need to fulfill the commitment made during the Measure M campaign.\n“It was very clear that constituents in my district overwhelmingly were asking for repairs of our streets,” said Ryu, who represents neighborhoods from Silver Lake to Sherman Oaks. “I think it’s very important that we rebuild trust, and the way you do that is by fulfilling those promises.”\nEven if Garcetti’s budget is approved unchanged, the city will still have about 6,400 lane-miles of D and F streets, said Szabo, the mayoral aide.\nThe challenge for Vision Zero is similarly steep. The head of the city’s Department of Transportation said last month it could take as much as $80 million to achieve a 20% reduction in fatal and severe crashes involving pedestrians and cyclists.\nTamika Butler, executive director of the Los Angeles County Bicycle Coalition, said the city could find other ways of securing more money for Vision Zero. One option, she said, would be to tap police and fire department funding.\n“When you’re looking at the important work these departments do, it’s all about saving lives,” Butler said. “Vision Zero is about saving lives, too.”\ndavid.zahniser@latimes.com\nTwitter: @DavidZahniser\nlaura.nelson@latimes.com\nTwitter: @laura_nelson",
    "label": 3
}