{
    "index": 191,
    "text": "(CNN) FBI Director James Comey strongly defended Wednesday his decision to alert Congress just days before the 2016 election about his agency's investigation into emails potentially related to Hillary Clinton's personal server, telling senators while the idea of impacting the election made him \"mildly nauseous,\" he would not change what he did.\n\"It was a hard choice, I still believe in retrospect the right choice,\" Comey told senators at a judiciary committee hearing on oversight of his agency . \"I can't consider for a second whose political fortunes will be affected.\"\nComey faced sharp questions from both sides of the aisle and is testifying the day after both the sitting US President and the 2016 Democratic presidential nominee sharply criticized him for his role in the outcome of last year's presidential election.\nHe also said Russia to this day is actively involved in trying to influence US politics, emboldened after the outcome of last year's election.\n\"I think one of the lessons that the Russians may have drawn from this is: this works,\" Comey said.\nCommittee Chairman Chuck Grassley originally called the Wednesday oversight hearing of the FBI to examine what the agency knows about a 2015 terrorist attack in Garland, Texas . But the broad oversight hearing almost immediately shifted to the FBI's investigation into Russian meddling in the US elections, a subject on which there are four congressional probes in progress that have led to a steady stream of revelations since President Donald Trump was elected.\nComey has become an almost equally divisive figure for Republicans and Democrats for his impact on the 2016 elections.\n\"A cloud of doubt hangs over the FBI's objectivity,\" Grassley said in his opening remarks, which listed a series of issues he took with the agency. The Iowa Republican added later, \"The public's faith in the FBI, Congress, and our democratic process has been tested lately.\"\nComey cited the meeting on the tarmac between former President Bill Clinton and then-Attorney General Loretta Lynch last year as a sign he was worried about leadership at the Justice Department's handling of its investigation.\n\"I'm not picking on the attorney general, Loretta Lynch, who I like very much, but her meeting with President Clinton on that airplane was the capper for me and I then said, you know what, the department cannot, by itself, credibly end this,\" Comey told the committee.\nComey's revelation that the FBI was examining additional emails from Hillary Clinton that were discovered on disgraced former Rep. Anthony Weiner's computer, has led Democrats -- including Clinton herself -- to say it cost them the White House.\n\"I was on the way to winning until a combination of Jim Comey's letter on October 28 and Russian WikiLeaks raised doubts in the minds of people who were inclined to vote for me and got scared off,\" the 2016 Democratic presidential nominee said Tuesday in an interview conducted by CNN's Christiane Amanpour at the Women for Women International summit in New York.\nRanking Democrat Dianne Feinstein used her first remarks to question the agency's timing and handling the Clinton investigation.\n\"Why didn't you just do the investigation as you would normally, with no public announcement?\" the California Democrat asked.\n\"Having repeatedly told this Congress we're done and there's nothing there, there's no case there, there's no case there, to restart in a hugely significant way, potentially finding the emails that would reflect on her intent from the beginning and not speak about it would require an act of concealment in my view,\" Comey responded as part of his lengthy answer explaining his letter to Congress.\nMost recently, CNN reported Tuesday that former acting Attorney General Sally Yates is prepared to testify before a Senate panel next week that she gave a forceful warning to the White House regarding then-national security adviser Michael Flynn and his conversations with the Russians nearly three weeks before he was fired, contradicting the administration's version of events. Comey, responding to a question Wednesday from Republican Sen. Lindsey Graham, confirmed Yates discussed her assessment that Flynn may be vulnerable with him.\nFollowing those remarks, Trump criticized Comey the night before the hearing.\n\"FBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony......Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign?\" Trump said in a pair of tweets Tuesday.\nFBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony... — Donald J. Trump (@realDonaldTrump) May 3, 2017\n...Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign? — Donald J. Trump (@realDonaldTrump) May 3, 2017\nSenate Democrats grilled the FBI chief about his decisions in the final days of the US election last year and his timing for releasing that information.\n\"The most important investigation the FBI is currently conducting is into Russia's interference in our last presidential election,\" Sen. Chris Coons, a Delaware Democrat on the Senate judiciary committee, told CNN Tuesday. \"This isn't just about understanding Russian interference and potential coordination of some kind with the Trump campaign. This is about defending our next election as well.\"\nMeanwhile, Graham, who is leading his own investigation into Russia's interference in the election, said he still wants Comey to answer whether the FBI issued any warrants against the Trump campaign -- a question he asked months ago.\n\"I just want an answer. I just want to know what is going on here,\" Graham said Tuesday. \"You had (former Director of National Intelligence James) Clapper say there was no surveillance of the Trump campaign or Trump Tower. You've got press reports a FISA warrant was issued for Carter Page because of his ties to Russia. I just want to know what happened. And if we can't do it in an open session, let's do it in a closed session.\"",
    "label": 2
}