{
    "index": 209,
    "text": "Washington (CNN) Here it is: our first visual glimpse at the hive mind where Trump's chief strategist, Steven Bannon, is plotting the \"deconstruction\" of the administrative state .\nWe've heard descriptions of Bannon's office before.\nHere's how CNN's Maeve Reston, pulling reporting from the network's White House reporters like Jeff Zeleny, described the room in a recent piece for CNN's new online magazine, \"State.\"\nWhen he moved into the White House, Trump's chief strategist removed the floor-to-ceiling bookshelves and sofa from his office and positioned his desk in the corner to make room for giant whiteboards that are lined up in four columns beneath the campaign theme: Make. America. Great. Again. In the final hours of the first 100 days, the promises kept were marked with a red X, including abandoning a massive Pacific trade deal. The column without a single red X: Legislative accomplishments.\nNow, thanks to some innocently tweeted photographs from Rabbi Shmuley Boteach, the Orthodox rabbi, author and TV personality, we can see the priorities that form Bannon's to-do list.\nWith Steve Bannon and Debbie at the White House on #IsraelIndependenceDay2017. Thank u Steve for your love of Israel pic.twitter.com/xrU4nLUyYU — Rabbi Shmuley (@RabbiShmuley) May 2, 2017\nShmuley was making the rounds in Washington for Israel Independence Day this week and innocently posted photos of himself with notable Republicans.\nHere's another look:\nWith @SteveBannon in the White House on #israelindependenceday. Steve is a great, stalwart friend of the Jewish State pic.twitter.com/PFxSCK7blc — Rabbi Shmuley (@RabbiShmuley) May 2, 2017\nAnd a close-up:\nThere's been an effort on social media to decipher the visible portions of the whiteboards (there are others in the office not visible in Shmuley's photos).\nThe ones we can see list columns for \"Pledges on Obamacare,\" Pledges on Tax Reform,\" \"Pledges on Infrastructure\" and \"Pledges on Immigration.\"\nA check mark is thought to mean pledge fulfilled.\nThe most-noticed pledge is the one that reads:\nBuild the border wall and eventually make Mexico...\nSo obviously, the administration still has designs on somehow making Mexico pay for the border wall it wants to build even as it sets about trying ( in vain so far ) to get Congress to pay for it first.\nThere are check marks next to these items:\nSuspend the Syrian refugee program\n(That suspension, issued as part of an executive action, has been stymied by the courts , however)\nEnd \"catch-and-release\"\n(Yep, the Department of Justice is hard at work stepping up deportations and prosecutions\nHire 5,000 more Border Patrol agents and\nTriple the number of Immigration and Customs Enforcement agents\n(That's in the works, but has encountered some hurdles , as CNNMoney has reported)\nRestore the Secure Communities program\nAchieved as part of an initial raft of executive orders, this is aimed at making local law enforcement share biometric data with the feds.\nOther bullets under immigration may have check marks too, but they're not visible.\nSome of the bullets are targeted at legislation, like the tax reform and Obamacare sections, neither of which has any check marks.\nOthers are targeted at specific bills, like the Davis-Oliver bill, which would give local law enforcement more responsibility to detain the undocumented. There's mention of \"Kate's Law,\" which would send foreigners who re-enter the country illegally after being deported, to jail for at least five years.\nThere's also mention, mostly obscured, of the Iran nuclear deal and moving the Israeli embassy to Jerusalem. Under what must be \"Pledges on Trade,\" it mentions withdrawing from something, negotiating something else and renegotiating a third thing.\nIn short, Bannon's whiteboard doesn't include anything the President and the White House haven't talked about publicly. But it is fascinating to see it scrawled out so carefully in his West Wing office.",
    "label": 3
}