{
    "index": 328,
    "text": "I’ve been lucky. I was born a healthy baby. Other than childhood rounds of measles and chicken pox and annoying yearly bouts with springtime pollen, I’ve enjoyed a disease-free life. So far, no hereditary predispositions toward any awful affliction have shown up.\nOther than a weakness for doughnuts and cheeseburgers, I eat pretty well and haven’t gotten fat. I exercise sporadically, but stay in reasonably good shape. Occasionally I drink enough to regret it in the morning, but I’ve never smoked or abused drugs. I’ve broken ribs three times — once after falling on an icy ski slope, once in a motorcycle mishap in Vietnam and once when a horse decided to buck me off onto a pile of rocks. I guess you could say those injuries were my fault for not staying at home watching TV in a recliner, but I generally make choices that avoid foolish risks.\nHealth insurers love me. I only rarely make a claim. They take far more money from me than they return in coverage. As a result, I guess I should be a fan of the House Republican healthcare plan because it is supposed to help people like me.\n1 / 51 la-1491523602-y7ephyarj1-snap-image (David Horsey / Los Angeles Times) 2 / 51 la-1491368625-0bgh58ihw8-snap-image (David Horsey / Los Angeles Times) 3 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 4 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 5 / 51 Top of the Ticket cartoon (David Horsey / Los angeles Times) 6 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 7 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 8 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 9 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 10 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 11 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 12 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 13 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 14 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 15 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 16 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 17 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 18 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 19 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 20 / 51 Trump inspires millions to take to the streets -- to oppose him. (David Horsey / Los Angeles Times) 21 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 22 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 23 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 24 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 25 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 26 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 27 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 28 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 29 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 30 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 31 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 32 / 51 Cartoon caption contest winner at the DENT conference in Sun Valley, Idaho: Jon Duval, executive director of the Ketchum Community Development Corporation. (David Horsey / Los Angeles Times) 33 / 51 Old radicals and big media descend on Selma (David Horsey / Los Angeles Times) 34 / 51 Horsey imagined the creation of the Ann Coulter phenomenon in this cartoon from 2007. (David Horsey / Los Angeles Times) 35 / 51 This David Horsey drawing is a reconfiguration of a cartoon he first published in 2006. (David Horsey / Los Angeles Times) 36 / 51 Donald Sterling, owner of the L.A. Clippers, should give Cliven Bundy a call. After Sterling loses his NBA franchise and the deadbeat Nevada rancher loses his cattle, the two old racists will both need a buddy. Maybe they can team up together and open an all-white rodeo. (David Horsey / Los Angeles Times) 37 / 51 Besides sending a chill up the spine of the international community, Vladimir Putin has accomplished one other thing by seizing Crimea and threatening the rest of Ukraine: Putin has brought back the bear. (David Horsey / Los Angeles Times) 38 / 51 The right-wing insurrection at the Bundy ranch in Bunkerville, Nev., has taken another weird turn with new revelations about the family history of Cliven Bundy. (David Horsey / Los Angeles Times) 39 / 51 See full story» (David Horsey / Los Angeles Times) 40 / 51 See full story» (David Horsey / Los Angeles Times) 41 / 51 See full story» (David Horsey / Los Angeles Times) 42 / 51 See full story» (David Horsey / Los Angeles Times) 43 / 51 See full story» (David Horsey / Los Angeles Times) 44 / 51 See full story» (David Horsey / Los Angeles Times) 45 / 51 David Horsey / Los Angeles Times (David Horsey / Los Angeles Times) 46 / 51 See full story» (David Horsey / Los Angeles Times) 47 / 51 See full story» (David Horsey / Los Angeles Times) 48 / 51 See full story» (David Horsey / Los Angeles Times) 49 / 51 See full story» (David Horsey / Los Angeles Times) 50 / 51 See full story» (David Horsey / Los Angeles Times) 51 / 51 See full story» (David Horsey / Los Angeles Times)\nAlabama Rep. Mo Brooks explained this to CNN’s Jake Tapper on Monday as he made the case for a revised version of the Republican scheme to repeal and replace the Affordable Care Act, a.k.a. Obamacare. Fortunate people who live healthy, responsible lives should not have to subsidize care for people who are not so fortunate or responsible, Brooks said.\nAdvertisement\nThe GOP plan “will allow insurance companies to require people who have higher healthcare costs to contribute more to the insurance pool that helps offset all these costs, thereby reducing the cost to those people who lead good lives — they’re healthy, they’ve done the things to keep their bodies healthy,” Brooks said.\nAnother House Republican, Kansas Rep. Roger Marshall, gave an interview recently in which he recalled how Jesus said “the poor will always be with us” and many of those poor folks, Marshall insisted, simply do not want healthcare.\n“There is a group of people that just don’t want healthcare and aren’t going to take care of themselves,” Marshall said. People on Medicaid do not exercise or eat well or seek preventative medicine, the congressman claimed, and so they end up in emergency rooms only when things get really bad, like “when their arm is chopped off.”\nPutting aside evidence that contradicts Marshall’s contentions about the poor — such as the fact that expansion of Medicaid under the Affordable Care Act in Arkansas and Kentucky has led recipients to seek more primary care and make fewer visits to the ER — the comments of the two GOP House members reveals a viewpoint at the heart of Republican opposition to the proposition that everyone has a right to healthcare. Conservatives like Brooks and Marshall do not believe Americans should share the cost of illness. They seem to think sickness is, more often than not, the fault of the person who is sick. People born into poverty or those with preexisting conditions should bear their own burdens and not expect the rich and healthy to chip in for the cost of their care. That seems to be the bottom line for those who are, this week, taking another shot at ending Obamacare.\nPresident Trump keeps promising that no one is going to tamper with the current prohibition against denying coverage to people with preexisting ailments, but, just as was the case with an earlier failed version of the Republican healthcare bill, he is ignoring what is actually in the legislation his party is pushing. In order to get the votes of conservative hard-liners, House GOP leaders have gone even further in the latest iteration to strip away provisions for the poor and for people with chronic diseases and handicaps.\nIf we took the tough-minded Republican view to its logical conclusion, we would eliminate Medicare. There are quite a few old people gobbling up a lot of health services at taxpayer expense. Those people should have taken better care of themselves. Or they shouldn’t have let themselves get old.\nI guess I look at it another way. I’ve lived a healthy life, but, mostly, I’ve been lucky. That’s my reward right there. That is why I don’t mind sharing a bit of the cost with my fellow citizens whose luck has not been so good, even if some of them brought it on themselves.\nWe really are all in this together. And I think Jesus would agree.\nDavid.Horsey@latimes.com\nFollow me at @davidhorsey on Twitter",
    "label": 3
}