{
    "index": 337,
    "text": "Congress is on track to deliver President Trump his first big bipartisan agreement this week with a $1-trillion spending bill to keep government running, but don’t expect other major legislative accomplishments any time soon.\nEven though Republicans control the House, Senate and White House, the party in power is now at risk of squandering the unique opportunity offered in an administration’s early months to muscle through big-ticket priorities in Congress.\nHouse Speaker Paul D. Ryan (R-Wis.) once promised a Republican agenda so ambitious — repeal and replace the Affordable Care Act, overhaul the tax code, cut federal regulations — it would take twice the traditional 100 days of the new administration to accomplish it.\nBut as Congress begins the march toward Ryan’s 200-day milestone, the prospect for success on almost any of the major Republican priorities is no more in sight than in the first 100 days, which left Trump with only a slim list of achievements.\n“It’s really hard to do big stuff, especially when the White House is unpopular,” said George Washington University professor Sarah Binder, an expert on Congress.\nAdvertisement\nThis week will be pivotal as Congress is set to approve the spending package, which averts a shutdown threat by funding government operations until September.\nHouse Republicans may also try again to bring their Obamacare overhaul bill to the floor after earlier attempts fizzled. But it’s unclear whether they have the support of their own members, and the bill has almost no chance in the Senate because fellow Republicans there oppose it.\nThe toxic combination of Republican infighting, the White House’s failure to provide clear direction and an over-ambitious agenda have hobbled the majority’s ability to accomplish its goals.\nWith the healthcare effort floundering and tax reform still likely months from being crafted into legislation, congressional Republicans have teed up few other promised priorities, such as infrastructure or border security. It raises questions of what, if anything, Congress can accomplish before the summer recess.\nCongress has sent more than 28 bills to the president’s desk to sign into law. Most were modest measures or bills passed under a special process to unwind recent Obama-era regulations.\nBusiness groups have heralded the rapid deregulatory effort, which was one of Republicans’ top promises. But the window for using that special process, which permitted bills to pass with a simple majority in the Senate rather than the usual 60 votes to avoid filibuster, is about to close, meaning the job going forward will be harder without bipartisan support.\nThe spending package is likely to win backing from a wide cross section of lawmakers, in part because it steered clear of Trump’s top priorities — money for the border wall with Mexico and steep cuts to non-defense programs. It beefs up military spending that both parties support, but only by half as much as the administration wanted.\nCongress will likely finish the week having averted a shutdown — usually seen as the basics of governing — only because Republicans in this case were forced to drop their go-it-alone approach.\n“I hope this is a metaphor for the future,” Senate Minority Leader Charles E. Schumer (D-N.Y.) told reporters Monday. “If Republicans work with us, we can get things done.”\nThe first six months of a new Congress are typically prime time for legislating, even more so when the majority party also has its president in the White House.\nIn 2009, President Obama set the course for what would become the most productive Congress since President Lyndon Johnson as Democrats controlled the White House and Congress.\nThen-House Speaker Nancy Pelosi and then-Senate Majority Leader Harry Reid used their congressional majority to usher through the economic recovery act during Obama’s first 30 days and set the groundwork for passage later that session of Obamacare.\nStunned but impressed as the Democrats steamrolled their agenda through Congress, Republican leaders relied on a similar strategy to win back the majority — telling voters they needed control of all levers of government to accomplish their to-do list.\nBut the flaw in the GOP strategy has been its own inability to unify as a working majority amid constant dissent between its conservative and centrist factions. That friction helped stall the healthcare bill and could also hinder tax-reform negotiations.\n“It’s been a total swing and a miss — several swings and misses,” Sen. Chris Van Hollen (D-Md.) said.\nGOP lawmakers are reminded of the stakes at play when they show up back home empty-handed to face constituents who voted them to office on the power of big changes.\nRep. Dave Brat (R-Va.), a member of the conservative House Freedom Caucus, acknowledged that Republicans should have been better prepared for this moment. But he remained hopeful that Trump, with his convention-breaking style, will buy more time for Congress to act.\n“Under the old-style thing, you should have had it all ready to go,” Brat said. “But you got to fit it in the Trump matrix.”\nAt some point, Republican leaders in Congress will bear responsibility for its accomplishments, or lack of them. Pelosi’s office quipped last week that running the country doesn’t come with “training wheels.”\nWhen Democrats had control, Pelosi and Reid were seasoned dealmakers who helped steer the White House toward legislative lifts — relying on Obama to use the power of the pulpit to amplify the party’s positions.\nIn contrast, many Republicans simply did not expect Trump to actually win the presidency, and did not prepare for their legislative agenda beyond loose policy papers and blueprints.\nRyan brings less negotiating experience to the bargaining table, and his counterpart, Senate Majority Leader Mitch McConnell, prefers working more quietly behind the scenes. Trump meanwhile has shown little appetite for delving into the details of legislation or aggressively selling such measures on the stump, as other presidents have done.\nRepublicans are likely to set their sights lower, on smaller legislative lifts in the weeks to come, if the big-ticket items slip beyond reach.\nBinder noted that previous Congresses have emerged from the start of a new, same-party administration with mixed results.\nWith a productive session, President Clinton was able to recover after the rocky start of his failed healthcare overhaul and an unsuccessful attempt to end the ban on gays in the military.\nBy contrast, President Carter, whose attempts to reform what he saw as pork-barrel projects and Washington waste alienated many in his own party, never quite recouped from his opening days.\nCongress stalled much of Trump’s agenda in what Binder said “is probably the closest analogy we have of unified party control being a bust.”\nlisa.mascaro@latimes.com\nTwitter: @LisaMascaro\nALSO\nTrump wants a border wall, but few in Congress want to pay for it\nCongressional negotiators reach $1-trillion deal to fund government but provide little for Trump’s priorities\nQ&A: Filibuster, cloture and what the ‘nuclear option’ means for Gorsuch nomination and future of the Senate\nMore coverage of Congress\nMore coverage of politics and the White House",
    "label": 3
}