{
    "index": 791,
    "text": "Spencer Platt via Getty Images\nPresident Trump’s “America First” federal budget proposes drastic cuts or the outright elimination of many programs that support the socially and economically disadvantaged; scientific and health research; education; and, the arts. If it is enacted in full, or in part, it will have a dramatic negative effect on this nation and many of its citizens.\nThat will make philanthropy even more critical than it is today here in the United States for promoting the common good and equality of opportunity for all and not just the privileged few.\nAdvertisement\nPhilanthropy takes many forms. The philanthropy that will be of pivotal importance in this regard, in our opinion, is what we call purposeful philanthropy.\nPurposeful philanthropy is making investments directed at creating a difference in pivot point areas that matter to the future of American society. The returns on those investments are changes to problematic conditions and/or the creation of individuals who will become change agents to address those conditions.\nThere is a distinction between purposeful philanthropy and charity. The focus in charity is to provide a handout. The focus in purposeful philanthropy is to provide a hand-up.\nIf there are huge federal cutbacks in domestic programs that benefit the poor and the working poor, there will definitely need to be increased charitable support to compensate somewhat for those losses. The handout approach, however, has serious limitations. It does not get at the root cause nor change the underlying reason for the need for the charity.\nAdvertisement\nBy contrast, purposeful philanthropy focuses on improving circumstances and conditions. This hand-up approach can address a wide range of areas ranging from eliminating contaminated water that poisons those who drink or bathe in it to enhancing the safety of working conditions to developing the requisite knowledge, skills, abilities, attitudes and behaviors for a person to be successful in life.\nThe pivot point areas – areas that can be leveraged and addressed effectively in order to effectuate change and achieve positive outcomes – for purposeful philanthropy are virtually endless.\nWe both practice purposeful philanthropy. Frank Islam’s priority areas are education, arts, world peace, and civic engagement.\nHe chose those areas because they are important to him and because he knows that improvement in them can make a substantial difference. The short reasons for his picking and investing in these areas are as follows:\nEducation is the great equalizer and opportunity creator. It moves people up the ladder and to help others climb the ladder with them. It is the gift that keeps on giving.\nAs President John F. Kennedy said, “Art nourishes the roots of a culture.” It connects and inspires citizens and communities. It has a unifying and healing power.\nWe are living in an increasingly dangerous world and times. World peace is essential for the future of this planet. There is a deadly conflict now and threats of it around the globe which must be controlled.\nThe United States of America and India are the world’s two largest democracies. Civic engagement is essential to keep those democracies vibrant and vital.\nFrank is actively involved in all of these areas contributing considerable time and financial support. He serves on a number of boards and advisory councils including the Kennedy Center Board of Trustees, the U.S. Institute of Peace, the Woodrow Wilson Center, and the Brookings Institution. He also serves on various boards and councils at more than half-dozen universities including Johns Hopkins University, American University, and George Mason University.\nIn contrast to Frank, Ed Crego concentrates the bulk of his investments in a single area – a civics program for middle school students in Illinois called Our American Voice (OAV). OAV is operated by the Barat Education Foundation which is headed by Ed’s wife, Sheila Smith. Over the past seven years, OAV has engaged and empowered hundred of kids from disadvantaged communities across Illinois in its classroom and community projects designed “to create the citizens of tomorrow today.”\nWe name these pivot point areas for illustration purposes only. Each citizen must choose an area or areas that matters to them for their purposeful philanthropy.\nThe essential thing is to make that choice and to invest. The size of that investment isn’t what counts. The act of investment not only of money, but also of time and talent is what does.\nA federal budget of the type that has been proposed will put millions of Americans at risk. Purposeful philanthropy can help reduce and minimize that risk.\nAdvertisement",
    "label": 3
}