{
    "index": 431,
    "text": "FBI Director James Comey 'mildly nauseous' Clinton email probe decisions may have impacted election\nShow Caption Hide Caption FBI Director heads to Capitol Hill The stage is set for another dramatic showdown between FBI Director James Comey and Congress as he returns to Capitol Hill. Nathan Rousseau Smith (@fantasticmrnate) gives us the details. Buzz60\nWASHINGTON – FBI Director James Comey staunchly defended his decision to publicly announce the reopening of the probe into Hillary Clinton's private email server 11 days before the November election, telling a Senate panel on Wednesday it would have been the \"death of the FBI as an institution in America\" had he remained silent about possible new evidence.\nStill, Comey acknowledged the possible repercussions of such a move. \"It makes me mildly nauseous that we would have had an impact on the election,\" Comey told the Senate Judiciary Committee in his most detailed explanation yet of his controversial October action.\nComey: 'Mildly nauseous' about 2016 race impact FBI Director James Comey defends his decision to alert Congress that agents were revisiting the Hillary Clinton email investigation less than 2 weeks before the election. (May 3) AP\nComey said he had no choice but to inform lawmakers about the investigation’s developments in late October, after he learned thousands of Clinton emails had been recovered from a laptop used by former New York Rep. Anthony Weiner, the husband of top Clinton aide Huma Abedin. He recalled the decision as a personal struggle to either \"conceal or speak'' about the rapidly unfolding developments so close to the election.\n\"We had to walk into a world of really bad,'' Comey said. \"I could not see a door labeled, 'No action needed.'\" He declined to respond to repeated questions from senators about whether former Attorney General Loretta Lynch had sought to provide cover for Clinton during the bureau's investigation.\nNevertheless, the director acknowledged that he \"worried'' about the Justice Department's credibility to resolve the inquiry after Lynch's impromptu June meeting with former President Bill Clinton when their planes were parked nearby at the Phoenix's Sky Harbor International Airport. So, Comey said he took it upon himself to first publicly announce the outcome of the FBI's inquiry in July and then re-open it in October. \"Her meeting with President Clinton on that airplane was the capper for me, '' Comey said.\nStill, the director added, \"I wouldn't have done anything differently. I don't have any regrets.''\nClinton has blamed Comey as recently as Tuesday for torpedoing her campaign as the Democratic presidential nominee. The FBI ultimately cleared Clinton of any wrongdoing on the weekend before the election.\nJudiciary Committee Democrats, including Delaware Sen. Chris Coons, contended that the director had applied a double standard by making public remarks about the Clinton inquiry but not acknowledging the FBI's inquiry into possible collusion between associates of President Donald Trump's campaign and Russian officials, which had begun in July.\nBut Comey asserted that he handled the investigations with equal care, adding that the Trump campaign probe, a classified counter-intelligence inquiry, was still in its early stages at the time he announced the closing of the Clinton inquiry in July, re-opened it in October and closed it again without charges in the days before the election.\nYet Iowa Sen. Charles Grassley, the Republican chairman of the committee, said that \"a cloud of doubt hangs over the FBI\" even as it pursues allegations of possible collusion.\nGrassley called into question the very basis of the inquiry, saying that agency had provided him \"inconsistent information\" about the probe.\n\"Where is all the speculation about [Russian] collusion coming from?'' Grassley asked. \"For the good of the country, the FBI needs to get to the truth soon. But we can't wait until this is over to ask the hard questions.''\nComey, in his first public testimony since acknowledging the Russia inquiry to another congressional panel in March, declined to name the targets of the inquiry and specifically refused to address whether Trump was a subject of it.\n\"We will follow the evidence wherever it leads,'' the director said.\nThe U.S. intelligence community has blamed Moscow for orchestrating a campaign to hack Democratic political organizations and release stolen information to undermine faith in the democratic process and candidate Hillary Clinton's campaign. The FBI's investigation of the hack subsequently expanded to included possible \"coordination\" involving Trump associates, but Comey has declined to elaborate on whether any such evidence has been uncovered.\nOn Wednesday, Comey said Russia's cyberwarfare capacity presented the \"greatest threat of any nation on earth.\"\n\"Is it fair to say that the Russian government is still involved in American politics?'' Sen. Lindsey Graham, R-S.C., asked.\n\"Yes,\" Comey said.\nAt the March hearing, Comey said that the Russians appeared to use a third party — what he called a \"cutout\" — in its communications with WikiLeaks, which published internal communications obtained in the hack of the DNC. The identity of the third party was not disclosed.\nAlso in his last Capitol Hill appearance, before the House Intelligence Committee, Comey also delivered a definitive repudiation of Trump's claims that the Obama administration had wiretapped the president's New York offices in advance of the 2016 elections. \"The FBI and the Justice Department have no information to support'' the president's assertions, Comey said during the more than five-hour session.\nSince then, at least two former Trump advisers – Michael Flynn and Carter Page – have been the subjects of fresh scrutiny about their Russian ties.\nFlynn, who was fired as Trump’s national security adviser, is now under investigation by the Pentagon Inspector General for failing to inform Defense Department officials about seeking payments from foreign governments.\nIn February, Flynn registered retroactively as a foreign agent. He disclosed that he had earned $530,000 from a Dutch firm with ties to Turkey’s government. Documents released by Rep. Elijah Cummings, the Maryland Democrat and ranking member of the Oversight Committee, also show that Flynn took more than $33,000 from the Kremlin-backed RT television network for a 2015 speech in Moscow. Russian President Vladimir Putin also attended the event.\nRep. Jason Chaffetz, R-Utah, chairman of the House Oversight and Government Reform Committee, last week called on the Army to determine if Flynn had violated the law and should be required to repay the government. Flynn, \"by all appearances,\" violated federal law by accepting payments from foreign governments without obtaining prior approval, Chaffetz said.\nLast month, the Washington Post also disclosed that the FBI had obtained a secret court order last summer to monitor the communications of Page, an adviser to then-candidate Trump, because the government had reason to believe Page was acting as a Russian agent.\nPage has denied any wrongdoing and Flynn has sought immunity from any possible prosecution. Both the House and Senate Intelligence committees, in the midst of continuing Russia probes, have indicated that it is too early in their investigations to cut a deal for Flynn's testimony. Separately, preliminary discussions about Flynn's prospects for immunity in the FBI investigation also have yielded no agreement.",
    "label": 3
}