{
    "index": 408,
    "text": "Pomp and protests: Inaugurating a president and his movement\nShow Caption Hide Caption Capital Download with Boris Epshteyn Boris Epshteyn, 34, a Republican activist from New Jersey who became one of Donald Trump’s most vigorous defenders on cable TV during the campaign discusses plans for the Jan. 20 inauguration festivities. USA TODAY\nTrump Tower, it’s not. The Presidential Inaugural Committee works out of a nondescript General Services Administration building in southwest Washington, D.C. The bare-bones offices are decorated with hand-cut snowflakes and a few random strings of Christmas lights. Boris Epshteyn, 34, a Republican activist from New Jersey who became one of Donald Trump’s most vigorous defenders on cable TV during the campaign, is now communications director for the operation planning for the Jan. 20 festivities. Questions and answers have been edited for length and clarity.\nQ: A big Inauguration Day on Jan. 20 — and an unprecedented number of protesters expected. Are you concerned?\nEpshteyn: Americans have First Amendment rights and we are very honored that people will come to celebrate this inauguration, and we understand that some will come and protest, and that’s fully within their rights as long as they do it peacefully, and within all applicable laws, rules and regulations.\nQ: What’s the message President-elect Trump wants to convey on that day?\nEpshteyn: It’s all about unity. It’s about the country coming together, being one America, America uniting, and him being the president for all Americans. That’s really the key message.\nQ: There’s been criticism that during the transition he hasn’t done enough to reach out to those who didn’t support him.\nEpshteyn: He’s been very clear that he’s president of all Americans, not just those who supported him, but all Americans and he wants all people to not give up their dreams, not to downsize their dreams, and that goes for all Americans.\nRead more:\nQ: He’s reduced the number of inaugural balls, from the 10 that President Obama had to three. Why?\nEpshteyn: This is not a coronation. It’s an inauguration. It’s a day to work and a day to get to work. And the president-elect, the incoming president, is someone who’s eager to get to work, who’s eager to make sure Americans are safe, to make sure Americans are employed.\nQ: There have been reports you’ve had trouble lining up A-list celebrities. True?\nEpshteyn: Absolutely not. We’ve had celebrities from all over the world reaching out, wanting to perform. But this inauguration is of the people; it’s by the people; it’s for the people. It’s not about celebrities; it’s not about entertainers. ...\nThe election was really a celebration of the Trump movement. And this day, in addition to celebrating the transfer of power, of course brings in the fact that the Trump movement is now coming into power to D.C. in full force. Starting at noon on Jan. 20, Donald Trump will be representing the Trump movement. And what is that? That’s bucking the establishment again, right? That’s going against the special interests, going against the way that things have been a long time in a negative way and bringing in that new, fresh wave.\nQ: President Jackson threw the doors of the White House open.\nEpshteyn: You will definitely see throughout the week specific parts of events, specific representations of the movement and of the openness to the American people of Washington, D.C. Washington, D.C., the special interests — the swamp, as we called it during the campaign — has been closed off from the American people, removed from the American people in a big way, and that’s going to change starting on Jan. 20.\nQ: For example?\nEpshteyn: There’s going to be the welcoming event on Jan. 19. As part of that event you could see something that very much again transcends what Washington, D.C., has been and represents. ...\nIt’s not just a party. It’s a commemoration, a commemoration of the transfer of power but again also of the fact that we are ringing in this new presidency and it’s the Trump presidency, very different from any we’ve seen in the past and very much different from the one we could have seen with Hillary Clinton, if she had won.\nQ: You were one of Trump’s most loyal surrogates during the campaign. You accused Hillary Clinton of using a Gold Star family as a prop; you defended Trump after the Access Hollywood tape was released. Did you ever have a point when you thought, ‘I can’t defend him anymore’?\nEpshteyn: Absolutely not. Absolutely not. Because I always firmly believed that it was binary choice between Hillary Clinton and the leader of Donald Trump, who was effective, who was pragmatic, who was smart and who truly leads. And I always believed that he was the right person for this job and nothing made me waver from that, especially not some of these gimmicks that some of the left tried to throw at him.\nQ: You were born in the Soviet Union; your family immigrated to the United States when you were 11. When New Jersey Sen. Frank Lautenberg died in 2013, you thanked him for pushing the law that let your family in.\nEpshteyn: We were Jewish refugees and we came to this country in the early '90s and Frank Lautenberg was part of this legislation, the Lautenberg Amendment, that allowed for Russian Jews to come to the United States and to go through the specific processes, to follow the laws, rules and regulations. We were refugees. We had a white card, then a green card, and then we studied for the (citizenship) test. My folks took the test and we became citizens — so proud to follow the law and to be citizens of this beautiful country.\nQ: How does that affect you when you see refugees today in Syria and elsewhere?\nEpshteyn: My heart breaks. My heart breaks for the folks, for the people in Syria, the people in Aleppo. It’s an absolutely terrible situation. And I really hope, as Donald Trump said throughout the campaign, that we have safe zones in Syria and have a way for those folks in Syria to be protected and to be safe.\nQ: Do you wish the United States did more for refugees, took in more refugees?\nEpshteyn: I think we do a lot. I think the United States does a ton for folks around the world — folks like ourselves, again, who follow the processes that are laid out. It took us a long time. It took us a long time to apply to be able to come, and then once we came it took a long time to be citizens. ...\nI work hard every single day to do everything I can to not just make my family proud but to make this country proud and thankful that they welcomed us with open arms.\nStay with USA TODAY for full coverage of the 2017 inauguration.",
    "label": 3
}