{
    "index": 402,
    "text": "Social media users cared most about Barron Trump, travel ban in Trump's first 100 days\nDonald Trump's unconventional presidency has enthralled social media users, who are obsessed with following his every move. But the two most captivating topics on social media since President Trump took office were Barron Trump's right to privacy and the temporary travel ban on people from certain Muslim-majority countries.\nThat's according to SocialFlow, a publishing optimization platform used by more than 300 major brands. According to their algorithm, which analyzed content for the most shared, commented and clicked stories about Trump since his inauguration January 20, stories about the youngest Trump son and the ban were the most popular on social media.\nDespite the tension across the political spectrum, social users seemed to rally around the idea that children shouldn't be targets of political fights, said Frank Speiser, co-founder of Social Flow. That chatter lit up the Internet.\n\"This happened with Sasha and Malia (Obama) too,\" Speiser said. \"Both sides of the aisle are inclined to say that you have to leave the kids out of it.\"\nMore surprising to Speiser was the impact of stories about the Trump administration's ongoing attempts to put a temporary travel ban in place. The most shared story was about the federal judge who reversed the first iteration of the ban in February – which was shared more than 116,000 times.\nGiven the attention that the media has paid to issues such as the U.S.-Mexico border wall, health care and Russia, Speiser had expected those stories to do better among social users. But they didn't.\n\"There have been a lot of stories about Russia and Trump, and those stories aren't getting engagement,\" Speiser said. \"I actually went through the queries because I thought, 'That can't be.'\"\nAnother issue that Speiser said social users don't care about: the president's tax returns.\n\"Normally, we use tax returns as a proxy for trust. [People want to know:] Can I trust this politician?\" Speiser said. \"With Trump, it doesn't matter. You're already either for or against him.\"\nOther highlights from SocialFlow's data:",
    "label": 3
}