{
    "index": 144,
    "text": "New York Attorney General Eric Schneiderman issued a warning to Congress -- if the Senate passes the House's legislation repealing and replacing Obamacare, he may sue.\n\"I hope it'll never become law. I hope we'll be able to save a lot of time and trouble and not have to bring this litigation,\" Schneiderman said in an interview with CNN's Erin Burnett Friday night.\nSchneiderman criticized the American Health Care Act, which the House passed Thursday, as not only \"bad public policy\" but \"unconstitutional.\" Schneiderman criticized the bill's ban on government funding for Planned Parenthood, and provision that insurance plans covering abortions aren't \"qualified\" health plans.\n\"Federal funds aren't used for abortions now,\" Schneiderman said. \"This is an effort to cut off funding for breast cancer screenings, education on sexually transmitted disease -- it imposes an undue burden on women's constitutional rights.\"\n\"We are beseeching the Senate to make sure this never becomes the law of the land,\" Schneiderman added.\nIt's unlikely the House's bill will pass the Senate in its current form, as senators indicated they will be making changes to the bill, if not re-writing it entirely.\nMr. Trump expressed confidence Thursday night in New York that the health bill would pass the Senate.\n\"I think we'll get it through,\" he said, according to the White House pool report. \"... The Senate is looking forward to getting it. [Senate Majority Leader] Mitch McConnell knows how to do things.\"\nSchneiderman has made it part of his mission to hold the Trump administration accountable. Last month, he began legal proceedings against the Trump administration for \"violating federal law\" by delaying energy efficiency standards for some products.\n\"I will continue to use the full force of my office to compel the Trump administration to live up to its obligations to the law and the people of New York,\" Schneiderman said in a news release announcing the legal proceedings.\nHe is also supporting efforts to make Mr. Trump's tax returns public. A bill from a New York state senator would force the New York State Department of Taxation and Finance to release New York State income tax returns for all government officials elected statewide -- including the president of the United States.",
    "label": 3
}