{
    "index": 398,
    "text": "This week in OnPolitics: Government renewed for 7 more days\nAs we wrap up the first 100 days of the Trump administration, armchair political pundits spent Friday freaking out about an interview President Trump gave to Reuters in which he described the job of president as more difficult than he expected. But isn't that better than the other way around? If it seemed easier than he expected, it would probably be because he was forgetting a key step, like staffing the executive branch or something. Everything's probably fine; he has another 1,362 days to really learn the ropes.\nAlso in our weekly wrapup: Trump's tax package and the continued existence of both NAFTA and the U.S. federal government itself. It's OnPolitics Today: USA TODAY's politics newsletter. (Subscribe here.)\nDespite low ratings, USA's 'Government' renewed for one more week\nEven after securing the star of NBC's \"Celebrity Apprentice\" as the new face of the series, the federal government continues to suffer through poorreviews and on-set fighting between cast members. In spite of all that, Congress approved a stopgap funding measure to keep government operational for another week to try to work out differences. The House passed the funding bill, 382-30, while the Senate passed the measure on a voice vote; Congress now has until May 5 to hammer out a long-term funding plan.\n\"Today's measure shows the American people that we are making a good faith effort to keep our government open.\" said House Rules Committee Chairman Pete Sessions, R-Texas. \"While this is not ideal, I support this effort to provide our colleagues with more time to reach a final agreement on legislation to fund the government through the fiscal year.\"\n\"The fact that we are here again at the last minute just trying to keep the government open is sad,\" said Rep. Jim McGovern, D-Mass. \"Once again, we have a manufactured crisis at the edge of a cliff.\" (In other words, McGovern thinks all these recent scripts seem pretty contrived.)\nIf you liked the AHCA battle, you'll love the tax reform debate\nPresident Trump released his plan for tax reform Wednesday -- a plan that includes fewer tax brackets, a major cut to the corporate tax rate and increased deductions. If all goes according to plan, the new system would create jobs and economic growth domestically. But if everything doesn't go according to plan, we'll wind up with an underfunded government, severe income inequality and a new series of Tasty videos that tell you how to boil your shoes to make a nutritious leather broth.\n“Lower rates for individuals and families will allow them to keep more of their hard-earned money and empower them to invest more in their future,” said a group statement from Speaker Paul Ryan, Rep. Kevin Brady, Senate Minority Leader Mitch McConnell and Sen. Orrin Hatch “Getting tax rates down for American companies, big and small, will create new jobs and make the United States a more inviting place to do business.”\nSen. Bob Casey, D-Pa., called the proposal \"a massive tax giveaway to millionaires, billionaires and big corporations at the expense of middle class families in Pennsylvania ... It won't create jobs, increase middle class incomes or grow our economy.\"\nTrump forestalls milk/lumber/wall fight\nI received calls from the President of Mexico and the Prime Minister of Canada asking to renegotiate NAFTA rather than terminate. I agreed.. — Donald J. Trump (@realDonaldTrump) April 27, 2017\nOn the campaign trail, Trump promised to renegotiate or withdraw from the North American Free Trade Agreement, which critics have blamed for the loss of U.S. manufacturing jobs since the 1990s. But just as White House aides were drafting an executive order for the U.S. to withdraw from the pact unilaterally, Trump decided to take the negotiation route.\n“It is my privilege to bring NAFTA up to date through renegotiation. It is an honor to deal with both President Peña Nieto and Prime Minister Trudeau, and I believe that the end result will make all three countries stronger and better,\" Trump said in a statement Wednesday.\nThe announcement signaled a cooling of tensions between the North American roommates, one that escalated (as all roommate fights do) over who was using all the milk. Look for the arguments to ramp back up later this year, because America's plan to wall off Mexico's bedroom is still on.\nMore from PoliticsLand\nWho wore it better?\nThe George W. Bush \"Miss me yet?\" billboards, or Barack Obama's \"What's been going on while I've been gone?\"",
    "label": 3
}