{
    "index": 222,
    "text": "Washington (CNN) US President Donald Trump tried to put to rest reports of tensions with Australia's Prime Minister Malcolm Turnbull Thursday, saying their relationship is \"fantastic\" -- and calling reports of a heated phone call between the two in January \"a big exaggeration.\"\nSpeaking to reporters before an event aboard the USS Intrepid, Trump said of Turnbull: \"We get along great. We have a fantastic relationship, I love Australia, I always have.\"\nWhen asked about a January call that reportedly got tense between the two world leaders, Trump said: \"We had a great telephone call. You guys exaggerated that call. That was a big exaggeration. We're not babies. That was a little bit of fake news.\"\nTurnbull agreed with Trump's assessment, saying, \"That's exactly right.\"\n'Dumb deal'\nThe phone call, shortly after Trump took office, centered around a US-Australia agreement made under former President Barack Obama for the US to accept refugees from Australia. Many of them are from the countries affected by Trump's travel ban, which is being contested in court\nAt the time, it was reported that Trump ended the discussion abruptly after angrily telling Turnbull it was his \"worst call\" of the day. Days later, he posted a tweet calling the agreement a \"dumb deal.\"\nDo you believe it? The Obama Administration agreed to take thousands of illegal immigrants from Australia. Why? I will study this dumb deal! — Donald J. Trump (@realDonaldTrump) February 2, 2017\nJames Curran, a professor of history at the University of Sydney, said the January phone call had more impact than the two leaders gave credit Thursday.\n\"The images of Trump fuming down the telephone at the Australian Prime Minister, it rattled the debate in Australia -- Australians weren't used to being talked to like that by a US President,\" he said.\nSince then, the White House has worked to mend relations between the two countries. Trump sat near Turnbull at Thursday night's event and gave a speech that heavily lauded the strong relationship or \"mateship\" between the two countries, saying at one point, \"our two nations were born as the rebellious children of the same parent.\"\nDuring his speech, Trump brought the call up once more.\n\"We had a nice phone call, right?\" Trump said, addressing Turnbull. \"Now the record is straight -- we had a very nice phone call.\"\nTrump added that the call was \"a little testy, but that's OK,\" ending that he's \"very proud of that relationship.\"\nJUST WATCHED Trump and Australian Prime Minister meet Replay More Videos ... MUST WATCH Trump and Australian Prime Minister meet 02:33\n'Amazing snub'\nThursday's dinner was the first meeting between the two leaders since Trump took office.\nThe pair were originally meant to meet in midtown Manhattan, but the introduction was delayed after Trump decided to remain in Washington to celebrate Republicans' House vote on a bill to repeal and replace the Affordable Care Act.\nAn official working with the Australian government said the President's decision to make Turnbull wait was \"an amazing snub.\"\nHowever, a senior White House official said the delay was unavoidable because Trump wanted to mark the health care victory. The official denied it was a \"snub.\"\nSpeaking Friday local time, Australian opposition leader Bill Shorten said he \"didn't like the look of our Prime Minister being kept waiting for three hours.\"\nCurran said Thursday's meeting was the \"ideal venue\" to put the issue over the January call to bed, and dismissed concerns the delayed meeting would be another blow to relations.\n\"It wouldn't have mattered who was waiting for Trump in New York\" after the healthcare bill's passage, he said, \"(anyone) was going to get bumped.\"",
    "label": 3
}