{
    "index": 324,
    "text": "A pioneering, California-led effort to create retirement security for low-income workers has been thrown into jeopardy after the U.S. Senate voted Wednesday to block states from starting programs to automatically enroll millions of people in IRA-type savings plans.\nThe measure, aimed at stopping the fledgling state retirement programs, now goes to President Trump, who has vowed to sign it.\nFor the record: A previous version of this article said that employers can opt out of the program if they choose. Employees can opt out.\nThat leaves lawmakers in California, Illinois and other states who only months ago were celebrating the success of their long-planned initiative scrambling to regroup. The Senate voted 50 to 49 to stop the state plans.\nThe retirement programs that were about to launch in seven states and are under consideration in many more were targeted by Wall Street firms and the U.S. Chamber of Commerce.\nThe vote reflected the renewed influence of the business lobby in Washington since the 2016 election, with lawmakers defying the 38-million member AARP, a vocal supporter of the auto-IRA program. The seniors group had warned senators that its members would hold them accountable for their votes.\nAdvertisement\n“Nobody had a problem with this except for the big Wall Street companies who invented in their mind that they would be losing business to these state innovations,” said Sen. Christopher S. Murphy (D-Conn.), whose state was moving to implement an auto-IRA program. “This is a terrible, terrible thing we are doing,” he said of the Senate’s vote to undermine the state programs.\nThe California Secure Choice program and similar retirement laws generally require employers with no retirement plans to automatically invest a small percentage of each worker’s pay in a state-sponsored retirement account. Employees can opt out of the program if they choose.\nThe money is managed by private investment firms that partner with the states. The accounts are intended to help build financial security for some 55 million workers nationwide whose employers do not offer a retirement plan.\nThe push to implement the programs was delayed for years by complicated federal Labor Department rules governing such investment pools. In its final months, the Obama administration gave states the green light to pursue their vision. But Congress has now voted to revoke that authority, leaving the programs in limbo. Opponents of the state programs say they became too risky for consumers after the federal rules were changed.\nSen. Orrin G. Hatch (R-Utah) denounced the regulation permitting the retirement plans as something “that President Obama personally ordered Labor Secretary Tom Perez to draft as a gift to certain blue states.”\nDemocrats on the Senate floor charged such arguments were a smoke screen to obscure an effort to protect the profits of big investment houses concerned their business could be eroded if companies moved their employees into state-sponsored plans.\nThe congressional vote brought to a head an early confrontation between California and the Trump-era Congress. The retirement law is a signature achievement of California Senate leader Kevin de Leon, who worked on it for years.\nThe House passed the measure to block the programs in March at the urging of De Leon’s fellow Californian and longtime political rival, Kevin McCarthy of Bakersfield, the House majority leader.\nDe Leon has vowed to push ahead with the state’s effort, saying California can redesign its program to avoid federal approval. But such a redesign would make it more vulnerable to legal challenge, and probably delay implementation.\nCalifornia and other states were moved to address the large share of the workforce not enrolled in any retirement plan after efforts to create a federal automatic IRA program stalled years ago. Reports by some bipartisan think tanks and policy analysts suggest the programs could ultimately save states billions of dollars by creating a measure of financial security for elderly Americans who otherwise end up on the rolls of Medicaid, food stamps and other safety-net programs.\nevan.halper@latimes.com\nFollow me: @evanhalper\nALSO\nHouse approves $1-trillion bipartisan spending bill as GOP prepares for Thursday vote on Obamacare repeal\nCalifornia shows why the Republican plan to rely on states to replace Obamacare may not work\nFed holds key interest rate steady, downplays recent weak economic data",
    "label": 2
}