{
    "index": 339,
    "text": "The Supreme Court expanded the reach of federal housing law Monday, ruling that cities — including Los Angeles — can sue major banks for discriminatory lending practices that hurt low-income neighborhoods during the Great Recession.\nThe decision gives city leaders a potentially powerful weapon against lenders, including those who were accused of predatory practices that triggered the foreclosure crisis after 2008.\nUntil now, these legal claims faced an apparent obstacle. The Fair Housing Act forbids racial discrimination against “any person.” Lawyers for the banks said the law protected only people who suffered discrimination, not cities.\nBut by a 5-3 vote, the justices said cities can be an “aggrieved person” who can sue over the impact of housing discrimination on the city’s finances. Justice Stephen G. Breyer cited rulings from the 1970s that interpreted the civil rights law broadly, including by allowing city officials to sue real estate agents who were turning away black and Latino home buyers.\nMonday’s decision cleared the way for the city of Miami to sue Bank of America over allegations that it “intentionally targeted predatory practices at African American and Latino neighborhoods,” which in turn led to “foreclosures and vacancies” that sharply reduced property tax revenues.\nAdvertisement\nLawyers for the banks had appealed, arguing the suits should be tossed out. But the high court disagreed.\n“We conclude that the city’s financial injuries fall within the zone of interests that the Fair Housing Act protects,” Breyer said in an opinion that was joined by Chief Justice John G. Roberts Jr.\nThe city attorneys for Los Angeles and San Francisco had told the court they had lodged similar suits against the banks.\nBut Monday’s ruling was only a partial victory for the cities.\nThe justices said they were not convinced that discriminatory lending “caused” the city’s loss in property tax revenues.\nIt is true, Breyer said, the housing market “causes ripples” to flow through the city’s economy. But for the city to win damages, it must show some “direct relation” between the alleged predatory lending and its effect on the city’s coffers.\nThe justices sent that issue back to a lower court to be reconsidered. Justices Ruth Bader Ginsburg, Sonia Sotomayor and Elena Kagan joined Breyer and Roberts in the majority.\nJustices Clarence Thomas, Anthony M. Kennedy and Samuel A. Alito Jr. said the suit should have been tossed out. Thomas said the anti-bias law should be limited to people who have been the victims of discrimination, not cities complaining about the impact of housing bias.\nCivil rights lawyers had joined the case on the city’s side and applauded the ruling.\n“With this decision, the Supreme Court has acknowledged the crucial role of municipal governments in protecting residents’ rights,” said Dennis Parker, director of the ACLU’s racial justice program. “In housing and lending as in other areas, cities can and should serve as a bulwark against discrimination.”\nDaniella Casseres, a housing lawyer in New York, said the court’s ruling “gives local authorities a very powerful tool to continue defending against lending discrimination in a political environment where federal enforcement may soon be curbed.”\ndavid.savage@latimes.com\nOn Twitter: DavidGSavage",
    "label": 2
}