{
    "index": 321,
    "text": "Richard Figueroa still shudders at the memory of the calls he fielded as enrollment director of California’s special health plan for sick patients who’d been rejected by insurers.\nDesperate callers pleaded to get off the waiting list as cancer or other illnesses worsened. Enrollees struggled to understand why the plan would not cover all the treatment they needed.\nMost heart-wrenching were the quiet, polite calls from those who’d received a letter that a sick relative could finally get on the plan. “They would say, ‘Thank you, but you can give our slot to someone else, because my brother or my wife or my daughter has died,’” Figueroa recalled.\nCalifornia’s high-risk pool — like similar overstretched state plans around the country —became obsolete when the Affordable Care Act established a new federal system to guarantee coverage to Americans even if they’re sick.\nNow President Trump and congressional Republicans are trying to shift responsibility for overseeing health protections back to states. This approach, including re-creating state high-risk pools, is a cornerstone of the GOP healthcare bill that Republicans are laboring to get through the House this week.\nAdvertisement\nGOP House leaders announced late Wednesday that they plan to hold a vote Thursday. House Majority Leader Kevin McCarthy predicted they have enough votes for passage, despite earlier struggles to win over moderates and conservatives.\nBut California’s experience underscores the limitations of what states can do on their own.\nThe nation’s most-populous state tried repeatedly over the years to plug the many holes in its healthcare system. Yet even with a huge economy, extensive medical system and committed advocates, including in powerful industries, California came up short, again and again.\n“We did all these things as stop-gaps,” said Figueroa, who now works at the California Endowment, one of the state’s largest foundations. “None of it was enough.”\nWhen President Obama signed the federal health law in 2010, nearly 20% of Californians — about 6 million people — lacked health coverage.\nToday, by contrast, the state’s uninsured rate is below 9%, as California has used the federal funding and insurance rules enacted through the Affordable Care Act to extend health protections to hundreds of thousands of previously uncovered Californians.\n“Once we had that framework and the federal funding, we were off to the races,” said Anthony Wright, the longtime head of Health Access California, one of the state’s leading consumer advocates. “But without it, it was very, very hard. … We have the experience to show that if health reform was easy at the state level, California would have done it. We couldn’t.”\nThe state’s healthcare struggles are hardly unique.\nIn the decades before Obamacare, some states — including Arizona, Washington, Kentucky, Maine, Minnesota and New York — tried to expand health protections for their residents by bolstering safety net health programs or rewriting insurance rules to ensure sick customers could get coverage.\nBut most states — including many with the highest uninsured rates, such as Texas, Florida and Georgia — never undertook serious efforts to guarantee coverage.\nAnd although there were some modest successes, mostly in expanding Medicaid coverage, nearly every state effort to guarantee coverage failed until Obamacare made such protections possible nationwide.\nIn fact, in the last two decades, only Massachusetts successfully crafted a healthcare overhaul that provided all of its residents with insurance protections. That 2006 initiative — which was heavily subsidized by the last Bush administration — became the model for Obamacare.\nWe have the experience to show that if health reform was easy at the state level, California would have done it. We couldn’t. — Anthony Wright, head of Health Access California\nCalifornia elected officials labored for years to build their own system of health protections. The state long had among the highest uninsured rates, despite being a hub of healthcare innovation whose leading medical centers have been international destinations.\nMedi-Cal, the state’s Medicaid safety net, was perpetually overburdened as it struggled to care for millions of poor Californians.\nAnd insurance companies worked aggressively to exclude sick, costly customers, in many cases rescinding policies after customers got ill by alleging they misrepresented their medical histories.\n“The market was a disaster,” said Tom Epstein, a former senior executive at Blue Shield of California, one of the state’s leading insurers.\nAmong other things, California tried to require large employers to provide health coverage to their workers, though that effort was defeated in a statewide referendum just months after it was enacted.\nThe state adopted insurance rules to give consumers more power to challenge decisions by health plans, though state leaders were never able to make insurers cover all sick patients.\nIn 1991, the state set up the Major Risk Medical Insurance Program, commonly called “Mr. Mip,” a high-risk insurance pool to offer a lifeline to patients who’d been turned down for coverage on the commercial insurance market.\nBy the late ’90s, the plan, which was funded in part by premiums and in part by a voter-approved tobacco tax, was serving 22,000 people.\nBut as premiums soared because insuring sick patients was so expensive, the program became increasingly difficult to sustain. Enrollment was capped, as were benefits. The plan would only cover $75,000 of enrollees’ medical costs per year.\nBy 2010, when Obamacare was signed, the cost for a 50-year-old consumer in the Sacramento area who wanted a PPO plan had soared to $878 a month.\n“It was a nice little program for a few thousand people,” said Lucien Wulsin, former head of the Insure the Uninsured Project, a state advocacy group. “But we never got close to reaching the hundreds of thousands of Californians who needed help.”\nFinally in 2007, then-Gov. Arnold Schwarzenegger, a Republican, launched a sweeping campaign to push through a major healthcare overhaul to extend coverage to millions of uninsured Californians.\nThe landmark effort, in which Schwarzenegger partnered with Democrats in the state Assembly, picked up critical support from hospitals, patient groups and even some insurers and leading businesses.\nBut the effort ultimately collapsed amid opposition from advocacy groups on the left and right, and questions about how the state could pay for extending health coverage.\n“Engaging in comprehensive reform is not for the faint of heart,” said Kim Belshe, who served as health secretary under Schwarzenegger. “You are talking about nearly 20% of the state’s economy. You are talking about issues that affect people in the most personal way. And you are dealing with the pocketbooks of a diverse array of healthcare providers, each of which have their own interests.”\nBelshe and others credit that effort for helping setting the stage for the state’s aggressive implementation of the Affordable Care Act, which Schwarzenegger and other state leaders enthusiastically embraced.\nCalifornia has undertaken a massive expansion of its Medicaid program and runs an insurance marketplace — Covered California — that is widely seen as a national model.\nThe state has recorded among the largest drops in its uninsured population, and though costs remain a challenge, most California consumers can still shop among many health plans that are required by the state to offer lower out-of-pocket costs for some medical care than the federal standard.\nDoctors, hospitals, insurers, patient advocates and elected officials now worry that progress in California will be reversed if the federal law is rolled back and the state is once again left on its own.\nSaid Figueroa: “It’s so odd to think that we would even consider going back to the bad old days.”\nnoam.levey@latimes.com\nTwitter: @noamlevey\nALSO\nAs latest Obamacare repeal effort fades, Republicans wonder what happened\nObamacare 101: Would sick Americans still be able to get insurance under the House Republican bill?\nGOP shuts out doctors, experts, Democrats — pretty much everybody — as they work on Obamacare repeal\nUPDATES:\n5:20 p.m.: Updated with information on Republican plans to vote Thursday on their healthcare measure.\nThis article was orginally published at 11:40 a.m.",
    "label": 3
}