{
    "index": 347,
    "text": "President Trump, smarting at the notion that he was outmaneuvered by Democrats in their first real legislative showdown, is musing openly about seeking to scrap one of the last remaining checks the minority party has, even suggesting he might welcome a government shutdown this fall to further that end.\nFrom the Rose Garden and his Twitter account Tuesday, Trump did little to hide his frustration with hardening conventional wisdom that the $1-trillion spending plan Congress expects to vote on this week represents a setback for his governing agenda, despite his party having the strongest grip on power in the capital in more than a decade, controlling the House, Senate and White House.\nMeanwhile, members of both parties were at a loss to explain how what had on Monday appeared to be a rare bipartisan achievement in Washington had evolved 24 hours later into the source of recriminations.\nAs has often been the case with the president, this episode began with a morning series of postings on social media, in which Trump seemed to concede the funding package he signed off on over the weekend — one that largely preserves funding for items he promised to slash, but does not advance his promised border wall — was full of concessions to Democrats.\nHe then laid out options that could absolve him of the need for such compromise in the future: for voters to swell the party’s ranks in the chamber to surpass the 60-vote threshold to overcome filibusters, or for Senate Republicans to eliminate the ability of any senator to demand a three-fifths majority to advance major legislation.\nAdvertisement\nHe capped that with a remark that seemed to embrace a fiscal crisis as a way to push his agenda.\n“Our country needs a good ‘shutdown’ in September to fix mess!” the president tweeted.\nAides later said Trump bristled at comments from Democrats claiming victory in the spending fight, as became clear when the president appeared in the Rose Garden hours later.\nFlanked by members of the Air Force Academy football team in military dress, Trump boasted of the deal’s higher spending levels on defense, “historic investments in border security,” and funding for charter school programs. Put together, he said at the event congratulating the team, “our Republican team had its own victory under the radar,” Trump said.\n“And we didn’t do any touting like the Democrats did,” he added, before praising new military spending that he said fulfilled a core campaign promise.\nDemocrats had indeed been quick Monday to hail provisions of the spending bill that protected their priorities while averting what they called “poison pill” amendments like one to cut off funding for Planned Parenthood. But legislative leaders from both parties were also eager to sell the package as an example of compromise that was possible if all sides acted in good faith.\n“This deal is exactly how Washington should work when it is bipartisan: Both parties negotiated and came to an agreement on a piece of legislation that we can each support. It is truly a shame that the president is degrading it because he didn’t get 100% of what he wanted,” Democratic leader Charles E. Schumer of New York said on the Senate floor.\nHouse Speaker Paul D. Ryan (R-Wis.) groused at having to respond to another presidential Twitter flurry as he faced reporters shortly after the tweets were posted.\n“When you look at the bill, there’s a lot of good conservative wins here,” he insisted.\nOn Monday morning, Trump had indicated he was satisfied with the agreement and noted both sides could claim victory. But by late Monday, Trump’s budget chief, Mick Mulvaney, was dispatched to the White House briefing room to proclaim victories for the administration.\n“I’d be hard-pressed to figure how we could fund more of the priorities,” he said then.\nBy the time the budget chief spoke to reporters again Tuesday afternoon, he said Democrats had tainted future negotiations.\n“The president is frustrated with the fact that he negotiated in good faith with the Democrats and they went out to try and spike the football and make him look bad,” Mulvaney said. If Democrats don’t change that posture, he added, a shutdown “may be inevitable.”\nIt wasn’t clear why the president believed a government shutdown — a costly, inconvenient and embarrassing affair — would be beneficial at a time when Republicans control the White House and both chambers in Congress. The White House also could not clarify whether Trump was calling for an actual government shutdown; his tweet put the term in quotation marks, which he sometimes cites later as a sign he was not speaking literally.\nThe last federal shutdown occurred during a standoff between President Obama and Republicans in 2013 over healthcare, lasting 16 days. In Congress, neither side of the aisle wanted a repeat of that.\n“That the president would say, in effect, what this country needs is a good shutdown just speaks in volumes as to his insensitivity to what a shutdown means, or his lack of knowledge … of what a shutdown means,” House Minority Leader Nancy Pelosi (D-San Francisco) said in an interview.\nShe questioned whether the comment was reflective of the advice of Mulvaney, a former South Carolina representative whom she called a “ringleader” of the 2013 shutdown.\n“What’s he complaining about? That left to their own devices, the Congress came to agreement?” she asked, noting that securing Democratic votes in both the House and Senate has become essential to any government funding effort.\nIf the House and Senate do pass the spending bill this week as expected, it will fund government operations through the close of the fiscal year on Sept. 30. White House officials say Trump will be in even a stronger negotiating position by then.\n“We’re hopeful that we can see as we go through the 2018 process … more of a Republican-driven process, especially in the House, which would be a little bit more typical,” Mulvaney said Monday.\nBut on the legislative front, it’s unclear just what else Republicans will be capable of passing, given ongoing internal divisions and an emboldened Democratic minority.\nTrump has been increasingly focused on the filibuster hurdle in the Senate. He called the chamber’s rules “archaic” in an interview on Fox News last week, one of many he sat for that was intended to promote his accomplishments during his first 100 days.\nBut while Senate Majority Leader Mitch McConnell (R-Ky.) was willing to deploy the so-called “nuclear option” to change Senate rules and allow Trump’s Supreme Court nominee to advance with a simple majority vote, he and other Republicans have indicated that they are not inclined to lower the voting threshold to overcome a filibuster for legislation.\n“There is an overwhelming majority on a bipartisan basis not interested in changing the way the Senate operates,” McConnell told reporters Tuesday. “That will not happen.”\nThe Trump administration is set to release a more detailed budget blueprint for 2018 later this month, part of a process that Republicans hope will be a vehicle to enact a far-reaching tax plan. First, they still hope to restart an effort to repeal and replace the Affordable Care Act, known as Obamacare.\nIt is possible for Republicans to secure both without Democratic votes, McConnell said.\n“On everything else, the Senate has been known for its bipartisanship, and you’re seeing a perfect example of it on the spending bill that will be on the floor this week,” he said.\nmichael.memoli@latimes.com\nFor more White House coverage, follow @mikememoli on Twitter.\nALSO\nCongress is on track with sweeping spending deal, but not much else\nTrump’s ‘big beautiful wall’ is not in the spending plan. Will it ever get built?\nTrump holds a 100-day rally on friendly turf, snubbing the White House Correspondents’ Dinner",
    "label": 3
}