{
    "index": 354,
    "text": "This secluded corner of New Jersey has been home to so many luminaries that it is barely worth the effort to drop all their names. Lamborghinis and Maseratis glide down what used to be quiet farm roads. It was once common to see Jacqueline Onassis passing through on her way to the annual foxhunt.\nThe blase attitude toward fame in the township of Bedminster seems unlikely to change with its newest distinction: the favored summer retreat of President Trump, who is scheduled to spend this weekend there.\n“Having a celebrity in town per se doesn’t move the needle much,’’ said Bedminster Mayor Steve Parker. “Of course, when you have black limousines and the Secret Service and it’s the president of the United States that takes it up a notch.’’\nThe Trump National Golf Club Bedminster is already nicknamed the summer White House. (Carolyn Cole / Los Angeles Times)\nThe summer White House, as it is already being nicknamed, is located on the former estate of failed automaker John DeLorean. Trump bought it out of bankruptcy in 2002 and developed the property and neighboring parcels into the Trump National Golf Club.\nAdvertisement\nFor more than a decade, the Trump family has summered at the club. His eldest daughter, Ivanka, was married at the clubhouse and Trump reportedly likes the place so much that he once spoke about being buried here.\nUntil recently, the Trumps didn’t attract much notice in town, slipping in easily among the wealthy. Among the neighbors are Robert Wood “Woody” Johnson IV, owner of the New York Jets and Trump’s nominee for ambassador of the United Kingdom, and Steve Forbes, the publishing executive who ran twice for the GOP presidential nomination. Former New Jersey Gov. Tom Kean, another Republican, also lives in town.\n“He was just another guy who came and developed the area,’’ Kevin Welsh, who runs a car dealership here, said of Trump.\nBedminster (population about 8,000), an hour west of Manhattan, is not as flashy as the Hamptons, where rich New Yorkers head on the weekends to swim in the Atlantic and party with one another. There are only a handful of restaurants and shops. The estates are tucked behind uninterrupted expanses of green, making the entire town look like one big golf course.\nBedminster, N.J., is a wealthy community with many horse farms. (Carolyn Cole / Los Angeles Times)\nUnlike more secretive rich folk, the Trumps are hardly sequestered behind the gates of their estate. Many people in Bedminster said they’d mingled with Trump family members at the clubhouse and swimming pool.\n“We’d go down to the pool and see them,” said Caitlin Swallow, 23, who works at the stables nearby. “They interact with everybody else.”\nThe Trump compound covers 535 acres. It has two 18-hole golf courses and various homes, one of which belongs to Ivanka Trump. The setup at Bedminster is similar to Mar-a-Lago, Trump’s resort in Palm Beach, Fla., which shuts down for the hot summer.\nTrump mingles with well-heeled guests who reportedly have paid up to $300,000 for their memberships.\n“You are special people and this is a special place,’’ Trump told club members on his last visit, 10 days after the election, according to a tape recording that was obtained by Politico.\nSimilar to his discussion of a North Korean missile launch in front of Mar-a-Lago diners who snapped photos for social media, Trump offered Bedminster members a glimpse into the formation of his Cabinet.\nRiding coach Caitlin Swallow, 23, says Bedminster, N.J., residents are used to famous people and probably won’t have any problems with President Trump’s visits. (Carolyn Cole / Los Angeles Times)\n“You may wanna come around,” he said on the tape. “It’ll be fun…. We’re going to be interviewing everybody — Treasury, we’re going to be interviewing secretary of State…. If you want to come around, it’s going to be unbelievable.”\nDuring that visit, Bedminster residents complained about the hours-long traffic jams behind a 14-car motorcade that blocked the Lincoln Tunnel coming out of New York and nearby roads. But otherwise, relations between Trump and the community appear to be harmonious.\nThere is little sign of the friction that marred his relationship with Palm Beach County, which he’d sued for $100 million, claiming its international airport allowed planes to buzz Mar-a-Lago.\nTrump tweeted on Friday morning that after a reception in New York City on Thursday night he decided to go to Bedminster rather than his midtown home in Trump Tower, where security costs are estimated at more than $300,000 a day when the president is there.\n“Rather than causing a big disruption in N.Y.C., I will be working out of my home in Bedminster, N.J. this weekend. Also saves country money!‘’ he wrote.\nIf protesters show up, they are unlikely to get within shouting distance of Trump. His residence inside the golf course is nearly a mile away from the main road, the turnoff of which is blocked by a guardhouse.\nBedminster is largely Republican, like all five members of the township committee. Trump won by 42 votes here in November.\nThe golf course is the second-largest taxpayer in town and has provided discounts to host numerous charity banquets for the Fire Department and Parent Teacher Organization.\n“By and large, most Bedminster residents would view the golf course and Trump Organization as a positive force in town,” the mayor said.\nNevertheless, there are worries about the burden on a Police Department that has only 18 officers.\nThe township has asked for police help this weekend from neighboring communities and is likely to apply for federal assistance for the overtime costs of policing the roads during presidential visits. The mayor estimated there would be seven presidential visits over the summer and fall, which would cost the town a total of $300,000 for security.\nSome Bedminster residents are hoping that the presidential visits will give the business community a boost.\n“Those Secret Service guys, they have to eat right?” said Janet Wagner, a retiree who was getting her hair done earlier this week.\nLongtime Bedminster resident Janet Wagner says she’s is only worried about the traffic the president’s visit may cause. (Carolyn Cole / Los Angeles Times)\nbarbara.demick@latimes.com\nTwitter: @BarbaraDemick\nALSO\nTrump’s raucous return to his hometown\nTrump order on religion fits a pattern — words bigger than deeds\nFirst overseas foray for Trump will take him to sensitive turf: Saudi Arabia, Israel and the Vatican\nUPDATES:\n11:52 p.m.: This article was updated to include Trump’s tweet about Bedminster.\nThis article was originally published at 3 a.m.",
    "label": 3
}