{
    "index": 302,
    "text": "Tomorrow, Donald Trump plans to mark his 100th day in office with a rally in Pennsylvania, the state that, as much as any, symbolizes his upset victory over Hillary Clinton in last fall’s election.\nIf he stays true to his practice, the president will denounce the media for unfair coverage, complain about Democratic obstructionism and tout his achievements.\nWhat he most likely won’t do is review the full list of promises he made at another Pennsylvania rally two weeks before the November election.\nGood afternoon, I’m David Lauter, Washington bureau chief. Welcome to the Friday edition of our Essential Politics newsletter, in which we look at the events of the week in Washington and elsewhere in national politics and highlight some particularly insightful stories.\nAdvertisement\nMANY PROMISES, FEW KEPT\nIn the final weeks of the 2016 campaign, Trump set out his promises with great specificity. The Contract with the American Voter, which he described in his speech at Gettysburg, Pa., on Oct. 26, included more than two dozen specific items, some of which he said he would do on his first day, others within the first 100.\nNot many of those have happened, and now that he’s hit the 100-day mark, Trump has backed away.\n“Somebody put out the concept of a hundred-day plan,” he told the Associated Press in an interview a few days ago.\n“But things change,” he added. “There has to be flexibility.”\nAs a new USC Dornsife/Los Angeles Times poll shows, many of Trump’s supporters are willing to grant him that flexibility — up to a point.\nAccording to the survey, more than 90% of people who voted for Trump in 2016 said they would do so again.\nMark Barabak found a lot of that sort of sentiment when he traveled to Pueblo, Colo., a formerly Democratic area that swung to Trump in the last election. Few voters there express regrets, Barabak reported.\nBut the poll also showed that an increasing number of voters, including Trump backers, have started to doubt if he will keep his promises.\nThey have reason to worry. A review by The Times found that of 31 key promises, only four have been fulfilled so far, while five have been abandoned. Many have been stalled or scaled back.\nOver time, failure to live up to promises can erode support for a president. Whether that happens in Trump’s case won’t be answered in the first 100 days, but will be a central question for the rest of this year.\nMeanwhile, though Trump can’t point to a lot of policy accomplishments, he has changed the emotional climate of American politics. Opposition to him has pushed the Democrats to the left, as Lisa Mascaro vividly described in a report from Wisconsin.\nHEALTHCARE BLAME GAME\nAmong the stalled promises is Trump’s pledge to repeal the Affordable Care Act and replace it with something “great.”\nTrump suffered an embarrassing defeat in March when House GOP leaders had to pull the Obamacare repeal bill from the floor because they lacked the votes to pass it. In the last week, White House officials and lawmakers have worked overtime to try to come up with a new version they could bring back for a vote.\nThis week, they announced they had that new version. A key provision would give states the option of dropping most of the consumer protections included in the Affordable Care Act. As Noam Levey reported, the administration and its allies have kept their talks to a closed circle, not consulting with insurers, medical groups, moderate members of the House or the Senate.\nThe resulting bill — more to the liking of conservatives than the previous version — won support from members of the House Freedom Caucus who opposed the last one. But the shift to the right dismayed many Republican moderates.\nWhite House officials spent much of the week pressing House leaders to hold a new vote on healthcare so Trump could claim a win before the 100-day clock ran out. Late Thursday, however, House Majority Leader Kevin McCarthy (R-Bakersfield), who is close to Trump, announced that no vote would be held; Republicans still lack the votes for passage.\nMany Republicans told reporters that they thought the week’s developments had been mostly for show — not an effort to pass a bill so much as an attempt by the Freedom Caucus to shift the blame away from themselves.\nWhile that was going on, the White House indicated on Wednesday that the administration would continue to fund key insurance subsidies under Obamacare, which Trump had threatened to hold hostage.\nHere’s a primer on those cost-sharing subsidies and why they’re important to the continued functioning of the law.\nIn the first 100 days, healthcare has tested whether Republicans, given unified control of government, could turn their promises into policy. So far, the answer appears to be no.\nWILL TAX REFORM BE EASIER?\nTrump appeared to take aides by surprise last week when he said in an interview that he would release a tax plan on Wednesday.\nThe resulting plan was little more than a sketch — a single sheet of paper listing principles with no details, as Noah Bierman and Jim Puzzanghera wrote.\nHow much the plan would reduce government revenue, how people at different income levels would be affected, what the impact might be on the economy — none of that was answered. Indeed, the next day, administration officials could not agree on whether Trump’s plan would end the popular tax deduction for 401(k) retirement accounts. (It wouldn’t, the White House eventually announced).\nAs Don Lee noted, many of the economic policies embedded in Trump’s tax plan contradict other economic policies that are part of his trade agenda, or his immigration plans. The administration lacks a overall economic vision that holds together, analysts said.\nTrump’s aides, including Treasury Secretary Steve Mnuchin, argue that his plans could spur much faster economic growth — expansion of 4% per year or more. Many independent economists scoff at that. So far this year, the economy has grown at an anemic 0.7%, Puzzanghera reported this morning.\nBACKING AWAY FROM THE BORDER WALL\nAnother promise going by the wayside, at least for now, is Trump’s proposed wall on the southwestern border.\nThe White House had wanted Congress to include millions of dollars to get the wall started as part of a stopgap spending bill. But as Mascaro reported, neither Democrats nor Republicans want to pay for Trump’s wall.\nLate Tuesday, Trump backed down, dropping his insistence that Congress include money for the wall in the spending bill. White House officials say they’ll renew the request in October.\nHomeland Security Secretary John Kelly has already made clear that the border barrier won’t stretch from “sea to shining sea,” as he put it. And he’s also said that in some places the barrier will be a fence, or perhaps electronic monitoring, not a wall. The longer the discussion goes on, the more the upshot sounds like more of what the government already built under Presidents George W. Bush and Obama.\nLacking big, visible accomplishments in areas like immigration, the administration has fallen back on smaller ones. This week, Kelly announced his department was creating a special office to assist people allegedly harmed by illegal immigrants, Joe Tanfani wrote.\nMeanwhile, the administration continues to lob rhetorical volleys at so-called sanctuary cities, local jurisdictions that to one extent or another refuse to participate in some federal immigration enforcement actions.\nThis week, Federal District Judge William H. Orrick granted San Francisco and Santa Clara County an injunction forbidding the administration from cutting off funds, as Trump has threatened to do.\nAs David Savage wrote, Trump’s threats could be undone by the type of conservative rulings he has praised in the past. In particular, a 5-4 decision by the late Justice Antonin Scalia provides strong support for Orrick’s ruling.\nThe federal government “may not compel the states to enact or administer a federal regulatory program,” Scalia wrote in that case, in which conservatives challenged federal efforts at gun control. Now, it will be liberals going to court, and they’ll be citing those rulings limiting federal power.\nAND NAFTA\nTrump was poised this week to announce that the U.S. would begin the process of pulling out of the NAFTA treaty with Canada and Mexico. But he backed away.\nHe has, however, picked several smaller fights over trade, including an announcement this week that the U.S. would impose large tariffs on imported Canadian lumber, Lee reported. That will please American lumber producers in the Northwest and elsewhere, but could raise the costs of home building.\nLESS HESITATION ON THE ENVIRONMENT\nThe policy area where the new administration has shown fewest second thoughts is the environment. On that front, Trump has been “a wrecking ball right out of the gate,” Rep. Jared Huffman of San Rafael, a top Democrat on the House Natural Resources Committee, told Evan Halper.\nThe administration has moved rapidly to start dismantling regulations and policies opposed by the coal and oil industries.\nEarlier this week, Trump signed an executive order that could lead to elimination of some national monuments.\nToday, he announced an order that could, over time, lead to more offshore drilling for oil and gas — and a further confrontation with coastal states, including California.\nThere is hesitation on one front: Some Republicans are rethinking whether Trump should pull the U.S. out of the Paris agreement to limit global warming, Halper wrote.\nThe U.S. might do better staying with the agreement and seeking to limit it, some lawmakers and industry officials argue. But some conservatives see yet another Trump promise melting away.\nTAKING THE KREMLIN’S RUBLES\nNot all the week’s news involved abandoned promises. The investigation into Russia’s interference in the election also got new developments.\nLegal problems worsened for former national security advisor Mike Flynn, who is under investigation by the Pentagon’s inspector general, Glenn A. Fine, for taking more than $500,000 from Russian and Turkish interests, David Cloud reported.\nRetired military officers need advance approval to accept money from foreign governments. Flynn, a retired lieutenant general, appears not to have gotten that approval, according to the two leaders of the House Oversight Committee, Reps. Jason Chaffetz (R-Utah) and Elijah Cummings (D-Md.).\nFlynn also figures in the FBI investigation into whether anyone associated with Trump or his campaign cooperated with Russia in its efforts to influence the presidential election. With Atty. Gen. Jeff Sessions recused, supervision of that probe will fall to the department’s No. 2 official, Deputy Atty. Gen. Rod J. Rosenstein.\nRosenstein won confirmation on Tuesday with bipartisan support. Joe Tanfani wrote an excellent profile.\nALL THE PRESIDENT’S TWEETS\nTwitter has long been Trump’s favored means of pushing his message. We’re compiling all of Trump’s tweets. It’s a great resource. Take a look.\nGRADE THE PRESIDENT\nCatch up on the events of the past 100 days, and let us know how you would grade Trump’s performance.\nLOGISTICS\nThat wraps up this week. My colleague Sarah Wire will be back Monday with the weekday edition of Essential Politics. Until then, keep track of all the developments in national politics and the Trump administration with our Essential Washington blog, at our Politics page and on Twitter @latimespolitics.\nSend your comments, suggestions and news tips to politics@latimes.com.\nIf you like this newsletter, tell your friends to sign up.\nDavid.lauter@latimes.com\n@davidlauter",
    "label": 3
}