{
    "index": 335,
    "text": "Portland police said Monday that numerous arrests have been made during May Day protests in their city, including three people arrested near Pioneer Square.\nPolice asked everyone to stay away from downtown as fires were being reported and fireworks, smoke bombs and Molotov cocktails were being thrown at police.\nThere was no immediate information on whether anyone was injured.\nThousands of people took to the streets across the nation Monday to march in May Day rallies, calling for immigration reform, workers’ rights and police accountability.\nGalvanized by President Trump’s initiatives on immigrants in the country illegally, diverse crowds of demonstrators held peaceful rallies in cities such as Los Angeles, Chicago, New York City and Miami.\nAdvertisement\nIn Atlanta, about 200 rallied under gloomy skies holding “ICE Get Out” banners and “Not One More Deportaton” placards to protest recent arrests and deportations by Immigration and Customs Enforcement agents, and to call on Atlanta officials to extend more protections to immigrants.\nAline Mello, a 28-year-old from Brazil, was among those at Atlanta’s City Hall for a May Day rally. Mello is a so-called Dreamer who received protection under the Deferred Action for Childhood Arrivals program.\nNot long after Mello , arrived for the rally, she texted her mom a photo of herself huddling under a pink umbrella and holding a sign saying, “We are Humans.”\nMany demonstrators said they were concerned about Trump administration attempts at immigration initiatives such as building a wall along the Mexico-U.S. border, enforcing a so-called travel ban on people from several Muslim-majority countries and threatening to withhold federal funds from municipalities considered “sanctuary cities.”\nOutside City Hall, immigrant advocates linked up with a wide range of social justice groups fighting to raise the minimum wage, combat racism and sexism, and protect LGBTQ communities.\n‘’We want Atlanta to be a real sanctuary city, not just a welcoming city,” Carlos Medina, a volunteer with the Georgia Latino Alliance for Human Rights, told the crowd. “We want a fair salary: $15. We want the people to respect gender identity. And we want them to stop the deportations.”\nAfter the rally, more than a hundred immigration and social justice advocates spilled into Atlanta’s City Council chamber to demand that the city raise the minimum wage to $15 an hour and that the city comply with Immigration and Customs Enforcement requests to detain immigrants only when officials have a warrant.\nImmigrant rights groups and labor unions organized multiple rallies across New York City, culminating Monday evening at Foley Square in what organizers said would be the city’s biggest planned rally for May Day.\nMichael Bellamy was among those demonstrating in Union Square on Monday afternoon.\n“We are showing how U.S. policies throughout history have created refugees and hurt people, and we want to celebrate those who work,” he said.\nEarlier Monday, about 500 people rallied outside Wells Fargo and JPMorgan Chase & Co. in Manhattan. Twelve people were arrested for civil disobedience, said Jose Lopez of the immigrant advocacy group Make the Road, after protesters blocked the entrance to JPMorgan for about 10 minutes.\n“We wanted to identify and name a number of corporate players who stand to profit from Trump’s agenda and immigration detention,” Lopez said. “On Monday, we hit the streets and went after the first corporate target on the list.”\nIn Chicago, Jorge Mujica, an organizer at Arise Chicago, said hundreds of people had gathered a few hours early in anticipation of the march from Union Park to Daley Plaza.\nThis year’s May Day, he said, felt different from previous years.\n“Before we were not successful in pulling in other communities to join us,” Mujica said. “But Trump has united us.”\nnigel.duara@latimes.com\nFollow Nigel Duara on Twitter: @nigelduara\nUPDATES:\n6:49 p.m.: This article was updated with reports of violence in Portland.\n2:35 p.m.: This article was updated with more comments from May Day participants.\nThis article was originally published at 12:20 p.m.",
    "label": 3
}