{
    "index": 437,
    "text": "These House Republicans were key to the health care bill\nShow Caption Hide Caption Obamacare repeal passes in U.S. House: 217 yea, 213 nay House Republicans have passed legislation to repeal and replace the Affordable Care Act. USA TODAY\nWASHINGTON — Nearly two dozen House Republicans who had opposed an earlier version of the American Health Care Act switched their position and voted for the revised legislation, assuring the bill's passage Thursday.\nThose converts allowed the bill, which was pulled from the House floor March 24 because Republican leaders realized they lacked the votes for passage, to squeak by on a 217-213 vote.\nAmong those who overcame earlier concerns and voted for the legislation are several Republicans thought to be vulnerable in the 2018 congressional elections, including Rep. Darrell Issa of California.\nIssa, one of the wealthiest members of Congress and former chairman of the House Oversight and Government Reform Committee, barely won re-election in 2016.\n“Today, we made good on our promise to repeal and replace Obamacare,” Issa said in a statement released after the vote. “Let's stop pretending Obamacare is going to fix itself or that somehow, someday, it’s going to get better.”\nEarlier, Issa had said he was \"not prepared\" to vote for the original version of the Republican's health care bill.\nHe didn’t cite specific aspects of the bill he objected to but rather said he thought Republicans could do better.\nJust two days ago, Issa provided a terse response when confronted by reporters who asked him what his position was on the new version of the bill.\n“None of your business,” Issa replied.\nRead more:\nAnother potentially vulnerable Republican who switched from no to yes is Rep. Rodney Frelinghuysen of New Jersey, chairman of the House Appropriations Committee, who termed the earlier version of the bill \"unacceptable.\"\nFrelinghuysen said in a statement after Tuesday’s vote that “doing nothing is not an option.”\n“Today, I want to reassure New Jersey families that this legislation protects those with pre-existing conditions and restores essential health benefits,” he said.\nOpponents, including Republicans who voted against the bill, pointed out that the legislation allows states to opt out of the requirement that insurance policies cover minimum \"essential\" benefits. Insurance companies also would be allowed to charge people with pre-existing conditions more under the revised bill. But Republicans added $8 billion to the bill to help people with pre-existing conditions afford higher premiums.\nHere are the Republicans who opposed the original American Health Care Act, but voted for the revised version on Thursday:\nRep. Justin Amash of Michigan\nRep. Mark Amodei of Nevada\nRep. Rod Blum of Iowa\nRep. Dave Brat of Virginia\nRep. Mo Brooks of Alabama\nRep. Ted Budd of North Carolina\nRep. Rick Crawford of Arkansas\nRep. Warren Davidson of Ohio\nRep. Scott DesJarlais of Tennessee\nRep. Rodney Frelinghuysen of New Jersey\nRep. Tom Garrett of Virginia\nRep. Louie Gohmert of Texas\nRep. Paul Gosar of Arizona\nRep. Andy Harris of Maryland\nRep. Jody Hice of Georgia\nRep. Darrell Issa of California\nRep. Jim Jordan of Ohio\nRep. Raúl Labrador of Idaho\nRep. Mark Meadows of North Carolina\nRep. Scott Perry of Pennsylvania\nRep. Bill Posey of Florida\nRep. Mark Sanford of South Carolina\nRep. Glenn Thompson of Pennsylvania\nRep. Rob Wittman of Virginia\nRep. David Young, of Iowa\nThese are 20 Republicans who voted against the American Health Care Act:\nAndy Biggs of Arizona\nMike Coffman of Colorado\nBarbara Comstock of Virginia\nRyan Costello of Pennsylvania\nCharlie Dent of Pennsylvania\nDan Donovan of New York\nBrian Fitzpatrick of Pennsylvania\nJaime Herrera Beutler of Washington\nWill Hurd of Texas\nWalter Jones of North Carolina\nDavid Joyce of Ohio\nJohn Katko of New York\nLeonard Lance of New Jersey\nFrank LoBiondo of New Jersey\nThomas Massie of Kentucky\nPatrick Meehan of Pennsylvania\nDave Reichert of Washington\nIleana Ros-Lehtinen of Florida\nChristopher Smith of New Jersey\nMichael Turner of Ohio",
    "label": 3
}