{
    "index": 138,
    "text": "In the new version of the American Health Care Act (AHCA), the Republican bill to replace the Obama-era Affordable Care Act (ACA), one of the major points dividing the GOP conference was the treatment of pre-existing conditions.\nWhat does the current law say?\nThe guarantee of health care coverage to people with pre-existing conditions has been one of the ACA's most popular features. Under the law, insurance companies cannot refuse to cover those with pre-existing conditions, that is, health issues that pre-date a new health insurance coverage. Insurers also can't charge more or refuse to pay for Obamacare \"essential benefits\" for any pre-existing condition. And, once enrolled in a plan, insurers can't deny such patients coverage or raise rates based solely on their health.\nWhat about the new plan, the American Health Care Act?\nThe new GOP plan requires insurers to cover pre-existing conditions, and for those with continuous health care coverage, nothing will change. There are some caveats, though.\nInsurers would be able to charge more to people with gaps in their insurance coverage. And a recent change, the MacArthur amendment, would allow states to waive some of the Obamacare requirements, including one that's relevant to pre-existing conditions. States that are granted such a waiver would allow insurers to set premiums based on health status -- current health, health history and other risk factors -- or in other words, pre-existing conditions.\nThese states would also be able to set up high-risk pools to help reimburse the cost for insurers covering these consumers. The AHCA would provide funding for this purpose, though critics suggest it may not be enough.\nWhat are pre-existing conditions?\nStates are likely to leave it to insurers to define pre-existing conditions, but prior to the ACA, pregnancy fell into that category, as well as mental disorders, and alcohol or drug abuse. The Kaiser Family Foundation compiled a list of what insurers called \"declinable medical conditions\" and risk factors that, prior to the ACA, could mean denial of coverage or higher premiums. Here are some of the conditions identified by individual market insurers in most states:\nAlzheimers or dementia\nAlcohol or drug abuse\nArthritis, fibromyalgia, or other inflammatory joint disease\nCancer within a period of time (the example cited by KFF is 10 years, \"often other than basal skin cancer\")\nCerebral palsy\nCongestive heart failure\nDiabetes mellitus\nEmphysema\nEpilepsy\nHeart disease\nHepatitis\nKidney disease\nMental disorders - bipolar, or eating disorders, e.g.\nMultiple Sclerosis\nMuscular dystrophy\nObesity (severe)\nOrgan transplant\nParaplegia\nParalysis\nParkinson's disease\nPending surgery or hospitalization\nPneumocystic pneumonia\nPregnancy or expectant parent\nSleep apnea\nStroke\nTranssexualism\nJennifer Tolbert, who is the Director of State Health Reform at the Kaiser Family Foundation, has read the AHCA and says at this point, it's not entirely clear how consumers with these conditions will be affected.\nShe said that in the past, individuals with pre-existing conditions in high-risk pools typically paid more than the average premium, \"maybe 1.5 times as much,\" she said. But Tolbert also pointed out other problems, such as that pre-ACA, consumers faced waiting lists to get into high-risk pools or higher deductibles or insurance that didn't cover the medical problems stemming from the pre-existing condition.\nShe also pointed to another factor to consider, related to insurance coverage for people with pre-existing conditions: the AHCA would change the structure of the premium tax credits in the marketplaces, so older Americans, who are likely to be sicker, will probably see their tax credits go down.\nThis, combined with the rise in age rating (allowing seniors to be charged up to five times as much for coverage as younger Americans, rather than three times as much under the ACA) and the phase-out of the Medicaid expansion, is likely to result in more Americans losing their insurance coverage, according to Tolbert.",
    "label": 3
}