{
    "index": 346,
    "text": "When it comes to foreign policy, what is on Donald Trump’s mind? It’s not the easiest thing to decipher, especially if one tries to take his words seriously. More often than not, those words are a source of confusion.\nDuring the campaign, Trump said he was going to get tough with the Chinese, punish them for currency manipulation and force them to accept tough trade deals. However, after meeting with Chinese President Xi Jinping and deciding Xi was a great guy, Trump dropped talk of punitive measures and now says he will settle for a less-than-great trade deal if China helps curb North Korea’s nuclear ambitions.\nAlso during the campaign, Trump guaranteed it would be “easy” to beat ISIS, build a wall on the Mexican border and get rid of bad trade deals, such as NAFTA. None of those things have proved at all easy to accomplish, yet that has not deterred him from talking about the ease of fixing other problems. During a meeting this week with Palestinian Authority President Mahmoud Abbas, Trump said getting a peace deal between Israelis and Palestinians is “maybe not as difficult as people have thought over the years.”\n1 / 51 la-1491523602-y7ephyarj1-snap-image (David Horsey / Los Angeles Times) 2 / 51 la-1491368625-0bgh58ihw8-snap-image (David Horsey / Los Angeles Times) 3 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 4 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 5 / 51 Top of the Ticket cartoon (David Horsey / Los angeles Times) 6 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 7 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 8 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 9 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 10 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 11 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 12 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 13 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 14 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 15 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 16 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 17 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 18 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 19 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 20 / 51 Trump inspires millions to take to the streets -- to oppose him. (David Horsey / Los Angeles Times) 21 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 22 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 23 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 24 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 25 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 26 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 27 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 28 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 29 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 30 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 31 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 32 / 51 Cartoon caption contest winner at the DENT conference in Sun Valley, Idaho: Jon Duval, executive director of the Ketchum Community Development Corporation. (David Horsey / Los Angeles Times) 33 / 51 Old radicals and big media descend on Selma (David Horsey / Los Angeles Times) 34 / 51 Horsey imagined the creation of the Ann Coulter phenomenon in this cartoon from 2007. (David Horsey / Los Angeles Times) 35 / 51 This David Horsey drawing is a reconfiguration of a cartoon he first published in 2006. (David Horsey / Los Angeles Times) 36 / 51 Donald Sterling, owner of the L.A. Clippers, should give Cliven Bundy a call. After Sterling loses his NBA franchise and the deadbeat Nevada rancher loses his cattle, the two old racists will both need a buddy. Maybe they can team up together and open an all-white rodeo. (David Horsey / Los Angeles Times) 37 / 51 Besides sending a chill up the spine of the international community, Vladimir Putin has accomplished one other thing by seizing Crimea and threatening the rest of Ukraine: Putin has brought back the bear. (David Horsey / Los Angeles Times) 38 / 51 The right-wing insurrection at the Bundy ranch in Bunkerville, Nev., has taken another weird turn with new revelations about the family history of Cliven Bundy. (David Horsey / Los Angeles Times) 39 / 51 See full story» (David Horsey / Los Angeles Times) 40 / 51 See full story» (David Horsey / Los Angeles Times) 41 / 51 See full story» (David Horsey / Los Angeles Times) 42 / 51 See full story» (David Horsey / Los Angeles Times) 43 / 51 See full story» (David Horsey / Los Angeles Times) 44 / 51 See full story» (David Horsey / Los Angeles Times) 45 / 51 David Horsey / Los Angeles Times (David Horsey / Los Angeles Times) 46 / 51 See full story» (David Horsey / Los Angeles Times) 47 / 51 See full story» (David Horsey / Los Angeles Times) 48 / 51 See full story» (David Horsey / Los Angeles Times) 49 / 51 See full story» (David Horsey / Los Angeles Times) 50 / 51 See full story» (David Horsey / Los Angeles Times) 51 / 51 See full story» (David Horsey / Los Angeles Times)\nReally? Does he honestly believe his son-in-law, Jared Kushner — to whom he has entrusted the task of resolving the intractable conflict — is a miracle worker? Does Trump think Ivanka’s hubby is vastly more skilled and brilliant than all the seasoned diplomats and presidents who have come before? Or are his words disconnected from any actual belief or grasp of thorny details?\nAdvertisement\nThat disconnection shows in statements he has made about Russia. He has repeatedly refused to speak an unkind word about Russian tyrant Vladimir Putin and, as recently as this week, discounted the unanimous conclusion of American intelligence agencies that Russia interfered in the 2016 presidential election. (The subversion of American democracy could have been perpetrated by his new buddies in China, he hypothesized, basing his assertion on nothing more than his own odd notions about computer hacking.) Nevertheless, he has also said relations between the United States and Russia have never been worse than they are right now. Apparently, he has forgotten the entire history of the Cold War.\nIn another corner of the globe, Trump has raised alarm by saying that “a major, major conflict with North Korea” is a looming possibility. Talking tough, he announced a U.S. Navy “armada” was heading toward the Korean peninsula (at a time when, in fact, it was cruising the other way). Despite this, Trump now says, under the right circumstances, he would be “honored” to meet with North Korea’s homicidal dictator, Kim Jong Un.\nApparently, Trump has a high tolerance for homicidal dictators, and not just Kim and Putin. On Saturday, he phoned bloody-handed Philippine President Rodrigo Duterte to let him know he is welcome to visit the White House. When criticized for sucking up to a major human rights violator, Trump defended his call by saying Duterte is a very popular with his people (so, of course, was Hitler). Trump also recently put in a call to Turkish President Recep Tayyip Erdogan to congratulate him for winning a referendum that put another nail in the coffin of Turkey’s secular democracy. And he heaped praise on Egyptian despot Abdel Fattah Sisi when he hosted him at the White House.\nTrump has a habit of speaking about autocrats with gushing admiration, praising their strength, leadership and high poll numbers. Does this mean he has abandoned America’s long-standing mission to promote human rights in the world? Does it suggest he wishes he could override judges, ignore Congress and shut down newspapers and television stations himself? Or is it simply a pattern of speech, sort of like the host at a charity golf tournament who spouts empty praise for every donor in the clubhouse, even if they are crooks and hypocrites?\nDoes it make a difference that he has done business in many of these countries and that his two sons are still busy drumming up international deals for the Trump family enterprise? There are Trump buildings in Manila and Istanbul. There are Trump products made in China. There is a record of Trump projects attempted in Moscow. Maybe he envisions a Trump tower in Pyongyang one day.\nWho knows what Trump’s motivations may be? It is a mystery to the world because, in international affairs, the Trump Doctrine is as ephemeral as his latest tweet.\nDavid.Horsey@latimes.com\nFollow me at @davidhorsey on Twitter",
    "label": 3
}