{
    "index": 217,
    "text": "Washington (CNN) In a major victory for President Donald Trump, the House has voted to dismantle the pillars of the Affordable Care Act and make sweeping changes to the nation's health care system.\nThe bill now heads to the Senate where it faces daunting challenges because of the same ideological splits between conservative and moderate Republicans that nearly killed it in the House.\nTrump said he is confident the bill will pass the Senate, calling Obamacare \"essentially dead.\"\n\"This is a great plan. I actually think it will get even better. This is a repeal and replace of Obamacare. Make no mistake about it,\" Trump said at a celebratory White House appearance with House Republicans.\nAfter a dramatic week of negotiations, lobbying from Trump and Republican leaders, the vote ended with 217 GOP lawmakers backing the measure. Twenty Republicans opposed it, as did all House Democrats.\nTrump argued the health care process has unified the GOP. \"We've developed a bond,\" he said. \"This has really brought the Republican Party together.\"\n\"As far as I'm concerned, your premiums are going to come down,\" Trump said.\nDemocrats were unable to stop the GOP vote aimed at President Barack Obama's signature legislative achievement. But after the final vote was cast, they chanted \"nah nah nah nah hey hey hey goodbye\" to their Republican colleagues, with a few members waving, as they believe the vote will lead to many GOP lawmakers losing their seats in the November 2018 midterms.\nThursday marks a political milestone -- one that has painfully eluded Trump and House leaders for months. The controversial health care bill delivered Trump the biggest political defeat of his short presidency in March, when the legislation had to be yanked from the House floor because it simply didn't have enough support.\nUnder pressure from an antsy Trump looking to score a big political victory, Republican leaders tried again last week, hoping to to get to 216 votes ahead of the President's symbolically important 100-day mark in office. That effort, too, failed.\nBefore the vote on the House floor, House Speaker Paul Ryan made the case that Republicans had no choice but to work to put Obamacare -- what he called a \"failing law\" -- behind them. \"Let's give people more choices and more control over their care.\"\n\"Let's return power from Washington to the states,\" Ryan said.\n\"A lot of us have been waiting seven years to cast this vote.\" Ryan said. Many lawmakers, he added are \"here because they promised to cast this vote.\"\n'Rocky' plays in GOP meeting\nThursday morning, Republicans were already in a celebratory mode. The theme song to \"Rocky\" played as members filed in to a meeting in the House basement.\nRep. Daniel Webster described Ryan as almost \"giddy.\"\nAsked if he will be relieved when all of this is over, Virginia Rep. Dave Brat said simply: \"Highly!\"\nWhen it came time for House Majority Leader Kevin McCarthy to speak in the meeting, an image of Gen. George S. Patton popped up on the LCD screens in the room. McCarthy proceeded to roll off several motivational quotes from Patton to urge the conference along.\nThere was also high praise for Trump: New York Rep. Chris Collins credited the President for getting the bill across the finish line. \"This was Donald J. Trump, the negotiator getting it done,\" Collins said.\nBefore the final vote, the House unanimously passed a separate bill that will ensure members of Congress and their staffs are subject to the rules of their new health care measure. Originally, Republicans were under fire after it was reported that they wouldn't be subject to the rules of their own bill. Republicans said that they were required to include the exemption under Senate rules.\nDemocrats ready for 2018 fight\nDemocrats, for their part, are poised to hold the health care bill over the heads of Republicans next year.\nAs anxious reporters stood outside of Ryan's office Wednesday night, waiting for guidance on whether there would be a vote Thursday morning, Democratic Rep. Elijah Cummings approached the group to joke that he had a \"breaking\" announcement.\nRepublicans had the votes on their health care bill, Cummings said. His punchline: And Democrats will take back the House in 2018.\nAs originally introduced, the GOP bill would leave 24 million fewer people insured by 2026 than under Obamacare, the non-partisan Congressional Budget Office said. There will not be a new CBO report before Thursday's vote on the legislation.\nHouse Minority Leader Nancy Pelosi blasted the bill and timing of the vote.\n\"Do you believe in what is in this bill?\" she said Thursday. \"Some of you have said ... well, they'll fix it in the Senate. But you have every provision of this bill tattoos on your forehead you will glow in the dark on this one.\"\nThe remark was met with cheers and applause.\n\"You will glow in the dark,\" she repeated. \"So don't walk the plank.\"\nBut the weight of the moment -- Republicans being able to start the process of replacing Obamacare -- was not lost on Democrats.\nOff of the House floor, Democratic Rep. Emanuel Cleaver raised his left pant leg to show a CNN reporter huge scars he has on his knee. He said he has had six surgeries, two to replace his knee.\n\"I'm thinking about the people back home who are hurting. I'm talking about myself. I mean, I'm a pre-existing condition,\" he said. \"It's not apolitical game for all these people out here in the country who are hurting and scared to death.\"\nCleaver said when Obamacare was enacted in 2010, he never could have imagined that this day would come.\n\"I thought that even though this place has become toxic, that nobody would jeopardize the health of millions of people for some political purpose,\" he said. \"And the number is still 24 million people who will be without health coverage.\"\nWhat's in the bill?\nThe GOP health care bill would eliminate Obamacare taxes on the wealthy, insurers and others, and get rid of the individual mandate imposed by Obamacare, officially known as the Affordable Care Act. Instead of the Obamacare subsidies that are tied to income and premiums, the GOP plan would provide Americans with refundable tax credits based mainly on age to purchase health insurance.\nThe legislation would also allow insurers to charge higher premiums to those in their 50s and early 60s, compared to younger consumers.\nIt would also significantly curtail federal support for Medicaid and allow states to require able-bodied adults to work. After 2020, states that expanded Medicaid would no longer receive enhanced federal funding to cover low-income adults, and those that hadn't expanded would be immediately barred from doing so.\nAnd it would allow states to relax some key Obamacare protections of those with pre-existing conditions, which are among the health reform law's most popular provisions. States could apply for waivers to allow insurers to offer skimpier policies that don't cover the 10 essential health benefits mandated by Obamacare. Also, insurers would be able to charge higher premiums to those with medical issues if they let their coverage lapse. States requesting waivers would have to set up programs -- such as high-risk pools -- to protect insurers from high-cost patients.\nAn eleventh-hour amendment that helped seal the missing GOP votes would add $8 billion over five years to fund high-risk pools and go toward patients with pre-existing conditions in states that seek waivers under the Republican legislation. The legislation already included $130 billion in the fund.\nHowever, the GOP bill doesn't touch one beloved piece of Obamacare -- letting children stay on their parents' insurance plans until the age of 26.",
    "label": 3
}