{
    "index": 331,
    "text": "When Jimmy Kimmel’s son, Billy, was born on April 21, the late-night talk show host’s elation was quickly overtaken by utter distress.\nWithin hours of Billy’s birth, a nurse heard a murmur in the newborn’s heart and noticed he was “a bit purple.”\nIn the opening monologue on “Jimmy Kimmel Live!” Monday night, the host tearfully shared the diagnosis: genetic condition known as Tetralogy of Fallot with pulmonary atresia. In layman’s terms that meant that baby Billy had a hole in the wall of his heart and the pulmonary artery was completely blocked.\nBilly became one of the millions of Americans with a preexisting condition. It’s a group who may have to pay more for health insurance under the proposed Republican alternative to the Affordable Care Act, a topic Kimmel chose to speak bluntly about during his ABC show.\nAfter an open-heart surgery that was “the longest three hours of my life,” Kimmel’s son had one of the heart defects fixed. He will need another surgery in three to six months and another one in his early teens. For now, he’s at home recovering with his family.\nAdvertisement\nAfter thanking the team at Children’s Hospital Los Angeles for saving his son’s life and joking that he was “definitely getting a vasectomy after this,” Kimmel turned to politics.\nHe brought up President Trump’s proposal to cut nearly $6 billion from the National Institutes of Health, and he thanked lawmakers for instead boosting funding by another $2 billion in the final version of the budget.\n“More than 40% of the people who would have been affected by those cuts to the National Institutes of Health are children,” he said, including patients at the hospital where his son had surgery.\n“We were brought up to believe that we live in the greatest country in the world,” he continued. “But until a few years ago millions and millions of us had no access to health insurance at all. You know, before 2014, if you were born with congenital heart disease, like my son was, there was a good chance you’d never be able to get health insurance because you had a preexisting condition.”\nTetralogy of Fallot occurs in approximately one of out every 2,500 births in the United States — that means about 1,660 babies each year are born with that specific preexisting condition.\nAt least some of the political rhetoric about preexisting conditions has focused more on individuals whose health woes can be tied to lifestyle choices.\nEarlier this week, Rep. Mo Brooks (R-Ala.) did an interview on CNN in which he said charging people with preexisting conditions more for insurance cuts costs for “people who live good lives.”\n“They’re healthy, they’ve done the things to keep their bodies healthy,” Brooks said, referring to people without preexisting conditions. “Right now those are the people who’ve done things the right way, that are seeing their costs skyrocketing.”\nBrooks did go on to say that he would make an exception for those people whose preexisting conditions were due to no fault of their own: “I think our society under those circumstances needs to help,” he said.\nThe GOP alternative to Obamacare currently has no provision differentiating the type of preexisting condition someone has (i.e. baby born with a medical condition versus lifelong smoker with emphysema).\nTrump has repeatedly promised that his Obamacare replacement will protect people with preexisting conditions — a population that includes as many as one in four Americans.\nIn its current incarnation, the GOP’s healthcare proposal would allow insurers to either charge people with preexisting conditions more, or not cover them at all if the state has a high-risk pool in place. (Columnist Michael Hiltzik has laid out some of the issues with high-risk pools, including examples of them not working when they’ve been tried in the past.)\nUnder Obamacare, insurers have to cover people with preexisting conditions and cannot charge them more because of it.\nKimmel, near the close of his monologue, called politicians bickering over healthcare “partisan nonsense” and urged people to reach out to their lawmakers.\n“If your baby is going to die and it doesn’t have to, it shouldn’t matter how much money you make. I think that’s something that, whether you’re a Republican or a Democrat or something else, we all agree on that, right?” Kimmel asked the audience. “No parent should ever have to decide if they can afford to save their child’s life. It just shouldn’t happen. Not here.”\n@jessica_roy\njessica.roy@latimes.com\nALSO:\nA side-by-side comparison of Obamacare and the GOP’s replacement plan\nClinton blames the FBI, Russia, Wikileaks and also herself for 2016 loss",
    "label": 3
}