{
    "index": 309,
    "text": "The Trump administration’s online database of immigrants in detention was supposed to help the public search for potential criminals. But when it launched Wednesday, an immigration attorney noticed something unusual: babies.\nTurns out, the system mistakenly included children in immigration custody, some as young as a few months.\nA 3-year-old boy from El Salvador detained in Texas and a 4-year-old Guatemalan girl in Phoenix were among scores of children listed in the public system.\nThe database also included unaccompanied minors — children who came to the United States without their parents — who are currently held in group homes.\nDepartment of Homeland Security officials said the release of children’s names was a lapse in policy that arose because a filter was not applied to the data made available on the website.\nAdvertisement\n“The Department of Homeland Security’s policy is and remains to protect the information of minors in our custody,” said Gillian M. Christensen, a spokeswoman for the agency.\nBy late Wednesday evening, the department had fixed the problem. But concerns remained about the amount of private information still easily available to the public, including potential asylum applicants whose identities are supposed to be confidential under DHS policy.\nThe searchable database is the latest effort by the Trump administration to spotlight crimes committed by immigrants who are in the country illegally. It was launched under a high-profile rollout of the Victims of Immigration Crime Engagement Office, or VOICE, that is intended to help what administration officials have described as forgotten victims.\nThe web site, known as DHS-VINE , is supposed to list everyone currently in federal immigration custody. It allows users to search with as few as three letters of a last name and a first initial, along with country of birth or date of birth. A search by the Los Angeles Times under “A” for first name, “Mar” for last name and Guatemala as country of origin pulled up 50 matches.\nThe matches reveal the detention facility the immigrant is housed in, custody status, age, country of birth, date of birth, race, gender and aliases. There doesn’t appear to be any way to distinguish between someone who may have perpetrated a crime beyond being in the country illegally.\nAttorneys representing immigrants expressed anger and worry over the release of names that were supposed to be protected.\nBryan Johnson, the Long Island, N.Y., lawyer who first noticed the error, called the release “reckless incompetence on the part of the Trump administration.”\n“In their haste to pretend like they care about victims of immigrant crimes, the Trump administration released personally identifiable information regarding vulnerable children at risk of human trafficking and other crimes,” said Johnson, who defends children brought into the United States from abroad, many escaping violence.\nMatthew Kolken, an immigration attorney in New York, said he was shocked that a quick search of the database brought up one of his clients — a 26-year-old asylum applicant from Lebanon who has been detained by immigration officials for two years.\nThe man had overstayed his visa and sought asylum because he is a pro-democracy leader in a youth movement back home and being persecuted by Hezbollah, Kolken said.\n“If a terrorist organization is looking for him they may simply enter his name into a database and know exactly where he is,” Kolken said. “It puts his entire family back home in jeopardy.”\nThe names of asylum seekers are also kept secret to protect them from retaliation in the event that asylum is denied and they are sent back home.\n“The United States needs to be taking its obligations seriously to keep vulnerable asylum seekers’ identities confidential,” Kolken said.\nA DHS spokesperson said the database does not violate privacy policies because it doesn’t identify anybody as an asylum applicant.\nCritics of the Trump administration said that Homeland Security Secretary John F. Kelly’s announcement of the database was more about politics than public safety, and that it was timed to add luster to President Trump’s uneven record before his administration hits the 100-day mark on Saturday.\nDHS spokesman David Lapan rejected that claim.\n“This effort has been underway for some time and was announced [Wednesday] after we were able to establish the mission, procedures and people assigned to duties associated with the VOICE office, irrespective of the 100-day marker,” Lapan said.\nAdvocates for immigrants said the administration is trying to demonize immigrants as criminals and whip up public support for aggressive new deportation operations and billions of dollars in additional spending for border security.\nThis isn’t the first time the Trump administration has erred in releasing information aimed at cracking down on illegal immigration.\nUnder Trump, Immigration and Customs Enforcement began publishing reports on the cities and other jurisdictions that were releasing immigrants from jail or after arrest, flouting requests to hold certain immigrants for transfer to federal detention.\nBut the first few reports were plagued by errors. In some cases, ICE mixed up names, confusing Franklin counties in Iowa, New York and Pennsylvania. In other cases, the detainees had already been picked up by ICE, or had never been released in the first place.\nEarlier this month, ICE suspended publication of the reports.\ncindy.carcamo@latimes.com\nTwitter: @thecindycarcamo\nLos Angeles Times staff writer Joseph Tanfani contributed to this report.\nALSO:\nEconomic reality and contradictions beset Trump’s tax plan\nTrump says U.S. will not withdraw from NAFTA\nU.S. judge blocks Trump order threatening funds for ‘sanctuary’ cities\nUPDATES:\nApril 27, 4:47 p.m.: This article has been updated with a comment from DHS on privacy policies concerning asylum seekers.\nApril 27, 3:30 p.m.: This article has been updated with information about asylum seekers and background about the database.\nApril 27, 12:20 p.m.: This article was updated with comments from the Department of Homeland Security and with background on problems with Immigration and Customs Enforcement reports on jurisdictions that don’t cooperate with immigration authorities.\nThis article was originally published April 26 at 10: 40 p.m.",
    "label": 3
}