{
    "index": 199,
    "text": "(CNN) It's been 11 weeks since Gen. Michael Flynn was ousted as national security adviser. He lied to Vice President Mike Pence about his conversations with the Russians, lobbied on behalf of Turkey while an adviser to the Trump campaign, and is now seeking congressional immunity in exchange for his testimony about Russia and the election.\nNot a great scenario for a new administration. But it's one that could have been avoided had the new team actually done its homework about the man they nominated. Only they didn't.\nConsider this scenario, retold by multiple sources with knowledge: When Donald Trump's initial transition team met for the first (and last) time two days after the November election victory with its executive committee -- which included Trump family members -- the group was visited by two people who were not expected to be at the session: Gen. Michael Flynn and Gen. Keith Kellogg. Apparently invited by Jared Kushner, the men were asked by both Kushner and Ivanka Trump to talk about the positions they would want in the new administration.\nKellogg wanted to be White House chief of staff, which was apparently a non-starter. And Flynn told the group there were only three positions he would accept: national security adviser, secretary of state, or secretary of defense.\nThe trouble is, he was not on the transition team's list for any of those jobs.\nBut he was on the family's list.\nThe rest is history: The next day, transition chairman Chris Christie was ousted, his voluminous plans scrapped, and the rest of his team was gone shortly thereafter. And Flynn became the first big Trump appointment, named national security adviser within 10 days of Trump's election -- only to be gone just over three weeks into the Trump presidency.\nThe rise and fall of Flynn\nThe story of Flynn's rise and fall -- from loyal Trump adviser and campaign rabble-rouser to a very short-term top job in national security -- is the story of an insular family takeover of a transition process the President himself never wanted. (In fact, one source says that Trump wanted to close it down, thought it was bad karma, but was told that transition preparations are actually in the candidate's best interest.)\nAccording to multiple sources familiar with discussions inside the first transition team, Flynn was viewed suspiciously. He was considered a \"wild card\" -- someone who made officials uncomfortable. But because he had been so loyal to Trump they reluctantly put him on their list as the director of national intelligence.\nAfter the election -- and the Christie ouster -- the transition was outsourced in name to Pence, who led a largely inexperienced team, including Trump's family -- especially his daughter and son-in-law. What's more, this new transition was hobbled by inadequate vetting and preparation, falling woefully behind in nominations. And Flynn's appointment as national security adviser was an easily avoidable mistake, say initial transition officials, but apparently no one was interested in listening to advice about extreme vetting.\nFlynn was announced as national security adviser with the clear backing of the Trump family. But Flynn did not have something just as important: a complete, new, deeper internal vet of his associations and potential conflicts.\nThe new transition team had prepared \"public source\" vetting on potential nominees -- which means anything available on the public record -- but had not gone beyond that. And the ousted transition team had specifically warned the new administration not to nominate anyone officially until more robust investigations could be complete.\nBut it didn't happen that way.\nSo Flynn was nominated, says one source with knowledge, \"without anything deeper than a public vet.\" Another source familiar with the transition added that Flynn \"certainly wouldn't have passed my vetting to be anything with a security clearance.\" The lack of homework created obvious problems.\nThe main questions are these: Why didn't the Trump administration know about either Flynn's business or his Russian contacts? Wouldn't a fuller vetting process have sent up red flares?\nThe explanation now from the Trump administration is that it's the Obama administration's fault. Flynn, they say, had the proper clearance because he was vetted by the Obama administration -- having served as their Defense Intelligence Agency director before he was fired from that position in 2014.\nDonald Trump explained it this way: \"When they say we didn't vet, well Obama I guess didn't vet, because he was approved at the highest level of security by the Obama administration.\" And Trump spokesman Sean Spicer said there was no need to \"rerun a background check\" on someone who had a high position in intelligence\" and \"did maintain a high level clearance.\" He said it's done every five years, and can be updated which, he said, \"occurred in this case.\" So case closed.\nMore elaborate vetting?\nExcept that intelligence officials have told CNN and others that any high-level job like national security adviser should require a separate, more extensive background check, even for those with current security clearance. And as Flynn's predecessor -- former national security adviser Susan Rice -- pointed out in an interview with Fareed Zakaria last week, those appointed to high positions normally receive \"a separate and much more elaborate\" check than a security clearance. \"It gets into the financial information. It gets into your relationships and contacts. It gets into your behavior.\"\nFollow CNN Opinion Join us on Twitter and Facebook\nDuring the campaign, Flynn was cleared, along with Christie, to accompany then-presidential nominee Trump to a briefing with intelligence officials. (\"Maybe that's the Obama vet they're talking about,\" speculated one source. \"But that's not the vet you should get if you are going to be national security adviser.\")\nIt was held at FBI headquarters in New York. One source with knowledge of the briefing says that \"Trump acquitted himself well,\" but that Flynn was \"an abomination with an ax to grind\" against the intelligence officials with whom he had formerly worked. Even Trump started having concerns about Flynn, this source says, but acknowledged his loyalty.\nIn the end, loyalty wasn't enough. \"Flynn was their responsibility,\" one transition source says. \"If they had truly vetted him before any announcement, none of this would have happened.\"\nClarification: The timeline of events regarding Flynn's lobbying has been updated.",
    "label": 3
}