{
    "index": 496,
    "text": "Trump administration missing mark on opioids, advocates say\nShow Caption Hide Caption Trump’s new opioids strategy not popular with health advocates President Donald Trump campaigned across the country promising to fix the opioid crisis, but public health advocates say his early moves are poised to make it far worse. USA TODAY\nWASHINGTON — As the opioid epidemic continues to escalate, the Trump administration has sent mixed messages and delivered few results in its handling of the epidemic so far, lawmakers and advocates say.\n“There’s some positive signs in terms of all the talk, but we haven’t really seen any action,” said Dr. Andrew Kolodny, an addiction physician and co-director of opioid policy research at Brandeis University.\nAs a candidate, Trump vowed to “dramatically expand access to treatment” and reduce the availability of heroin, oxycodone, and other opioids.\nBut even as Trump has kept the opioid epidemic in the spotlight — drawing much needed public attention to the problem — the White House and top Trump advisers have taken other steps that some fear could undermine efforts to combat addiction.\n“There have been a couple of warning signs that have concerned me,” said Sen. Claire McCaskill, D-Mo., the top Democrat on the Senate Homeland Security committee.\nTake these examples:\n•Trump’s budget office is considering a proposal to eliminate funding for two major anti-drug programs, raising alarm bells in Congress about the president’s commitment to put money behind the rhetoric;\n•The White House has yet to fill its “drug czar” position, after floating a controversial candidate for that post who has since withdrawn; and\n•Trump’s attorney general, Jeff Sessions, has endorsed hardline enforcement and interdiction policies, which some advocates say will undermine efforts to treat addiction as public health issue.\nRead more:\nThe last move came on Friday, when Sessions directed federal prosecutors to seek the toughest possible charges against suspected criminals. Critics say that could send low-level drug offenders to prison instead of treatment.\n“At the very moment we've reached a broad, bipartisan consensus and begun to reform our overly punitive policies at the state and federal level, President Trump is poised to turn back the clock,” Grant Smith, deputy director of national affairs at the Drug Policy Alliance, wrote in a recent op-ed. “It is difficult to overstate what a major historical misstep this would be, and how many lives could get chewed up and spit out by the new throwback approach.” The Drug Policy Alliance is a Washington-based group that advocates treatment over incarceration for drug offenders.\nIn an interview, Smith said the Trump administration has made all sorts of promises “to slow down the opioid epidemic and ramp up treatment but it’s actually been the opposite.”\nWhite House officials have defended the president’s record and said he remains committed to tackling the epidemic. \"When it comes to the opioid epidemic, the president has been extremely clear. This is a top priority for him,\" White House spokeswoman Sarah Sanders told reporters earlier this month.\nThe number of overdose deaths involving opioids has quadrupled since 1999, killing 91 Americans every day, according to the Centers for Disease Control and Prevention. The crisis has been exacerbated by a spike in the use of synthetic opioids, such as fentanyl, which are super potent and very deadly.\nNationally, more than 5,500 Americans died from overdoses involving illegally made synthetic opioids in 2014, a 79 percent increase from the previous year, according to data from the CDC.\nIn March, Trump created a bipartisan task force on opioids and tapped New Jersey Gov. Chris Christie to lead the effort. Christie, who has earned accolades for his work on addiction in New Jersey, said the task force would make recommendations to the president on interdiction, treatment and prevention.\n“Addiction is a disease, and we need to treat it that way,” Christie said in an interview with Fox News after his appointment. He promised to get “people the help that they need to renew their lives.”\nSen. Rob Portman, an Ohio Republican who has championed federal assistance to tackle the epidemic, said Christie will serve as a “smart” and “passionate” voice on the issue. But some say there's no need for a new group to study the opioid crisis, and Portman said the White House can’t wait for recommendations from its new panel to tackle the addiction crisis, which has hit Ohio particularly hard.\n“It’s overall good but they need to get it moving,” Portman said, adding that the task force should not “take away from the other things” the White House can act on now.\nPortman and others raised alarm bells earlier this month when news leaked that the White House was considering deep cuts to the Office of National Drug Control Policy. According to internal documents, the president's budget officials have proposed a 95 percent cut in the ONDCP budget, killing two major anti-drug programs and decimating its staff.\nThe White House has emphasized that no final budget decisions have been made, and lawmakers in Congress are pressing hard for a reversal on that plan.\nSuch a cut would run “counter to everything that President Trump had said in the campaign and also inconsistent with the severity of the problem right now,” Portman said in an interview last week.\nPortman has also pressed the White House to name a “drug czar” who will focus on the epidemic as a public health issue, focused on reducing demand for opioids through treatment and prevention. That is a high-profile position with a bully pulpit to shape drug policy and push for critical resources.\nThe White House was considering Rep. Tom Marino — a Republican from Pennsylvania and former prosecutor — for that post. But Marino withdrew from consideration, citing a family illness, after his hardline record on drug enforcement came under attack from the Drug Policy Alliance and other groups.\nA White House spokesman declined to comment on Monday about the status of the search for a drug czar candidate.\nPortman and others said even though they were concerned about some moves by the Trump administration, they were encouraged that the president himself was talking about the issue and drawing attention to it.\n“He continues to say some right things. That alone is important,” Portman said.",
    "label": 3
}