{
    "index": 352,
    "text": "The legislative fight over healthcare these past several weeks has offered House Republicans a choice of unattractive options.\nFailure to pass a bill would have meant that even with a huge majority in the House and control of the Senate and the White House, Republicans could not fulfill their most basic promise to the voters who elected them: the pledge to repeal Obamacare.\nSuccess meant forcing Republicans in vulnerable, swing districts to vote for a bill that is deeply unpopular, almost certainly putting some of their seats at risk, perhaps enough to lose the House majority in 2018.\nGood afternoon, I’m David Lauter, Washington bureau chief. Welcome to the Friday edition of our Essential Politics newsletter, in which we look at the events of the week in Washington and elsewhere in national politics and highlight some particularly insightful stories.\nAdvertisement\nHOW COSTLY A WIN?\nAs Democrats can testify from the bitter experience of 2010, passing a bill that many voters see as a threat to their healthcare can pave a quick road to defeat.\nAs Democrats can testify from an equally bitter loss in 1994, when Bill Clinton was president, failure to pass a promised bill on healthcare also can lead to defeat.\nSpeaker Paul Ryan and his advisors had been inclined to walk away from the healthcare battle after their initial defeat in March. As recently as this week, the bill appeared to be on the brink of failure, as Lisa Mascaro, Noam Levey and Sarah Wire wrote.\nBut, prodded by President Trump and his aides, who worried about their lack of legislative accomplishments, the House leaders returned to the field. On Thursday, they got their bill through, just barely, 217-213.\nWhat would the new bill actually do? Levey has written a detailed side-by-side comparison with current law. It’s part of our series of primers on key aspects of the debate that we call Obamacare 101.\nThe broad thrust of the bill is simple, however: It cuts hundreds of billions of dollars a year from federal spending on healthcare, which means millions of middle- and low-income Americans won’t be able to afford to go to the doctor.\nHouse Republicans say that if the federal government pulls back, states can pick up the slack. As Levey wrote, that approach has been tried before and has not worked, even in the biggest, wealthiest states.\nThe nonpartisan Congressional Budget Office estimated that the earlier version of the bill would have taken healthcare coverage away from 24 million people. This time around, the House leadership didn’t wait to hear from the budget office before taking a vote.\nIn exchange for the spending cuts, the bill eliminates $600 billion in taxes over the next 10 years. That gives several hundred thousand of the wealthiest Americans a very big tax cut. Republicans say they believe that will boost economic growth and make healthcare cheaper for those who are young and healthy. It may do both, but so far, that prospective trade-off is proving unacceptable to many voters.\nSince the election, when voters were evenly divided over whether they supported Obamacare, repeated polls by different organizations have shown a steady trend of growing support for the law as the GOP threatened to take it away.\nWHAT COMES NEXT?\nThe healthcare debate now moves to the Senate. GOP leaders there already have signaled that they will throw out most of what the House has done and start over. Votes aren’t expected in the Senate before June at the earliest.\nRepublicans have 52 votes in the Senate; they need 50 to pass the bill under the special procedures being used. That doesn’t leave much margin, and the division of opinions between centrist and conservative senators is wide. No one on either side expects any Democrats to vote for a bill that would repeal Obamacare.\nIf the Republican senators can reach agreement, their bill would have to go back to the House. At that point, Ryan likely will have the same problem of getting conservatives to sign on to a bill that doesn’t fully meet their demands.\nOdds are that the healthcare debate will continue to dominate Washington at least into the summer and perhaps the fall.\nIn the meantime, uncertainty about the future has encouraged several insurers to pull out of healthcare marketplaces. That’s left some places, including parts of Tennessee and Iowa, with few or no insurers for those who don’t get coverage through their jobs. That problem could get worse in coming months.\nAs Cathy Decker wrote Friday, that means healthcare almost certainly will be a defining issue for the 2018 midterm elections.\nThe healthcare debate could have particular impact in California, where half the Republican members of the delegation, 7 of 14, represent districts that Hillary Clinton carried in 2016. Every one of those potentially vulnerable Republicans voted for the healthcare bill, as Wire noted.\nReps. Darrell Issa (R-Vista) and Steve Knight (R-Palmdale already were on Democrats’ lists of top targets for 2018. The healthcare vote could encourage Democrats to mount serious challenges to two Republicans in the Central Valley, Reps. David Valadao of Hanford and Jeff Denham of Turlock, and some, or all, of Orange County’s Reps. Dana Rohrabacher, Mimi Walters and Ed Royce.\nIf Democrats do regain control of Congress and the White House — something that the pendulum swings of U.S. politics almost surely will bring about eventually — the experience of the last few years may push them to a more leftist position on healthcare.\nNow that Republicans have shown they will fight any health bill, even one like Obamacare that preserves the role of private insurance companies, why not just please liberals and go for a government-run system, some strategists argue.\nThere are powerful policy reasons why a single-payer system would be harder to create than many Democrats would like to think: It requires a big tax hike and disrupts health plans that lots of Americans are happy with. But, as Melanie Mason reported, a bill to set up a single-payer system in California cleared its first committee hurdle this week.\nDIVIDES OVER SPENDING\nThat 20 House Republicans voted against the healthcare bill illustrated the party’s divide on that issue. But on this week’s spending bill, 103 Republicans in the House deserted.\nThat wide split in the GOP gave House Democratic leader Nancy Pelosi considerable leverage in the negotiations. As a result, Trump got very few of his priorities in the bill, Mascaro wrote.\nOne especially endangered priority is Trump’s proposed wall along the southwestern border, as Noah Bierman and Brian Bennett wrote. The wall got no money in the spending bill, and skepticism in Congress, including from many Republicans, means it will continue to be problematic in September, when the current bill expires. The impression that the White House is softening on the need for a full wall has angered some of Trump’s ardent backers.\nThe Democrats’ crowing over their successes with the spending bill clearly hit a nerve with Trump, who sent out an angry tweet suggesting that maybe Republicans should try shutting down the government next time. Memoli looked at Trump’s reaction and its consequences.\nThe divisions among Republicans are one of several reasons why Congress so far seems on track to get very little done this year, Mascaro wrote.\nDEMOCRATS DEBATE HOW FAR TO PUSH\nRepublicans aren’t the only divided party, of course. Decker takes a look at the divides in Democratic ranks, comparing the town hall receptions that recently met Sens. Dianne Feinstein and Kamala Harris.\nEven Pelosi has a Democratic primary challenger who thinks she isn’t liberal enough. Sound outlandish? Well, this is San Francisco, Mark Barabak writes: Meet Stephen Jaffe.\nThe fervent Democratic opposition to Trump has made heroes of some longtime lawmakers on the party’s left. One of the most intriguing is Rep. Maxine Waters, the veteran South Los Angeles member of Congress. Sarah Wire looks at how she became “Auntie Maxine” to a generation of younger activists.\nDEREGULATION AT WORK\nAs Evan Halper wrote, the Senate approved legislation that aims to block a plan by California to set up 401(k) retirement accounts for those who don’t get such plans at work.\nIllinois, Connecticut and other Democratic states had been planning to follow California’s lead, and the Obama administration had issued a rule that cleared federal obstacles. Now, those obstacles will be back.\nThe bill is part of a push by Republicans to use a law known as the Congressional Review Act that allows them to wipe out rules that were adopted in President Obama’s final months in office. The deadline for using the review act is next week.\nTrump’s appointees, of course, don’t face a similar deadline, and they are working to undo other parts of Obama’s legacy. At the Federal Communications Commission, the prime target is rules to mandate so-called “net neutrality.” Jim Puzzanghera looks at the history of the net neutrality debate.\nTRUMP AND RELIGION\nTrump issued an executive order Thursday on religious liberty, but after a big buildup, the actual order disappointed some religious conservatives. The order did so little that the ACLU dropped plans to go to court against it. The order was nothing but “an elaborate photo-op with no discernible policy outcome,” the head of the ACLU said after seeing the text of what Trump signed.\nThat reaction fit a pattern of many of Trump’s executive actions — bold rhetoric followed by documents that don’t come close to achieving what the president claimed to be doing.\nTRUMP’S FOREIGN POLICY TAKES SHAPE\nThe president has been praising dictators a lot. It fits a strategy, Brian Bennett and Tracy Wilkinson wrote.\nHis U.N. ambassador, Nikki Haley, has taken a more traditional foreign policy line, criticizing Russia and stressing the U.S. commitment to human rights. That’s led to some conflicts with the White House, Wilkinson and Barbara Demick wrote.\nMeantime, the president has scheduled his first overseas trip. It will take him to Saudi Arabia and Israel, places where his penchant for off-the-cuff remarks could be risky, Wilkinson and Memoli wrote. In a meeting with Palestinian leader Mahmoud Abbas this week, Trump said that he thought negotiating a deal between Israel and the Arabs might be “not as difficult as people have thought.”\nAlso on the itinerary — Rome for a meeting with Pope Francis and Brussels for a NATO summit.\nNO REGRETS, FBI CHIEF SAYS\nFBI Director James Comey testified in the Senate that he was “mildly nauseous” at the idea that he might have affected the outcome of 2016 presidential contest, but that if he had to do everything over again, he would have acted the same way.\nALL THE PRESIDENT’S TWEETS\nTwitter has long been Trump’s favored means of pushing his message. We’re compiling all of Trump’s tweets. It’s a great resource. Take a look.\nLOGISTICS\nThat wraps up this week. My colleague Sarah Wire will be back Monday with the weekday edition of Essential Politics. Until then, keep track of all the developments in national politics and the Trump administration with our Essential Washington blog, at our Politics page and on Twitter @latimespolitics.\nSend your comments, suggestions and news tips to politics@latimes.com.\nIf you like this newsletter, tell your friends to sign up.\nDavid.lauter@latimes.com\n@davidlauter",
    "label": 3
}