{
    "index": 148,
    "text": "The campaign of leading French presidential candidate Emmanuel Macron says it is the victim of a \"massive and coordinated\" hacking attack.\nIn a statement late Friday night, Macron's En Marche! (Onwards!) Movement said emails and financial documents that were hacked a few weeks ago are now being circulated on social media. But, the campaign said, some of the documents online have been mixed with false documents. It's unclear who is behind the alleged attack at this time.\nThe campaign's announcement came moments before a law takes effect that bans candidates from campaigning in the hours before the election. Due to this law, which prohibites any commentary that could influence the election, Macron's team may be unable to respond to any additional developments leading up to Sunday's election.\nThe campaign said whoever is behind the leaked documents is trying to \"seed doubt and disinformation\" and destabilize Sunday's presidential runoff, comparing it to emails leaked from Hillary Clinton's U.S. presidential campaign.\nWikiLeaks released thousands of emails from members of former presidential candidate Hillary Clinton's campaign virtually every day leading up to the Nov. 8, 2016, election, giving consistent new negative material that may have damaged Clinton's chances against now-President Trump.\nIn the case of the French election, voters have very little time to digest any information from the hacking.\nAccording to a tweet by French polling firm Ifop-Fiducial Friday afternoon, Macron is leading with 63 percent of votes, compared with far-right candidate Marine Le Pen's 37 percent -- the largest lead for Macron reported in weeks.\nFormer President Obama endorsed Macron earlier this week.\n\"I know that you face many challenges and I want all of my friends in France to know how much I am rooting for your success, because of how important this election is, I also want you to know that I am supporting Emmanuel Macron to lead you forward,\" Obama said in a video he posted to Twitter Thursday.",
    "label": 2
}