{
    "index": 350,
    "text": "President Trump launched his second hundred days this week in the manner many of his voters expected from the start: as an aspiring deal-maker.\nHe signed off on a $1-trillion spending deal to keep the government open. He dived back into a legislative quagmire that had stymied him at first, healthcare. And he promised progress on the thorniest and most elusive of all deals: Mideast peace.\nBut at almost every turn, the president has seemed to struggle with the constraints governing puts on dealmaking — limitations that were absent in his business career. As the art of the deal adapts to the art of compromise, Trump is demonstrating that for him, flexibility outweighs adherence to a central philosophical vision.\nPresident Obama often spoke of the value of incremental gains on issues that would point the nation on a path toward realizing his broader vision. Trump so far seems more intent on gaining big victories for victory’s sake, content to trade horses in ways that don’t necessarily reveal a greater governing goal.\n“I always protect myself by being flexible,” he wrote in his 1987 book, “The Art of The Deal.”\nAdvertisement\n“I keep a lot of balls in the air, because most deals fall out.”\nWhen Republicans’ initial healthcare effort stalled in February, Trump responded by lashing out at members of the conservative House Freedom Caucus and even suggested he might support bids to unseat them. But on Thursday, he celebrated with them in the Rose Garden after an amended bill passed by a razor-thin margin.\n“We have a lot of groups,” Trump said after ticking off various Republican constituencies that included the moderate Tuesday Group. “But they all came together.”\nHow they did reflects how the president’s approach already has changed over his short tenure. In the initial healthcare negotiations, Trump welcomed an endless parade of House Republican lawmakers to the White House, but often they would return to Capitol Hill empty-handed.\nLawmakers were thrilled to find the president receptive of their ideas — he typically would turn to aides and ask them to look into a legislator’s request — but his enthusiasm often created mixed signals among competing factions and rarely resulted in a clear decision, members of Congress said.\nThat changed in the last week, when Trump tried to muscle wavering lawmakers on board.\n“He was much more directly engaged — not that he wasn’t before, but certainly more aggressively engaged,” said Sarah Huckabee Sanders, deputy White House press secretary. In the initial effort, Trump met with lawmakers in larger groups, but in the past week, he put a greater emphasis on one-on-one discussions, mostly phone calls.\nThe initial defection of influential Rep. Fred Upton (R-Mich.) was a huge blow to the House’s effort to pass the healthcare bill, as was the loss of Rep. Billy Long (R-Mo.). The two were among those worried that patients with preexisting conditions would lose coverage under the House Republican bill. They were working on an amendment to ease concerns of centrist lawmakers by pumping $8 billion to states to help cover health insurance costs.\nTrump called them both Tuesday.\n“I talked to the president for a good length, and I told him, without this provision, I couldn’t be there because I’ve always been concerned about those with preexisting,” Upton told reporters. “And he didn’t really want to accept changes.”\nLong hit a similar dead end after repeated calls from Trump.\n“The president said, ‘Billy, we really need you. We need you, man.’ I said, ‘You don’t have me.’\n“He said, ‘We really need you.’ We went through that for 20 minutes,” Long recalled.\n“He called back yesterday. ‘We need you. We need you. We need you.’ I said, ‘I’m a no.’ I said Fred Upton and I have been working on some language.”\nWhite House aides asked the two lawmakers to “come down and explain it to him,” and the next day, they were at the White House.\n“One of the lines that I read to him was that he said on Sunday that he wanted to make sure that the preexisting conditions were just as strong as in Obamacare,” Upton told reporters later that day, referring to remarks Trump had made in an interview with CBS News.\n“I pointed out a possible window of folks that would be excluded and what our amendment did,” Upton said. “He accepted fairly quickly.”\nObama was criticized for failing to wine-and-dine members of Congress; Trump is showing that schmoozing goes only so far.\nLawmakers care about the details not necessarily because they’re policy wonks, said Sarah Binder, a professor at George Washington University, but because they need to be able to understand the thorny particulars of legislation so they can talk to their voters about the issues.\n“It just seems that the ingredient you need to make unified party control as the silver bullet to break partisan gridlock [is] you’d have to have a more popular president,” she said.\nAnother shortcoming of Trump’s approach, which the president does not appear to have fully grasped, is that the negotiations he’s done so far were mostly within the Republican Party.\nBut on most other issues he will confront, he will have no choice but to deal with Democrats. That was true with the spending bill that Trump signed into law Friday from his New Jersey golf resort.\nIn that $1-trillion funding package, Trump gave way on several priorities, including money for his promised wall along the southwestern border, in return for a bill that kept federal agencies running and gave more money to the Pentagon. Both Democrats and Republicans celebrated the deal, as did the White House, at first.\nBut in the president’s view, Democrats were overzealous in spinning the deal as a setback for him, and he responded by suggesting ways to cut them out of negotiations entirely in the future — including getting rid of the Senate filibuster, under which 41 senators can block action on legislation.\nHe took to Twitter to suggest, among other things, that perhaps a good “shutdown” of the government next time a spending bill is needed, in September, would advance conservatives’ goals.\n“I think he’s understandably frustrated with how hard he’s working to achieve the promises, goals and objectives that he set out with the American people to make the country better, and to deal with multiple layers of obstructionism,” Press Secretary Sean Spicer said Wednesday.\nTo Democrats, that frustration only demonstrates why his campaign boasts about his dealmaking acumen never should have been trusted.\n“He claims that he’s a deal-maker, but if it doesn’t work out for him, he declares bankruptcy,” House Minority Leader Nancy Pelosi (D-San Francisco) said in an interview. “That’s what I heard him say … when he said what this country needs is a good shutdown.”\nLawmakers viewed Trump’s push for spending priorities, particularly his insistence on money for the border wall, which came late in the process, as gumming up what had been steady progress by congressional negotiators.\n“He seems to have a knack for actually preventing people from getting agreements,” said Sen. Chris Van Hollen (D-Md.), formerly the top Democrat on the House Budget Committee.\nDespite the president’s apparent agitation with the spending bill, the White House insisted to the end it was a good deal.\nSome of Trump’s most committed supporters feel otherwise. Ann Coulter, a conservative firebrand, asked in one op-ed how businessman Trump would have reacted if an employee charged with building a new golf course had still not yet broken ground, much as his “big, beautiful wall” remains at best in the planning state.\n“Trump would fire that employee so fast your head would spin,” she wrote at Breitbart.com, the website previously run by Stephen Bannon, now the White House chief strategist.\n“We want the ruthless businessman we were promised,” she wrote.\nUltimately, Trump’s best chance for success in future negotiations may be to accumulate greater political leverage, Binder said. The Republican strategy of relying on their own numbers to pass legislation “might work if you were a unified Republican Congress, but this is a really fractured Congress.”\n“The problem is you have these pretty tough disagreements between the right side and the left side of the Republican Party,” she said.\n“You need presidential leadership and political cover from the White House to choose the path.”\nTimes staff writer Noah Bierman contributed to this report.\nmichael.memoli@latimes.com; lisa.mascaro@latimes.com\nFor more White House coverage, follow @mikememoli on Twitter.\nALSO:\nTrump talks of possible shutdown next time as Democrats claim victory in spending fight\nTrump’s approach to an Israel-Palestinian peace deal: Get to yes, and figure out the details later\nTrump’s ‘big beautiful wall’ is not in the spending plan. Will it ever get built?",
    "label": 3
}