{
    "index": 184,
    "text": "Talk of White House firings and shakeups have been nearly constant since Inauguration Day. That said, over the weekend, sources inside and outside the White House say that President Trump's frustration with the direction of his agenda is real and that staff changes -- likely starting in the communications staff -- are coming.\n\"Everyone knows it's coming. The question is now, or August? Things can't keep going the way they are,\" a senior Trump administration official told me.\nWhite House press secretary Sean Spicer and communications director Mike Dubke are under the microscope now. The White House sent word out over the weekend that it wanted suggestions for a new press secretary. There have been reports that Fox News' Kimberly Guilfoyle is being considered -- she had originally been seriously considered for the job during the transition. Spicer is said to have spent some time with Mr. Trump on Sunday, and that may have stabilized his position.\nThe main impediment to White House staffing changes continues to be what it always has been -- who are the replacements? This is a factor that particularly influences chief of staff Reince Priebus, White House Counsel Don McGahn and chief White House strategist Steve Bannon. While some would be interested in such high-level posts, experience in the campaign or a solid working relationship with Mr. Trump are often lacking. Scarcity has created some degree of job security for those in the West Wing and under pressure to create better results. Another factor under consideration is the damage a disgruntled former senior staff member could do outside the White House.\nCommunications director Mike Dubke has some vulnerability. He was brought in to be communications director when Spicer was asked to focus on the press secretary job and drop the time-consuming obligations of communications director. The former is the face of the White House, who briefs the press and functions as the contact for their questions. The communications director oversees the White House messaging and promotes its agenda.\nDubke has no attachment to Mr. Trump and has always been something of an outsider. He's not a Trump loyalist and did not work for the campaign. He also has few real backers in the West Wing. Dubke could easily be made a fall guy, but should he be dismissed, this alone would not constitute a serious staff shakeup.\nThe central question around all of this is the depth of Trump's frustration and how much change he wants to set in motion before his first big foreign trip, where communications will be key in terms of the message presented by the White House and the narrative they end up with. Several people told me this weekend they expect any staff decisions to be made Monday or early Tuesday, and they assume if nothing is announced by Tuesday, no changes would be made until after Trump returns from his overseas trip.",
    "label": 3
}