{
    "index": 65,
    "text": "The process is not likely to be swift.\n— -- While House Republicans celebrated the passage of their Obamacare replacement bill by busing over to the White House’s Rose Garden for a celebratory press conference, their Senate counterparts were already working to manage expectations, declaring they are going to write an entirely separate bill.\n“At the end of the day, I think it'll be a Senate bill and then those two bills at some point will have to come together and we'll get started on that Senate bill immediately,” Sen. Roy Blunt, R-Missouri, a member of Senate leadership, told ABC News.\nSen. Lamar Alexander, R-Tennessee, the chairman of the Senate Help, Education, Labor and Pensions Committee (HELP), one of the panels that would help craft the final Senate bill, concurred, taking to the Senate floor right after the House vote to say, “Now we'll go to work on a Senate bill.”\nThe bill passed the House with a narrow 217-213 vote. At the press conference, President Donald Trump congratulated and thanked House Speaker Paul Ryan and praised House Republicans for coming together.\n\"What we have is something very, very incredibly well-crafted,\" Trump said of the bill. He added that he feels \"confident\" the bill will pass through the Senate and said it \"will get even better.\"\nBefore the Senate gets to work on its legislation, the Senate Budget Committee must first review the House bill and determine which portions of that legislation are in compliance with the rules of reconciliation, under which the bill only requires 51 Senate votes for approval.\nReconciliation requires all measures be strictly related to the budget. The House is not beholden to those rules, so its bill was not written with reconciliation in mind.\nOnly after the Budget Committee determines which parts of the House bill are in compliance with reconciliation, thus abiding by the so-called Byrd Rule, can the HELP and Finance Committees get to work on their own version of the bill.\nIt's not yet clear whether or not the bill will go through the standard committee markup process, moving through the panels of jurisdiction like HELP and Finance, or via some other channel. Committee Democrats have indicated they think McConnell could move a bill directly to the Senate floor.\nIn order for the Budget Committee to make its determinations, the nonpartisan Congressional Budget Office needs to provide its “score” of the House bill, which estimates the bill’s impact on the federal budget.\n“The Senate can't really get to work to figure out what might fit the reconciliation process until after the CBO score is secured. It will take some time for each policy the Senate wants to pursue to be evaluated against all the rules of reconciliation,” a Budget Committee aide told ABC News.\nThe House voted to pass the bill without a CBO score, though an earlier analysis of the bill from the CBO -- before several amendments were added -- projected that 24 million additional Americans would be uninsured by 2026 and that it would reduce the deficit by $337 billion, compared to the Affordable Cart Act.\nThe Senate process of writing its own, reconciliation-compliant bill will take time, but in addition, senators will also have to contend with the vast ideological differences that have become apparent in the course of the health care debate.\nWhen the House leadership released its original health care proposal in March, at least eight Senate Republicans said they had fundamental problems with the bill. The conservative Sens. Rand Paul, R-Kentucky, Mike Lee, R-Utah, and Ted Cruz, R-Texas, all tweeted that they would oppose anything short of a full repeal of Obamacare. They also said the House bill's tax credit structure to help people pay for coverage amounted to a new entitlement.\nFour other senators -- Cory Gardner, R-Colorado, Lisa Murkowski, R-Alaska, Rob Portman, R-Ohio, and Shelley Moore Capito, R-West Virginia — from states that expanded Medicaid under the Affordable Care Act, were concerned about the proposal's lack of protections for expansion beneficiaries.\nSen. Susan Collins, R-Maine, who opposed previous GOP efforts to strip federal funding from Planned Parenthood, also expressed opposition to the previous version of the House bill.\nNo Senate Democrats are expected to cross the aisle and vote for a replacement health care bill, meaning Senate Republicans could afford to lose only two votes from their 52 members and still pass the bill. Vice President Mike Pence would cast a vote in the event of a tie.\nAfter the Senate passes its own bill, the two chambers would likely have to reconcile differences in what's known as a conference committee. It's not clear whether House Republicans who voted for their version of the bill would sign on to changes requested by senators and vice versa -- a perennial concern for any legislation that goes through conference committee.\nCruz, who rejected the first House bill, suggested ahead of the House's vote that he would be open to using the new version as a springboard in the Senate but added, \"I have a number of concerns, and I think many senators do.\"\n\"If the bill does pass the House, then it will come to the Senate, and it will be incumbent on us to continue to work to make it better,\" he added.\nA spokesperson for Portman said the senator wants to see a better transition process for changing the way Medicaid is financed and more help for those receiving treatment for opioid addiction.\nCapito, who opposed the House bill's Medicaid provisions, said through a spokesperson that the new version does not address her concerns. \"She will work to improve the bill if it comes over to the Senate,\" her spokesperson said.\nAides for the other holdout Senate Republicans have not yet returned ABC News' request for comment.\nIn any event, the process is not likely to be swift. Senate Majority Whip John Cornyn of Texas, the chamber's second-highest-ranking Republican, told reporters Wednesday he thought the process of reconciling the two bills could take weeks.",
    "label": 3
}