{
    "index": 391,
    "text": "EPA removes climate change data, other scientific information from website\nShow Caption Hide Caption EPA cuts 'Obama-era' climate change page from website The Environmental Protection Agency has removed a page that explained the causes and effects of climate change as part of a website update. USA TODAY\nWASHINGTON — The Environmental Protection Agency is updating its website and, in the process, has removed a page that explained the causes and effects of climate change.\nThe agency said Friday the website, epa.gov, is undergoing changes to reflect its new direction under President Trump and EPA Administrator Scott Pruitt.\n“As EPA renews its commitment to human health and clean air, land and water, our website needs to reflect the views of the leadership of the agency,” J.P. Freire, the agency’s associate administrator for public affairs, said in a statement.\n“We want to eliminate confusion by removing outdated language first and making room to discuss how we’re protecting the environment and human health by partnering with states and working within the law.”\nThe overhaul already appears to have impacted at least two of the agency’s websites – the EPA’s main climate change site and another regarding the Clean Power Plan, a rule put in place under former President Obama to reduce carbon pollution from power plants.\nVisitors to the EPA’s main climate change website are now directed to a page that explains the site is being updated. The website, which launched in 1997, had included detailed data on the causes and the impact of climate change.\nAn archived snapshot of how the page looked under the Obama administration is still available from EPA’s main page. The agency said it will follow proper archiving procedures.\nRead more:\nThe first website update will reflect Trump’s position on energy independence and his calls for a review of Obama’s Clean Power Plan, the EPA said.\nThe site that included detailed data on the Clean Power Plan now directs readers to a page with photo of Trump signing an executive order in March to undo that rule and other Obama-era climate regulations.\nIn its statement, the EPA said the language associated with the Clean Power Plan is “out of date” and that content related to climate and regulation also is under review.\nEnvironmentalists said they were alarmed by the EPA’s decision to scrub scientific data from the site.\n“Cleansing has begun,” David Doniger, director of the Natural Resources Defense Council’s climate and clean air program, wrote on Twitter. “EPA website scrubbed of pages on ‘so-called’ Clean Power Plan. Now only alternative facts.”\nCleansing has begun. EPA website scrubbed of pages on \"so-called\" Clean Power Plan. Now only alternative facts. https://t.co/Zi3EphwU7v — David Doniger (@ddonigernrdc) April 29, 2017\nThe non-profit Environmental Data and Governance Initiative, which tracks governmental and science websites, called the website overhaul “concerning” and noted that the climate change resources became inaccessible the evening before tens of thousands of protesters participated in climate marches in Washington and other cities.\n“The timing of this overhaul cuts off availability when access to trusted information about the science behind climate change will be necessary to enable a conversation about our changing climate,” the group said.\nThe group said it will continue to monitor the website update and make sure the archived snapshot of epa.gov remains online and accessible.",
    "label": 3
}