{
    "index": 124,
    "text": "David Axelrod, a former top adviser to President Barack Obama, told CNN on Wednesday that \"it takes a lot of work to lose to Donald Trump,\" referring to former 2016 Democratic presidential candidate Hillary Clinton's surprising loss in her race for the for the White House.\n\"[FBI Director] Jim Comey didn't tell her not to campaign in Wisconsin after the convention, Jim Comey didn't say 'don't put any resources into Michigan until the final week,'\" Axelrod said.\nHis comments came after Clinton sat down Tuesday for an interview in which she partly blamed Comey's letter to Congress, which came out just 11 days before the presidential election and reopened the FBI's investigation into Clinton's use of a private email server, for her campaign's loss on November 8.\n\"I was on the way to winning until the combination of Jim Comey's letter on October 28 and Russian WikiLeaks raised doubts in the minds of people who were inclined to vote for me, but got scared off,\" Clinton said.\nAxelrod blamed Clinton's campaign mistakes for her loss, such as her lack of attention to key states like Michigan and Wisconsin, rather than outside factors such as the Comey letter. Both states went for Mr. Trump in November, the first time a Republican won either in decades.\n\"One of the things that hindered her in the campaign was a sense that she never fully was willing to take responsibility for her mistakes, particularly that server,\" Axelrod said.\nYesterday, Mr. Trump tweeted about Clinton's comments on Comey, saying that the FBI director was \"the best thing that ever happened to Hillary Clinton\" because he recommended she not face criminal charges over the server. Mr. Trump followed up with a tweet arguing that the \"Trump/Russia story was an excuse used by the Democrats as justification for losing the election.\"\nFBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony... — Donald J. Trump (@realDonaldTrump) May 3, 2017\n...Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign? — Donald J. Trump (@realDonaldTrump) May 3, 2017",
    "label": 1
}