{
    "index": 186,
    "text": "WASHINGTON -- The Supreme Court on Monday rejected an appeal to reinstate North Carolina's voter identification law, which a lower court said targeted African-Americans \"with almost surgical precision.\"\nThe justices left in place the lower court ruling striking down the law's photo ID requirement and reduction in early voting.\nThe situation was complicated when Democratic Gov. Roy Cooper and Attorney General Josh Stein tried to withdraw the appeal, which was first filed when Republican Pat McCrory was governor.\nChief Justice John Roberts said the political situation created uncertainty over who is authorized to seek review of the lower court ruling.\nThe dispute is similar to the court fight over Texas' voter ID law, also struck down as racially discriminatory.\nRepublicans in both states moved to enact new voting measures after the Supreme Court in 2013 struck down a provision of the federal Voting Rights Act that had required them to get advance approval before changing laws dealing with elections.\nVoters, civil rights groups and the Obama administration quickly filed lawsuits challenging the new laws. The Trump administration already has dropped its objections to the Texas law.\nShortly before Trump took office in January, the Justice Department urged the Supreme Court to reject the North Carolina appeal.\nWhen the law passed, North Carolina Republicans said voter ID is a sound requirement to increase the integrity of elections. But the 4th U.S. Circuit Court of Appeals said the state provided no evidence of the kind of in-person voter fraud the ID mandate would address. The Richmond, Virginia-based court said the law was enacted with intentional bias against black voters. The law was amended in 2015 to include a method for people unable to get a photo ID to still vote.\nFollowing the appellate ruling, the state asked the high court to allow the challenged provisions to remain in effect in November's election. The justices rejected the request by virtue of a 4-4 tie on most of the challenged provisions, with the four more conservative justices supporting the state's bid.\nRoberts cautioned Monday that the rejection of the appeal is not a comment on the court's view about the substance of the law.",
    "label": 3
}