{
    "index": 198,
    "text": "Washington (CNN) Susan Rice, President Barack Obama's former national security adviser, on Wednesday declined Sen. Lindsey Graham's request to participate in a judiciary subcommittee hearing next week on Russian interference in the US election, CNN has learned.\n\"Senator Whitehouse has informed us by letter that he did not agree to Chairman Graham's invitation to Ambassador Rice, a significant departure from the bipartisan invitations extended to other witnesses,\" Ruemmler wrote. \"Under these circumstances, Ambassador Rice respectfully declines Senator Graham's invitation to testify.\"\nA source familiar with Rice's discussions told CNN that when Graham invited her, Rice believed it was a bipartisan overture and was prepared to accept. However, Whitehouse indicated to her that the invitation was made without his agreement, as he believed her presence was not relevant to the topic of the hearing, according to the source.\nRice considered the invitation a \"diversionary play\" to distract attention from the investigation into Russian election interference, including contacts between Trump allies and Russians during the campaign, the source said.\nWhitehouse told CNN that \"with the exception of that invitation, Senator Graham and I have agreed on all witnesses that have been invited to this hearing.\"\nHe continued, \"I don't believe that Dr. Rice's participation is germane to the topic of this hearing, and I believe her presence would be a distraction from the critical issues at hand. I fully support her decision not to testify.\"\nOn Wednesday evening, Graham expressed concern that he learned about Rice's decision from the press -- not from the former Obama adviser herself.\n\"I'm disappointed,\" Graham said. \"I don't know why she won't come before the committee to tell us what she did or didn't do. But we'll deal with her later.\"\nGraham suggested that he wasn't prepared to subpoena her yet, but said he wants to have a hearing on the issue of \"unmasking\" the identities of Americans caught up in surveillance reports before he votes on reauthorizing a key section of the Foreign Intelligence Surveillance Act. And he said he wants to learn what she did to unmask identities of Americans.\n\"I want to know about unmasking,\" Graham said. \"Apparently the number of unmasking requests tripled last year, versus 2015 ... I want to know who can unmask an American citizen's name whose caught up in surveillance, and what they can do with that information.\"\nJUST WATCHED Sally Yates, James Clapper to testify Replay More Videos ... MUST WATCH Sally Yates, James Clapper to testify 01:40\nGraham first told CNN before the letter was sent that he had invited Rice to address the Senate panel to determine whether the Obama administration \"tried to politicize intelligence\" -- part of his broader investigation into Russian meddling in the 2016 US elections.\nFormer Deputy Attorney General Sally Yates and former Director of National Intelligence James Clapper are set to testify.\nRepublicans have raised concerns that Rice may have acted improperly while she was national security adviser by seeking to learn the identities of Trump officials discussing matters with foreign officials related to the Trump transition.\nThose officials were caught up in US intelligence surveillance of the foreign officials and had their identities unmasked after at first being referred to anonymously in the intelligence records.\nPresident Donald Trump at one point alleged Rice broke the law by requesting the unmasking of US individuals' identities. Trump had claimed the matter was a \"massive story.\"\nHe weighed in on Rice's decision Thursday morning, saying her decision to not testify was \"not good!\"\nSusan Rice, the former National Security Advisor to President Obama, is refusing to testify before a Senate Subcommittee next week on..... — Donald J. Trump (@realDonaldTrump) May 4, 2017\n...allegations of unmasking Trump transition officials. Not good! — Donald J. Trump (@realDonaldTrump) May 4, 2017\nBut Republican and Democratic lawmakers and aides have so far found no evidence that Obama administration officials did anything unusual or illegal, multiple sources in both parties have told CNN.\nDespite declining the appearance, Rice's lawyer assured Graham and Whitehouse in the letter that she was \"prepared to assist Congressional inquiries into Russian election interference because of the important national interests at stake, provided they are conducted in a bipartisan manner, and, as appropriate, in classified session.\"",
    "label": 2
}