{
    "index": 812,
    "text": "President Donald Trump’s border wall may not be going anywhere right now and one of Mexico’s leading candidates in the presidential elections told NBC News she wants to make sure the “useless” wall stays that way.\n“It’s a false solution to a false problem,” Margarita Zavala said of the wall through a translator in a phone interview Wednesday. “The wall does not help in any way the relationship between the two countries. The wall is pulling us apart.”\nTrump's proposed wall, she said, is more about scapegoating Mexicans for political gain than for U.S. security.\n“What Donald Trump has done is create an enemy. Mexicans have served as a convenient enemy to rally his supporters,” Zavala said, dismissing his comments at the start of his campaign about Mexican rapists and murders as “hate speech.”\nMargarita Zavala, at the Club de Industriales on February 12 2014 in Mexico City. Mario Guzman / EPA file\nZavala, a former member of Congress and ex-first lady (she is married to Felipe Calderon, a former president), is expected to be the nominee of one of Mexico’s two main political parties, the center-right National Action Party (PAN), for the country’s July 2018 presidential election. She has been referred to as the \"Hillary Clinton of Mexico\" in media reports.\nTrump is already shaping up to be a major issue in the campaign.\nThis week, the American president reiterated that Mexico will “eventually” pay for the wall \"in some form,” but Zavala didn’t even wait for an aide to translate that question before responding. “Never, never. We will never pay for the wall,” she said.\nWhile careful to not to attack Trump personally and to say the U.S.-Mexico relationship is much bigger than the president, she said Trump has strained relations between the neighbors.\n“The U.S. has to decide: What kind of a relationship does it want with Mexico? I think Donald Trump and the United States have a lot to lose if we don’t get along, so it’s time to decide how we’re going to conduct our relationship in the future,” she said.\nTrump thwarted one former first lady’s goal of becoming her country’s first female president last year, and he might help do it again next year in Mexico.\nMexican presidential candidate, Margarita Zavala, speaks as First Lady Michelle Obama looks on May 19, 2010 in Silver Spring, Maryland. Jim Lo Scalzo / EPA file\nZavala and her party had consistently led the polls for months. But she’s watched as a leftist opponent, Andrés Manuel López Obrador — who narrowly lost to Calderón 11 year ago — surged ahead by bashing Trump.\nObrador, a former mayor of Mexico City, mixes fiery left-wing populism with nationalism, troubling some American observers.\n“We are running the risk that a strong anti-U.S. sentiment becomes an issue in the election and that may help one candidate. But I will stand by the idea that it serves both countries to have a very strong relationship,” Zavala said.\nMexico’s current president, Enrique Peña Nieto, returned the traditionally dominant center-left Institutional Revolutionary Party (PRI) to power in 2012, after back-to-back victories by Zavala and Calderon's center-right PAN.\nRELATED: Will the wall prevent human trafficking as Trump claims?\nMexican presidents are limited to a single, six-year term, so Pena Nieto cannot run again. But corruption, his perceived softness on Trump, and other issues have damaged Pena Nieto's party’s standing.\nCalderón, Zavala's husband, lead the country from 2006 to 2012. But his heavy-handed approach to drug cartels have made him controversial in Mexico.\nZavala's has faced questions about whether she’s running as “a second coming” of her unpopular husband, but she dismissed that criticism.\n“I have my own career, I make my own decisions, and I am responsible for them,\" she said. \"And I think that’s been reflected both in the party and outside. People notice and that’s why I have a very strong position in the polls.”\nShe once called Obrador a “misogynist” because he referred to her as “Felipe Calderon’s wife.”\nClinton faced similar challenges last year and she said recently the misogyny was a factor in her loss to Trump.\nZavala, a longtime women's right’s activist like Clinton, has run in some of the same circles as the former Democratic presidential candidate, including when they both attended the 1995 World Conference on Women in Beijing, where Clinton gave her famous “women’s rights are human rights\" speech.\nBut Zavala isn’t interested in the comparison to Clinton.\n“Of course, those issues have brought us together at various times, but really my interest is in Mexico,” she said. “There are some similarities, but the two countries are very different.”\nZavala had a closer relationship with Michelle Obama, who was first lady at the same time as Zavala.\n“I had a personal relationship with Michelle. I think she’s a great leader and a great person,” Zavala said.",
    "label": 2
}