{
    "index": 304,
    "text": "On Saturday, President Trump will observe a milestone: his 100th day in office.\nIt’s also a millstone.\nFor nearly half a century, the marker has been used by pollsters, pundits and others who presume great wisdom to size up a fledgling White House and its still-green occupant.\nPresidents of both parties have objected to the somewhat arbitrary nature of the evaluations, which, in truth, don’t always coincide with the longer view of history.\n“You can use the first 100 days to try to understand some of the style of a presidency,” said Julian E. Zelizer, a Princeton scholar who has written extensively on presidents and politics. “But we really need to limit our analysis to that.”\nEven so, birds fly, fish swim and political observers are going to issue their report cards whether the president likes it or not, which he most certainly does not.\nAdvertisement\nWhy 100 days?\nWhy not? You’d prefer 99 or 101?\nSeriously.\nOK, it goes back to President Franklin D. Roosevelt and his first term, starting when the country was mired in the Great Depression, with unemployment around 25% and the stock market flat on its back.\nIn those early days of his presidency, the Democrat used a reassuring “fireside chat” — his radio address to the nation — to assuage panicky listeners and stop a run on the banking system. He also pushed more than a dozen major pieces of legislation through Congress, including a sweeping farm-relief bill, big public-works and social welfare programs, and significant banking and stock market regulations.\nIt’s not an overstatement to say those 100 days drastically changed America in ways that continue to this day.\nSo 100 days had a magical quality even then!\nActually, the number was somewhat random, though it does have a portentous feel to it. In this case, one hundred just happened to be the number of days in the special session of Congress that opened March 9 and ended July 24, 1933.\nHas any president come close to matching FDR’s performance?\nNo, although no president since has entered office under such grave circumstances.\nLucky for us!\nIndeed. Perhaps the closest was President Obama, who came into the White House amid the Great Recession, the country’s worst economic downturn since its namesake back in the 1930s.\n“You never want a serious crisis to go to waste,” said Rahm Emanuel, Obama’s politically pugnacious chief of staff, and the president capitalized on the anxious times by pushing through an expansive agenda, including an $800-billion economic stimulus plan.\nHe also made it easier for women to sue for job discrimination, loosened a ban on stem cell research, extended healthcare coverage to millions of children, helped rescue General Motors and Chrysler, set aside huge tracts of wilderness for federal protection, moved to reduce tensions with Cuba and the Muslim world and traveled to Canada, Europe, Turkey and Latin America.\nWhew! How does Trump compare?\nWell, that presumes that government activism is a good thing, which not everyone would agree upon. That said, there is a strong bias toward action when it comes to evaluating presidential performance.\nSo?\nTrump hasn’t pushed through a single major piece of legislation.\nHmm. He must be humbled and quite chagrined, wondering what’s gone wrong.\nYou crack me up.\nCome again?\nThe president and his representatives have portrayed his first 100 days as an unparalleled success, surpassing even Roosevelt’s performance.\n“I don’t think that there is a presidential period of time in the first 100 days where anyone has done nearly what we’ve been able to do,” Trump said.\nLike what?\nWhite House Press Secretary Sean Spicer has pointed to stepped-up immigration enforcement, more than 30 executive orders that Trump has signed — many aimed at rolling back regulations imposed by Obama — and the Senate confirmation of Supreme Court Justice Neil M. Gorsuch.\nTrump also approved airstrikes on Syria and Afghanistan and pulled the U.S. out of the Trans-Pacific Partnership trade deal with several Asian countries.\nGiven that performance, he must be quite enamored of the 100-day grading period.\nNo, actually he’s dismissed the whole concept as ridiculous, even though during the campaign he embraced the benchmark, and complained that no matter what he does — “& it has been a lot,” he tweeted — the media will never give him appropriate credit.\nThere he goes again!\nNow, now. In fairness, Trump is hardly alone in criticizing all the 100-day hoo-ha. In fact, ever since Roosevelt there’s been a sort of presidential tradition of scoffing at the benchmark; Obama derided it as the political equivalent of a “Hallmark holiday.”\nBut don’t those first 100 days tell a lot about, say, the 1,000 or so that follow?\nNot really. As Zelizer notes, Democrat Jimmy Carter was quite popular at the 100-day mark and his presidency is widely regarded as one of the least successful of modern times. Conversely, Republican Ronald Reagan and Democrat Bill Clinton both faced significant setbacks during their early months in office.\nReagan’s legislative agenda was stymied until a wave of sympathy after he survived an assassin’s bullet. Clinton needed three tries to land himself an attorney general. Yet both ended up being far more popular, and successful, than the rocky beginnings of their administrations suggested.\nYou’re saying, then, we can just ignore all the first-100-days blather?\nYou’ve read this far. Go ahead.\nmark.barabak@latimes.com\nTwitter: @markzbarabak\nALSO\nThis Democratic bastion flipped for Trump. After 100 days, voters have no regrets\nTrump at the 100-day mark: Stable support but few achievements\nGOP shuts out doctors, experts, Democrats — pretty much everybody — as they work on Obamacare repeal",
    "label": 3
}