{
    "index": 492,
    "text": "Hillary Clinton launches political group Onward Together to counter Trump\nShow Caption Hide Caption Hillary Clinton just announced what she'll be doing next Hillary Clinton formally launched Onward Together, a political nonprofit group that she said is 'dedicated to advancing the progressive vision that earned nearly 66 million votes in the last election.' USA TODAY\nWASHINGTON — Hillary Clinton is back.\nThe 2016 Democratic presidential nominee on Monday formally launched Onward Together, a political nonprofit group that she said is \"dedicated to advancing the progressive vision that earned nearly 66 million votes in the last election.\"\nThe group is poised to help fund some of the organizations at the forefront of liberal efforts to push back on President Trump's agenda and to seize seats from Republicans in Congress. Clinton said Onward Together will support groups such as Swing Left, which is working to elect Democrats to the House, and Indivisible, a rapidly expanding organization of anti-Trump activists who are using tactics borrowed from conservative Tea Party activists to oppose Trump and to challenge congressional Republicans at town hall meetings.\n\"This year hasn't been what I envisioned,\" Clinton said in one of a series of tweets Monday afternoon announcing her move, \"but I know what I'm still fighting for: a kinder, big-hearted, inclusive America. Onward!\"\nClinton said the group, whose leadership includes former Vermont governor and 2004 presidential candidate Howard Dean, will \"encourage people to get involved, organize and even run for office.\"\n\"More than ever,\" she said, \"I believe citizen engagement is vital to our democracy. I'm so inspired by everyone stepping up to organize and lead.\"\nWe're launching Onward Together to encourage people to get involved, organize, and even run for office. https://t.co/8exooosvZ5 — Hillary Clinton (@HillaryClinton) May 15, 2017\nThe former secretary of State kept a low profile immediately after the election — venturing for walks in the woods near her New York home and steadfastly ignoring reporters' questions when she attended Trump's Jan. 20 inauguration. But she has been increasingly vocal. During a March speech, for instance, she attacked Republicans for efforts to repeal the Affordable Care Act. She also is working on a new book of personal essays that is slated to be released this fall.\nOn Monday, Republicans criticized Clinton's return to the world of politics.\n\"The American people rejected Hillary Clinton six months ago because she's completely out-of-touch, untrustworthy, and embraced the failed policies of the past,\" Michael Ahrens, a spokesman for the Republican National Committee, said in a statement. \"If Democrats were smart, they’d realize it’s time to move onward from Hillary Clinton altogether.”\nAnd conservatives are likely to use Clinton's involvement to cast anti-Trump groups as arms of the Democratic establishment. Earlier this year, Trump complained on Twitter that many of the \"so-called angry crowds\" confronting Republican lawmakers were \"planned out by liberal activists.\"\nNathan Gonzales, who edits the non-partisan newsletter Inside Elections, said Clinton's involvement will energize the Republican base, but he said Clinton is unlikely to emerge as the \"defining\" figure of the 2018 midterm elections or the anti-Trump movement. \"When the party isn't in the White House, everyone thinks they are in charge and knows the way,\" he said.\nThe Democracy Alliance, an influential network of liberal donors, also has begun to connect with new groups, such as Indivisible.\nJulie Kohler, a top Democracy Alliance official, said Clinton's help is welcome. \"Right now, it's all hands on deck,\" she said. \"With her visibility and credibility on these issues, it's real net gain.\"\nClinton signaled her support for Swing Left earlier this month with a tweet, backing the group's fundraising drive to help Democrats in 35 swing districts occupied by Republicans who voted this month to repeal the Affordable Care Act. The drive raised $1.3 million, Swing Left spokeswoman Michelle Finocchi said.\nFinocchi said any financial support from Clinton's group will help pay for operating expenses, including hiring staffers.\nRead more:",
    "label": 2
}