{
    "index": 312,
    "text": "President Trump signed an executive order in April calling for Interior Secretary Ryan Zinke to review national monuments created by Presidents Clinton, George W. Bush and Obama . These monuments were set aside as public land under the 1906 Antiquities Act, which gives presidents the power to limit use of public land for historic, cultural, scientific or other reasons.\nIn advance of the signing ceremony, Zinke said the order would apply only to monuments created since Jan. 1, 1996, that are at least 100,000 acres.\nHere are the national monuments listed by the White House as being under review.\nBears Ears\n(Francisco Kjolseth / AP)\nEstablished Dec. 28, 2016: The 1.3-million-acre Bears Ears National Monument in the remote desert canyonlands of southern Utah was designated by President Obama, who created more national monuments than any other president. The Bears Ears designation angered Republican politicians in Utah, who want the land available for possible gas, oil and mining use -- and who directed Trump’s attention to the issue of national monuments. He said that the Bears Ears designation “never should have happened” and that it was part of “this massive federal land grab that’s gotten worse and worse and worse.”\nNortheast Canyons and Seamounts\n(NOAA Ocean Explorer)\nEstablished Sept. 15, 2016: Designated by President Obama, it is the first marine national monument in the Atlantic Ocean. The monument, encompassing 4,913 square miles off the coast of New England, protects ecological resources and species including deep-sea corals; sperm, fin, and sei whales; Kemp's ridley sea turtles; and deep-sea fish.\nMojave Trails\n(obamawhitehouse.archives.gov)\nEstablished Feb. 12, 2016: The Mojave Trails National Monument spans 1.6 million acres, a quarter of which had been previously congressionally designated wilderness. The area runs along a 105-mile stretch of old Route 66 between Ludlow and Needles and includes rugged mountain ranges, ancient lava flows and sand dunes. Before its designation as a national monument, the area was a popular destination for rock hounds looking to take home interesting gems and minerals.\nBasin and Range\n(Tyler Roemer)\nEstablished July 10, 2015: Known for its lunar-like landscapes, Basin and Range National Monument in southeast Nevada covers 704,000 acres of desert mountains and valleys. It’s roughly double the size of the city of Los Angeles. About a two hours northwest of Las Vegas by car, the site includes rock art, 19th century settlements and Native American sites.\nBerryessa Snow Mountain\n(berryessasnowmountain.org)\nEstablished July 10, 2015: This Northern California monument is about 331,000 acres, extending from nearly sea level in the south to peaks of 7,000 feet. The area is a popular winter habitat for bald eagles. The federal designation connected three wilderness areas and also protects cultural sites of Native Americans, who lived in the area for at least 11,000 years.\nOrgan Mountains-Desert Peaks\n(Bureau of Land Management)\nEstablished May 21, 2014: This is the land of famed western legends like Billy the Kid, Geronimo. The Organ Mountains Desert Peaks National Monument’s 496,000 acres surround Las Cruces, N.M., and include mountains and the southwestern Chihuahuan Desert. The area, which also features canyons lined in petroglyphs, was a training ground for World War II bomber pilots and crews and the Apollo space program.\nRio Grande del Norte\n(Bureau of Land Management)\nEstablished March 25, 2013: The rugged, wide-open plains of the 242,500-acre Rio Grande del Norte National Monument average an elevation of 7,000 feet. The Bureau of Land Management describes it as being “dotted by volcanic cones and cut by steep canyons with rivers tucked away in their depths.” Ute Mountain is the highest of the volcanic cones, reaching to more than 10,000 feet.\nMariana Trench\n(NOAA Office of Ocean Exploration and Research)\nEstablished Jan. 6, 2009: Created by President George W. Bush, this marine national monument protects 95,216 square miles of submerged lands and waters in the Mariana Archipelago. The area includes unique reef habitats and biodiverse marine ecosystems. The Marianas Trench is the deepest spot on earth at 36,000 feet below the sea.\nPacific Remote Islands\n(noaa.gov)\nEstablished Jan. 6, 2009, and enlarged Sept. 25, 2014: The Pacific Remote Islands Marine National Monument includes Wake, Baker, Howland and Jarvis islands; Johnston and Palmyra atolls; and Kingman Reef, which lie to the south and west of Hawaii. At 490,000 square miles, it’s the largest marine protected area in the world.\nFor the record: An earlier version of this story incorrectly gave the size of the monument as 408,301 acres.\nRose Atoll\n(NOAA)\nEstablished Jan. 6, 2009: This George W. Bush-designated marine national monument, encompassing nearly 13,400 square miles in the South Pacific Ocean, includes Rose Atoll, a small Samoan island and the southernmost point of the U.S. The monument also includes Rose Atoll National Wildlife Refuge, established in 1973, with about 20 acres of land and 1,600 acres of lagoon. The waters surrounding the atoll are home to rare giant clams and reef sharks, as well as an abundance of striking rose-colored corals. The island is a nesting site for rare species of petrels, shearwaters and terns.\nPapahanaumokuakea\n(noaa.gov)\nEstablished June 15, 2006, and enlarged Aug. 26, 2016: At more than 583,000 square miles of the Pacific Ocean northwest of the Hawaiian islands, the Papahanaumokuakea Marine National Monument is larger than all national parks combined. The coastal waters include abundant and rare wildlife. Getting there, however, is not easy.\nUpper Missouri River Breaks\n(Associated Press)\nEstablished Jan. 17, 2001: The 377,000-acre Upper Missouri River Break National Monument has “six wilderness study areas, the Cow Creek Area of Critical Environmental Concern, segments of the Lewis and Clark National Historic Trail and Nez Perce National Historic Trail, and the Ft. Benton National Historic Landmark,” according to the Bureau of Land Management. The monument stretches along 149 miles of the Upper Missouri River as well as Breaks country and sections of Arrow Creek, Antelope Creek and the Judith River.\nSonoran Desert\n(Getty Images)\nEstablished Jan. 17, 2001: The Sonoran Desert is known for the iconic saguaro cactus. The 487,000-acre monument includes extensive saguaro cactus forests. Distinct mountain ranges rise with the area: The Maricopa, Sand Tank and Table Top Mountain ranges rise within the monument, as do the Booth Hills and White Hills.\nCarrizo Plain\n(Francine Orr / Los Angeles Times)\nEstablished Jan. 17, 2001: Carrizo Plain National Monument is known for its spectacular wildflower blooms. The 204,000-acre monument is about 170 miles northwest of downtown Los Angeles. “The plain is home to diverse communities of wildlife and plant species including several listed as threatened or endangered and is an area culturally important to Native Americans,” according to the Bureau of Land Management. It also includes Soda Lake, the “largest remaining natural alkali wetland in Southern California.”\nVermilion Cliffs\n(Spencer Weiner / Los Angeles Times)\nEstablished Nov. 9, 2000: The 293,000-acre monument northeast of the Grand Canyon in Arizona has some of the most spectacular trails and vistas in the world. It’s remote and unspoiled, and the monument has diverse landscapes that include the Paria Plateau, Vermilion Cliffs, Coyote Buttes and Paria Canyon.\nIronwood Forest\n(John Miller / For the Times)\nEstablished June 9, 2000: The name comes from one of the longest living trees in the Arizona desert. The Ironwood Forest National Monument, at about 129,000 acres, showcases the Sonoran Desert. In addition to ironwood trees, the area features mesquite, palo verde, creosote and saguaro.\nHanford Reach\n(David Foster / Associated Press)\nEstablished June 9, 2000: Located in Washington state, the 195,000-acre Hanford Reach National Monument was created mostly from the former security buffer surrounding the Hanford Nuclear Reservation. Visitors to the site can learn about the role the area played in the Manhattan Project.\nCanyons of the Ancients\n(Ken Papaleo / Rocky Mountain News)\nEstablished June 9, 2000: Canyons of the Ancients National Monument in southwestern Colorado has historical and environmental significance. The area is known for its high density of archaeological sites. The presence of humans on this land dates back at least 10,000 years.\nGiant Sequoia\n(Marcus Yam / Los Angeles Times)\nEstablished April 15, 2000: The Giant Sequoia National Monument protects 34 groves of ancient sequoias. The giant sequoia, the world's largest species of tree, only grows naturally in a narrow 60-mile band along the western slopes of the Sierra Nevada in California. The monument spans 328,000 acres and is north and south of Sequoia National Park.\nGrand Canyon-Parashant\n(Mark Boster / Los Angeles Times)\nEstablished Jan. 11, 2000: Along the north rim of the Grand Canyon, this monument of more than 1 million acres includes deep canyons, mountains and buttes.\nGrand Staircase-Escalante\n(Education Images / UIG via Getty Images)\nEstablished Sept. 18, 1996: The 1.8-million-acre Grand Staircase-Escalante National Monument in southern Utah is distinguished by colorful cliffs, labyrinthine canyons and high desert plateaus. When it was designated a national monument by President Clinton, a coalition of local counties sued.\nRead more: Trump signs order to reconsider national monuments created by Obama, George W. Bush and Clinton »\nSan Gabriel Mountains\n(Allen J. Schaben / Los Angeles Times)\nEstablished Oct. 10, 2014: President Obama designated about 346,000 acres of existing federal lands as the San Gabriel Mountains National Monument. It remained under U.S. Forest Service management. The area is within 90 minutes of 15 million people in the Los Angeles Basin. Critics have questioned how meaningful the designation was in changing chronic issues with management of the area.\nUPDATES:\nUpdated Aug. 22, 8:30 a.m.: This story was updated to note that the Department of the Interior has no plans to eliminate or shrink the Sand to Snow National Monument east of Los Angeles.\nUpdated May 5, 4:35 p.m.: This story was updated to note that San Gabriel Mountains is on the list of monuments under reconsideration released by the U.S. Department of the Interior.\nUpdated April 27, 9:30 a.m.: The story was updated with information based on a list released by the White House. It now includes Rose Atoll, Northeast Canyons and Mariana Trench.\nUpdated April 27, 8:30 a.m.: This story was updated to note that San Gabriel Mountains is not on the list of monuments under reconsideration released by the White House.\nUpdated 11:45 p.m.: This story was updated with information about the Bears Ears National Monument in Utah.\nUpdated 8:45 p.m: This story was updated throughout with information from previous Times reports. In addition, attribution for information originating with government sources was added.\nThis story was originally published on April 26 at 12:05 p.m.",
    "label": 3
}