{
    "index": 931,
    "text": "Placeholder while article actions load\nUpdate: With voting underway in Georgia’s 6th Congressional District, President Trump again took to Twitter to remind voters that the Democratic candidate doesn’t live in the district he hopes to represent. When he first pointed this out, we compiled data on every other member of the House, finding that at least 5 percent of the body lives outside of their districts.\nWhile voters in Georgia’s 6th Congressional District were headed to the polls during Tuesday’s special election, President Trump shared a factoid that had just been brought to his attention.\n“Just learned that Jon Ossoff, who is running for Congress in Georgia,” he tweeted, “doesn’t even live in the district. Republicans, get out and vote!”\nTrump was correct. Ossoff, a Democrat, copped to living outside the 6th District during a town hall last weekend. He actually lives in the 5th Congressional District because, he says, his girlfriend prefers being able to walk to medical school at Emory University.\nOssoff is registered to vote at a home within the circle on that map — close to the 6th District, but outside of it. There’s no legal reason he should have to live in the district he hopes to represent; the Constitution mandates only that members of the House live in the state they are going to represent. That said, it’s generally considered politically advantageous to actually be a resident of the area you hope to represent.\nIf elected, Ossoff wouldn’t be the only member of Congress living in Georgia’s 5th District. There’s also Rep. John Lewis (D-Ga.), who represents the district. But a review of vote registration records by The Washington Post suggests that Ossoff would be the third member of Congress to make his home in the 5th. According to voter data provided to The Post by the political data firm L2, Rep. David Scott (D-Ga.) is also registered to vote in the district, instead of the 13th District that he represents.\nIn fact, The Post identified 20 members of Congress who are registered to vote outside of the districts they serve. In some cases, it’s clearly a function of redistricting. Four members of the House from southern Florida, for example, live outside of the districts they represent, but that’s likely because the Florida Supreme Court redrew the district boundaries at the end of 2015.\nAdvertisement\nIn total, we identified the records for 395 members of Congress, matching names and birthdates to voter files. In some cases, no voter record could be identified, perhaps because the name used to register to vote doesn’t match the name on the registration (if a nickname or abbreviation is used, for example) or because the birthdates don’t align (in some states, only months and years are included in the voter data). In addition to the four House members from Florida — Reps. Carlos Curbelo (R), Ted Deutch (D), Mario Diaz-Balart (R) and Alcee Hastings (D) — the following members of Congress are registered to vote outside of their districts.\nCalifornia: Reps. Tom McClintock (R), Grace Napolitano (D), Juan Vargas (D), Mimi Walters (R) and Maxine Waters (D)\nMaryland: Rep. John Delaney (D)\nMichigan: Rep. John Conyers (D)\nMinnesota: Rep. Jason Lewis (R)\nNorth Carolina: Rep. George Holding (R)\nNevada: Rep. Ruben Kihuen (D)\nAdvertisement\nUpdate: Kihuen’s voter registration data is out-of-date, as noted by his congressional office staff. Kihuen, who was elected last November, pledged to move into the district if he won. He did — and he moved in January. We’ve verified his updated information.\nNew York: Rep. Nydia Velázquez (D)\nTexas: Reps. Will Hurd (R) and Lloyd Doggett (D)\nVirginia: Rep. Donald McEachin (D)\nWashington: Rep. Pramila Jayapal (D)\nIn many cases — such as with Conyers — the representatives have served long terms in the House and may simply have seen their districts redrawn around them.\nThe broader point, though, is a simple one: Should Ossoff win the run-off in the 6th District in June, he will hardly be the only member of Congress to live outside of his district. If he loses, the residents of the 6th District will be served by Republican Karen Handel — who, as it happens, lives in the district.\nUpdate, April 26: Tom Bonier of TargetSmart took a look at the House members we weren’t able to match. There are still four representatives for whom we don’t have data, but he was able to identify two more who are registered to vote outside of their districts:\nRep. Ken Buck (R-Colo.). Represents the 4th District; registered in the 2nd.\nRep. Clay Higgins (R-La.). Represents the 3rd District; registered in the 5th.\nGiftOutline Gift Article",
    "label": 3
}