{
    "index": 342,
    "text": "President Trump pushed past his first tumultuous 100 days in office by calling for action Sunday on three of his administration’s top priorities — North Korea, healthcare and tax reform — but gave mixed signals on each of them.\nTrump described North Korea’s mercurial leader Kim Jong Un as a “pretty smart cookie.” Undercutting a key campaign pledge, Trump suggested possible cuts to Medicare by curbing “abuses.” And he declared that the top Democrat in the Senate, who has derided Trump’s tax proposal as a boon for the wealthy, was “making a fool of himself.”\nVice President Mike Pence separately acknowledged on NBC’s “Meet the Press” that a sweeping White House proposal to slash individual and corporate tax rates would increase the national debt “maybe in the short term.”\nThe White House previously has argued that improved economic growth would pay for the loss of revenue. Critics have said the Trump tax blueprint could add trillions of dollars to the deficit if enacted.\nThe day’s developments thus suggested little change from the head-snapping turmoil that marked the first part of Trump’s tenure. Senior aides scrambled in some cases Sunday to ease the sting of the president’s comments or even to contradict him.\nAdvertisement\nThe president also courted fresh controversy when the White House announced late Saturday that Trump had made a “very friendly” call to President Rodrigo Duterte of the Philippines and had invited him to visit the White House.\nSince taking office in June, Duterte has presided over a bloody anti-drug crackdown that human right groups say has left more than 7,000 people dead in what appears a campaign of extrajudicial killings by police and unidentified death squads.\nHuman rights activists angrily denounced the White House readout of Trump’s call, which noted blandly that Duterte was “fighting very hard to rid” his country of drugs. Critics said the White House was now morally complicit in the bloodshed.\nReince Priebus, the White House chief of staff, defended the invitation to Duterte, saying it did not signal White House approval for his methods in the drug war or a larger disdain for human rights.\n“The purpose of this call is all about North Korea,” Priebus said on ABC’s “This Week.” He said that Trump was trying to shore up alliances in Southeast Asia, and that Trump also spoke to the prime ministers of Singapore and Thailand on Sunday.\nManila is about 1,800 miles from Pyongyang. It has no influence on Kim or on events on the Korean peninsula, so it’s unclear how the Philippines would fit into a regional strategy for Northeast Asia.\nIt was not the first time Trump’s dealings with a foreign strongman have raised questions.\nTrump earlier in April hosted Egyptian President Abdel Fattah Sisi at the White House and praised him for doing a “fantastic job” despite his jailing of thousands of political opponents after he took power in a military coup.\nAlso in April, Trump was alone among Western leaders in making a congratulatory phone call to Turkish President Recep Tayyip Erdogan after he claimed victory in a referendum that vastly enhanced presidential powers.\nCritics called the Turkish referendum, whose results have been disputed by the leading opposition party, a blow to democracy.\nTrump, who spent Sunday at the Trump National Golf Club in Sterling, Va., had celebrated Saturday’s 100-day milestone with a full-throated attack on the news media and other perceived enemies at a raucous nighttime rally in Harrisburg, Pa.\nThe president had skipped the annual White House correspondents’ dinner, long a presidential staple. Surrounded by his wildly cheering supporters, Trump mocked the black-tie event as Washington and Hollywood elitists “consoling themselves” over the loss of the 2016 election.\nOn North Korea, Trump said in an interview with CBS’ “Face the Nation” that he didn’t know whether he would authorize military action if Pyongyang conducted a sixth nuclear test, as is widely expected.\n“I don’t know,” he said when asked if he would order a military response. “I mean, we’ll see.”\nThe president appeared to offer grudging praise for North Korea’s leader, noting that Kim took over when he was 26 or 27 after his father died and has consolidated power despite challenges from several members of his family.\n“A lot of people, I’m sure, tried to take that power away,” he said. “And he was able to do it. So obviously, he’s a pretty smart cookie.”\nTrump rattled South Korea last week when he said in at least two interviews that the government in Seoul, one of America’s closest allies, should pay $1 billion for a sophisticated missile defense system that the U.S. has begun installing in the country.\nThe Terminal High-Altitude Area Defense system, or THAAD, is intended to become operational within a matter of days, the Pentagon has said.\nDespite Trump’s comments, the White House national security advisor, H.R. McMaster, sought to reassure Seoul that Washington would not try to make South Korea pay for the anti-missile batteries, according to South Korea’s presidential office.\nMcMaster confirmed Sunday that was the case — for now.\n“What I told our South Korean counterpart is that until any renegotiation, that the deal’s in place, we’ll adhere to our word,” McMaster said on “Fox News Sunday.”\nSenior administration officials often have been forced to walk back Trump’s more provocative comments, especially on foreign affairs, without seeming to directly contradict the president.\nIn this instance, McMaster sought to put Trump’s comments in the context of looking at “appropriate burden-sharing” across all U.S. alliances.\nOn healthcare, Trump brushed aside the failure last week — the second — to bring a repeal of the Affordable Care Act, known as Obamacare, to the House floor, something he had pledged to accomplish early in his tenure.\nRepublicans have been unable to fully agree on the provisions of the complex legislation, and Trump probably caused the GOP leadership additional headaches when he leaped into the fray with a pledge that insurers would be required to offer coverage to consumers with preexisting health problems.\nA GOP compromise plan would have allowed states to opt out of that requirement, a cornerstone of Obamacare.\n“This bill has evolved,” Trump told CBS interviewer John Dickerson, adding that “now we have preexisting conditions in the bill” nationwide.\n“Preexisting is going to be in there,” the president added.\nTrump also appeared to hedge on what had been an ironclad campaign tenet: that he would not cut Medicare.\n“The concept of Medicare, I’m not touching,” he said, but added: “Waste, fraud and abuse … if there are things within Medicare that are being abused, I will touch that.”\nTax reform has been another area in which Trump has longed for a high-profile win. In the CBS interview, the president was dismissive of calls from some in Congress to condition tax reform on the release of the president’s income taxes.\nThe president has ridiculed Democrats’ stance on the issue, singling out Senate Minority Leader Chuck Schumer (D-N.Y.).\n“They don’t have the presidency, they don’t have the House, they don’t have the Senate,” Trump said Sunday. “And Schumer’s going around making a fool out of himself.”\nSchumer, appearing on “Fox News Sunday,” said his advice to Trump would be that “name-calling doesn’t work.”\n“If he changes, we could work together,” he said of the president. “But he can’t just dictate what he wants, not talk to us and say, ‘You must support it.’”\nlaura.king@latimes.com\n@laurakingLAT",
    "label": 3
}