{
    "index": 178,
    "text": "The search for an FBI director to replace James Comey is \"moving rapidly,\" President Trump said Monday. He was responding to a question from a pool of reporters during an Oval Office photo op with Crown Prince Muhammad bin Zayid Al Nuhayyan of Abu Dhabi.\nThe search for a new FBI director began soon after the president fired James Comey less than a week ago. Over the weekend, Mr. Trump said he hoped to pick a new director in short order, saying of the candidates that were being interviewed, \"These are outstanding people that are very well known, highest level. So we can make a fast decision.\" He even suggested that it was \"possible\" that he'd announce his choice to lead the FBI before he leaves for his first overseas trip as president Friday.\nHere are the candidates who have been interviewed by Attorney General Jeff Sessions and Deputy Attorney General Rod Rosenstein:\nAlice Fisher: Fisher is a lawyer and former Justice Department official who, if selected and confirmed, would be the first woman to lead the FBI. Currently, she focuses on white collar criminal investigations as a partner at Latham & Watkins, according to the firm's bio. She has also served as assistant attorney general in charge of the criminal division of the Justice Department.\nAdam Lee: Lee, an attorney licensed in California, is currently the FBI office chief for the FBI Richmond, Virginia Office. The FBI's profile of Lee says that he most recently served as section chief of the Public Corruption and Civil Rights Section in Washington, D.C.\nAndrew McCabe: McCabe is the current acting Director of the FBI. He served as the Deputy Director under now former Director James Comey. He is currently the subject of an internal DOJ investigation over whether he should have recused himself in the Hillary Clinton email investigation. His wife ran for office in Virginia and took money from a Clinton-linked donor.\nSen. John Cornyn: Cornyn is the senior senator from Texas, now serving his third term. He has also been the Texas attorney general and a judge on the Texas State Supreme Court.\nMichael Garcia: Garcia is a New York State Judge who is also a former federal prosecutor with extensive experience in immigration enforcement, a top priority for this administration. He would be the first Latino to lead the FBI.\nHenry Hudson: Hudson, a federal judge in Virginia, is nearly 70 years old, which could be a disadvantage, given Judge Henry Hudson is a federal judge in Virginia, and the first judge to rule against Obamacare. He's almost 70 years old, which could work against him in a job that carries a 10-year term.\nFran Townsend: Townsend served in George W. Bush's administration in the Justice Department, and she was also his former Homeland Security adviser. If selected, she would be the first woman to lead the FBI. She has also been a national security analyst for CBS News.\nMike Rogers: The former congressman from Michigan chaired the House Intelligence Committee, and he's also a former FBI agent who has been endorsed the FBI Agents Association to be FBI director.\nAnd Utah Sen. Mike Lee floated another name in the last couple of days, too:\nMerrick Garland: The top judge on the U.S. Court of Appeals for the DC circuit is more recently known as President Obama's failed pick for the Supreme Court who never got a confirmation hearing from the Senate. Judge Neil Gorsuch was named by President Trump to the Supreme Court instead.\nList compiled by Paula Reid, Khalea Robinson, Katie Ross Dominick and Andres Triay",
    "label": 3
}