{
    "index": 487,
    "text": "Trump's tweets on mishandled classified info come back to haunt him\nShow Caption Hide Caption Trump defends 'absolute right' to share intel with Russia President Trump is standing by what he told Russian diplomats in an Oval Office meeting, but it wasn't so long ago that he railed against intelligence leaks. USA TODAY\nPresident Trump has made it clear that he has no tolerance for leaks or careless treatment of classified material, just ask Hillary Clinton.\nBut the president himself was guilty of some loose lips during a recent (and controversial) visit to the Oval Office by Russian officials, according to a report from The Washinton Post.\nNow, before you start chanting \"Lock him up,\" remember that the president has a lot of authority to declassify material. But, given the whole Russia investigation, allegations of collusion and the recent firing of FBI Director James Comey, it's fair to say this falls under what the kids these days refer to as \"bad optics.\"\nHere's a look, in reverse chronological order, at how Trump himself has viewed people who play fast and loose with sensitive material:\nThe real story that Congress, the FBI and all others should be looking into is the leaking of Classified information. Must find leaker now! — Donald J. Trump (@realDonaldTrump) March 20, 2017\nThe FBI is totally unable to stop the national security \"leakers\" that have permeated our government for a long time. They can't even...... — Donald J. Trump (@realDonaldTrump) February 24, 2017\nfind the leakers within the FBI itself. Classified information is being given to media that could have a devastating effect on U.S. FIND NOW — Donald J. Trump (@realDonaldTrump) February 24, 2017\nLeaking, and even illegal classified leaking, has been a big problem in Washington for years. Failing @nytimes (and others) must apologize! — Donald J. Trump (@realDonaldTrump) February 16, 2017\nThe real scandal here is that classified information is illegally given out by \"intelligence\" like candy. Very un-American! — Donald J. Trump (@realDonaldTrump) February 15, 2017\nHillary's staff thought her email scandal might just blow over. Who would trust these people with national security? https://t.co/EvBCQoZRG2 — Donald J. Trump (@realDonaldTrump) October 16, 2016\nWikiLeaks proves even the Clinton campaign knew Crooked mishandled classified info, but no one gets charged? RIGGED! https://t.co/FgGxDsS0a1 — Donald J. Trump (@realDonaldTrump) October 17, 2016\nLyin' Hillary Clinton told the FBI that she did not know the \"C\" markings on documents stood for CLASSIFIED. How can this be happening? — Donald J. Trump (@realDonaldTrump) September 4, 2016\nHillary Clinton should not be given national security briefings in that she is a lose cannon with extraordinarily bad judgement & insticts. — Donald J. Trump (@realDonaldTrump) July 30, 2016\nCrooked Hillary Clinton and her team \"were extremely careless in their handling of very sensitive, highly classified information.\" Not fit! — Donald J. Trump (@realDonaldTrump) July 6, 2016\nFBI director said Crooked Hillary compromised our national security. No charges. Wow! #RiggedSystem — Donald J. Trump (@realDonaldTrump) July 5, 2016\nChina, Russia and Iran are laughing at us. We have weak leaders who are threatening our national security. Dangerous times. — Donald J. Trump (@realDonaldTrump) September 12, 2013\nMilitary reps have attacked @BarackObama over Bin Laden leaks--they believe he's just using this for his benefit. Not a big surprise... — Donald J. Trump (@realDonaldTrump) August 16, 2012\nIt is terrible that @BarackObama did not appoint an independent counsel to investigate the national security leaks. No accountability. — Donald J. Trump (@realDonaldTrump) June 27, 2012",
    "label": 2
}