{
    "index": 867,
    "text": "While President Trump has not signed any major legislation during his first 100 days, his administration has taken several sweeping steps in the area of criminal justice, a clear effort to fulfill his campaign pledge to restore “law and order.”\nUnder Attorney General Jeff Sessions, the Justice Department moved swiftly to freeze or cancel police training and oversight programs developed under the Obama administration.\nSessions formally instructed prosecutors to reassess those programs, reached through court-ordered consent decrees, in a memo last month. The Department also sought to block police reforms in Baltimore, a city beset by crime and policing controversies over the past few years, though a federal judge ruled it was too late to block the Obama-era reforms.\nSome police advocates welcomed the move, arguing that less federal intervention leaves room for police reform at the local level.\nIn late March, Sessions wrote a memo ordering his top deputies to review the police reform agreements and consent decrees currently being enforced in various cities.\n“They’re not interested in consent decrees as a means of advancing policing,” says Jim Bueerman, President of the Police Foundation.\nStephen Loomis, who advocates for police as president of the Cleveland Police Union, argues that consent decrees are “very dangerous” because they interfere with the judgment and independence of officers on the ground.\n“While the federal government may not want to pursue consent decrees, this actually creates an opportunity for state legislators to step up to the plate,” says Bueerman, who also served a police chief in California.\nUnder Sessions, the DOJ clearly wants states to take the lead.\nThe memo on police reforms asserted the federal government should not have the “responsibility” to “manage non-federal law enforcement agencies.”\nCivil rights advocates stress, however, that federal law explicitly calls on the feds to step in when citizens’ rights are violated by the police.\n“The consent decrees wouldn’t be necessary if there had not already been an established pattern or practice of wrongdoing,” says DeRay McKesson, a Black Lives Matter protester and former Baltimore mayoral candidate. It is true that federal judges typically must find discriminatory practices, or other wrongdoing, to order federal oversight for an entire police department.\nKevin Davis, the Baltimore Police Commissioner working to carry out the reforms, says federal involvement is a plus.\n“We believe a consent decree partnership with the Department of Justice makes us better, faster,” he said on MSNBC’s “The Point.”\nNo policy area has seen more efforts at execution action under Trump than immigration. There are major ideological divides about the wisdom of Trump’s efforts, but few deny their impact.\n“I think the Trump administration has made clear that they’re going to take his campaign promises and turn them into reality,” said Steven Choi, who runs the New York Immigration Coalition.\nThe Trump administration has taken tangible steps towards expanding barriers on the US-Mexico border, limiting immigration from the Middle East, limiting refugee access, limiting asylum for foreigners, reducing legal options for undocumented workers inside the U.S., and pressuring local officials to carry out immigration enforcement.\nSeveral of those efforts have been temporarily blocked by federal judges, including the two high-profile travel bans and, this week, an order pressuring local officials. Those policies remain frozen in court until later trials resolve whether Trump exceeded his presidential authority.\nPresidents generally have very wide immigration powers, under the Constitution and Supreme Court precedent. Trump allies cite that fact to argue they will ultimately win most of these challenges, while critics say it shows just how far out of the mainstream Trump is already operating.\n“This is an administration that is running when it should be walking,” said Tom Jawetz, an immigration expert at the Center for American Progress, a center-left think tank.\nRELATED: This county flipped for Obama, then went for Trump. How do they feel now?\nTrump has issued more executive orders than the past two presidents. Some legal experts say that suggests he will soon reach his limit on what can be achieved alone, without Congress or crafting more comprehensive policy.\n“I think that they’ve started by focusing on the priorities of immigration and violent crime,” says the Urban Institute’s Julie Samuels, “we’re waiting to see what the broader charging practices will be, especially with respect to drug offenses.”\nSessions, a supporter of harsh mandatory minimum sentences for non violent drug offenses, could roll back further reforms that make such sentences more common.\n“The writing's on the wall, but we haven’t seen that much action that will lead to the big reversal in the federal prison population,” Samuels said.\nThe administration has created a task force on marijuana issues, which pit the typically conservative emphasis on leaving states alone against Sessions’ stated desire to crack down on libertarian and liberal electorates that have voted to decriminalize marijuana.\nSam Kamin, who studies marijuana regulation at the University of Denver, notes the DOJ is still holding its fire.\n“A lot of the Obama lenience on marijuana could be undone by the Justice Department itself, without an act of Congress,” he told MSNBC.\n“While we’ve seen a number of Obama-era policies reverse, we haven’t seen this one change,” he explained.\nUltimately, if the Trump administration wants to withstand judicial scrutiny and lock in any of its law and order agenda, from drug regulation to immigration, it will ultimately have to work with Congress on permanent policies, not simply executive actions.",
    "label": 3
}