{
    "index": 430,
    "text": "Survey: American public's trust in government near historic low\nShow Caption Hide Caption Has Trump 'drained the swamp?' A new Gallup poll shows that most people don’t think Trump has made progress at changing Washington after his first 100 days. Jose Sepulveda(@josesepulvedatv) has more. Buzz60\nOnly two in 10 Americans say they trust the government in Washington, according to a new survey out Wednesday.\nThe Pew Research Center found that only 4% of Americans said they believed the government will do what is right \"just about always,\" while another 16% said they thought the government will act in good faith \"most of the time.\"\nThe report comes a little more than three months into the Trump administration and four months into the 115th Congress, both of which have seen low approval ratings among the public, per other reports.\nSome 68% said they trusted the government to do what was right some of the time, and 11% said they never trusted the government.\nNotably, no more than 30% have said they trusted the government in the past decade, starting during President George W. Bush's administration and continuing through President Obama's time in office. This is the longest period of low trust in the government since different groups started asking the question since 1958.\nOther times of low trust in government came during Bill Clinton's presidency in the mid-1990s.\nRepublicans (28%) were more likely to trust the government than Democrats (15%), for the first time since George W. Bush's presidency, according to the survey.\nRepublicans' trust in the government has climbed 17 points since October 2015, while Democrats' trust fell by 11 points in that same timeframe.\nThe survey also found that a majority of Americans (55%) said they are frustrated at the federal government, while 22% said they were angry at the government and 19% said they were content.\nStill, despite the trust and frustration levels, a majority of Americans (41%) said they were optimistic about the future of the United States. Another 30% said they had some confidence in the country's future, while 28% said they had no confidence at all.\nThe survey was conducted from April 5 to 11 among 1,501 adults. Read the full report here.\nRead: People trust science. So why don't they believe it?",
    "label": 2
}