{
    "index": 656,
    "text": "NEW You can now listen to Fox News articles!\nTrump administration officials reportedly clashed with G-7 energy ministers after pushing their pro-nuclear power and pro-fossil fuels agenda during meetings this week.\nG-7 officials, led by European energy ministers, refused to agree to stronger language pushing for fossil fuels in their joint statement unless the U.S. assured them they would stay in the landmark Paris climate deal, officials briefed on the talks told Politico Tuesday. A tense meeting among the ministers in Rome Monday ended with the officials scrapping a joint statement altogether.\nThe U.S.’ coal push became an issue for everyone involved, one G-7 negotiator told Politico. The negotiator added that Canada, Japan and European officials were frustrated over Trump’s position.\nThe negotiator added that the U.S.’ refusal to discuss the Paris climate deal in the joint statement raised European’s officials red flags, underscoring the widening gap between Trump and allies over climate change.\nIn a draft of a statement proposed by G-7 countries, obtained by Politico, U.S. officials pushed for stronger backing of clean coal and wanted to add a section that promoted nuclear energy. U.S. officials nixed a line that said G-7 nations would \"take the lead in tackling the challenges of electricity systems with high shares of variable renewable energy and in addressing the resilience of the electricity system.”\nThe spat among ministers during the meetings led to the scrapping of the joint statement. Instead, Italy’s economic development minister and summit chair release a summary of the meeting.\nEnergy Secretary Rick Perry said the Trump administration \"is in the process of reviewing many of its policies and reserves its position on this issue,\" the summary said.\nTrump signed an executive order last month undoing a slew of Obama-era climate change regulations. He has also threatened to take the U.S. out of the landmark Paris climate deal.\nPress Secretary Sean Spicer said last month an official decision on the U.S.’ position in the climate pact would be made during a G-7 meeting in May.\nClick for more from Politico.",
    "label": 2
}