{
    "index": 168,
    "text": "Deputy Attorney General Rod Rosenstein, a central figure in the ongoing controversy over the abrupt firing of FBI Director James Comey, agreed Friday to brief members of the Senate next week about Comey's ouster.\nRosenstein has been on the job for only a few weeks, but his role in President Trump's firing of the FBI chief has come under enormous scrutiny from Democrats on Capitol Hill.\nRosenstein met with Mr. Trump Monday before writing a memo criticizing Comey for his handling of the investigation in Hillary Clinton's email use. White House officials, including Vice President Mike Pence, said earlier in the week that Mr. Trump acted entirely on Rosenstein's recommendation when firing Comey.\nHowever, Mr. Trump told NBC News Thursday he had already decided to dismiss Comey before he met with Rosenstein Monday.\nThe evolving explanations from Mr. Trump and his team raise questions about why Rosenstein wrote the memo, CBS News chief Washington correspondent and anchor of \"Face The Nation\" John Dickerson said on the \"CBS Evening News\" Friday.\n\"What did the deputy attorney general think was going to happen when he wrote that letter for the president?\" Dickerson told Anthony Mason. \"Democrats say it looks like he was trying to provide legitimacy and the power of his reputation to cover for a decision the president made for other reasons.\"\nWhile Democrats have charged that Mr. Trump potentially obstructed justice by firing Comey over the FBI's investigation into Russian meddling in the election, Republicans have largely avoided criticizing the administration.\n\"The Republicans are still behind the president,\" Dickerson said. \"Those who have been skeptical about him in the past are skeptical, but the usual alliances, most Republicans are holding in support of the president, despite the fact that the president is making it difficult.\"\nThe controversy over Comey and the Russia investigation threatens to overwhelm the GOP's agenda in Congress, Dickerson added.\n\"But even if Republicans are in lockstep, there's another challenge here, which is, how do they continue pushing legislation, now that they have to face this distraction this week and the distraction that seems almost certain to come in the future?\" Dickerson said.\nTune into \"Face The Nation\" Sunday morning, where former Secretary of Defense Robert Gates will join Dickerson to discuss the Comey firing and Mr. Trump's presidency.",
    "label": 2
}