{
    "index": 353,
    "text": "It is no secret I admire many things about Barack Obama.\nI like that he was intelligent and agile enough to keep the American economy from disintegrating after the 2008 economic implosion. I like how he faced up to the challenge of climate change. I like that he was the first president to push through a comprehensive healthcare plan. Even if it was a flawed compromise with the insurance industry, it moved the ball a long way toward providing healthcare for everyone. I like that he got Osama bin Laden.\nI like the many ways he was different from the current resident at 1600 Pennsylvania Ave. I like that he was disdained by Vladimir Putin and adored by other Europeans instead of the other way around. I like that he was articulate, able to comprehend complexity and amazingly cool in a crisis instead of erratic and simplistic. I like that he was capable of delivering moments of inspiring oratory that tied together the many threads and colors in America’s historical tapestry instead of finding it difficult to express a coherent thought. I like that he could take a hit and respond with stoicism and sharp wit instead of being childishly petulant and vindictive.\nPerhaps more than anything, I like the example our 44th president and the first lady set as human beings living in the glare of constant public attention. Barack and Michelle were always classy and gracious with no hint of personal scandal.\n1 / 51 la-1491523602-y7ephyarj1-snap-image (David Horsey / Los Angeles Times) 2 / 51 la-1491368625-0bgh58ihw8-snap-image (David Horsey / Los Angeles Times) 3 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 4 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 5 / 51 Top of the Ticket cartoon (David Horsey / Los angeles Times) 6 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 7 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 8 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 9 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 10 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 11 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 12 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 13 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 14 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 15 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 16 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 17 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 18 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 19 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 20 / 51 Trump inspires millions to take to the streets -- to oppose him. (David Horsey / Los Angeles Times) 21 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 22 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 23 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 24 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 25 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 26 / 51 Top of the Ticket cartoon. (David Horsey / Los Angeles Times) 27 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 28 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 29 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 30 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 31 / 51 Top of the Ticket cartoon (David Horsey / Los Angeles Times) 32 / 51 Cartoon caption contest winner at the DENT conference in Sun Valley, Idaho: Jon Duval, executive director of the Ketchum Community Development Corporation. (David Horsey / Los Angeles Times) 33 / 51 Old radicals and big media descend on Selma (David Horsey / Los Angeles Times) 34 / 51 Horsey imagined the creation of the Ann Coulter phenomenon in this cartoon from 2007. (David Horsey / Los Angeles Times) 35 / 51 This David Horsey drawing is a reconfiguration of a cartoon he first published in 2006. (David Horsey / Los Angeles Times) 36 / 51 Donald Sterling, owner of the L.A. Clippers, should give Cliven Bundy a call. After Sterling loses his NBA franchise and the deadbeat Nevada rancher loses his cattle, the two old racists will both need a buddy. Maybe they can team up together and open an all-white rodeo. (David Horsey / Los Angeles Times) 37 / 51 Besides sending a chill up the spine of the international community, Vladimir Putin has accomplished one other thing by seizing Crimea and threatening the rest of Ukraine: Putin has brought back the bear. (David Horsey / Los Angeles Times) 38 / 51 The right-wing insurrection at the Bundy ranch in Bunkerville, Nev., has taken another weird turn with new revelations about the family history of Cliven Bundy. (David Horsey / Los Angeles Times) 39 / 51 See full story» (David Horsey / Los Angeles Times) 40 / 51 See full story» (David Horsey / Los Angeles Times) 41 / 51 See full story» (David Horsey / Los Angeles Times) 42 / 51 See full story» (David Horsey / Los Angeles Times) 43 / 51 See full story» (David Horsey / Los Angeles Times) 44 / 51 See full story» (David Horsey / Los Angeles Times) 45 / 51 David Horsey / Los Angeles Times (David Horsey / Los Angeles Times) 46 / 51 See full story» (David Horsey / Los Angeles Times) 47 / 51 See full story» (David Horsey / Los Angeles Times) 48 / 51 See full story» (David Horsey / Los Angeles Times) 49 / 51 See full story» (David Horsey / Los Angeles Times) 50 / 51 See full story» (David Horsey / Los Angeles Times) 51 / 51 See full story» (David Horsey / Los Angeles Times)\nIt is because I admire Obama that I am disappointed by his decision to take a $400,000 fee for a speech at a healthcare conference paid by a Wall Street bond firm, Cantor Fitzgerald.\nAdvertisement\nEx-presidents getting paid big bucks for corporate speeches is not a new thing. Gerald Ford started the practice after his short stay in the White House. Ronald Reagan, Bill Clinton and George W. Bush got their post-presidential paydays, as well. As a prospective president, Hillary Clinton, played the game, too, and seriously undercut her candidacy in 2016 with a private chat that earned her $350,000 from Goldman Sachs. Obama should show he is different because he always claimed to be different.\nIn his 2006 book, “The Audacity of Hope,” Obama wrote about how the process of raising money from big-money donors distorts the perceptions of politicians. Confessionally, he said that “as a consequence of my fundraising I became more like the wealthy donors I met, in the very particular sense that I spent more and more of my time above the fray, outside the world of immediate hunger, disappointment, fear, irrationality, and frequent hardship of the other 99 percent of the population — that is, the people that I’d entered public life to serve.”\nObama will never run for office again, but he is still, inescapably, in public life. He has said he intends to continue to serve the common good. He should start by refusing the $400,000, or, at a minimum, by donating most of it to a good cause.\nAs smart and eloquent as Obama may be, his words are not worth that much money. No one’s words are. Rich guys on Wall Street are not paying hundreds of thousands of dollars just to hear an ex-president talk for 45 minutes; they are investing in their own prestige and influence by showing they can purchase a piece of the leader’s good name and reputation. If Republicans want to make that deal with the devil, let them. Democrats should shun the opportunity if they want to reclaim their place as champions of workers and the middle class.\nRight now, Obama is composing a memoir covering his years as president. The publication deal guarantees more than $65 million for him and his wife, who is also putting a book together. That is a ton of money, but the market justifies it. He is putting in long hours of effort on a product that will make plenty of money for his publisher. He is a good writer with a compelling story to tell. That story will be available for anyone who can buy a copy of the book or check one out at a library.\nHowever, the $400,000 speech is in a different category. It is a seduction. It will hurt his reputation, and he should know it. There is nothing wrong with giving speeches and getting paid a good fee, but receiving nearly half a million dollars is abnormal. It would only seem reasonable to the too-big-to-fail bankers, corporate CEOs and Wall Street financiers whose obscene compensation packages have so distorted the wealth gap in our country.\nA few people complain that Obama is being held to a different standard on this issue because he is black. That is wrong. He is being held to the standard he set for himself.\nDavid.Horsey@latimes.com\nFollow me at @davidhorsey on Twitter",
    "label": 3
}