{
    "index": 46,
    "text": "— -- President Donald Trump has signed an executive order Thursday with the intention of easing restrictions imposed by the Johnson Amendment, the rule limiting political participation by tax-exempt religious groups.\n\"Faith is deeply embedded into the history of our country, the spirit of our founding and the soul of our nation,\" Trump told supporters gathered in the Rose Garden on Thursday. \"We will not allow people of faith to be targeted, bullied or silenced anymore.\"\nThe order's signing, coinciding with the National Day of Prayer, fulfills a key campaign promise by Trump, who once told a crowd of religious leaders that he envisioned a future in which they would be able to openly support political candidates. The amendment, originally a part of the Internal Revenue Code of 1954, prevents all 501(c)(3) non-profit organizations from advocating for political candidates.\nTrump said on Thursday that the federal government has \"used the power of the state as a weapon against people of faith.\"\n“No one should be censoring sermons or targeting pastors,” Trump said to applause. “You are now in a position where you can say what you want to say ... We are giving the churches their voices back.”\nAn alteration to the Internal Revenue Code -- which was adjusted in 1986 but continued to include Johnson Amendment -- would require an act of Congress, but Trump can influence how it is enforced. Sources told ABC News that the order instructs the Treasury Department not to target the tax-exempt status of churches and other institutions for supporting political candidates, which is currently forbidden.\nIn February at the National Prayer Breakfast, Trump promised to \"destroy\" the Johnson Amendment, saying that religious freedom was \"under threat all around us\" and that he's never \"seen it so much and so openly as since I took the position of president.\"\n\"It was the great Thomas Jefferson who said, 'The God who gave us life gave us liberty,\" said Trump at the breakfast. \"Jefferson asked, 'Can the liberties of a nation be secure when we have removed a conviction that these liberties are the gift of God?' Among those freedoms is the right to worship according to our own beliefs.\"\nTrump added, \"That is why I will get rid of and totally destroy the Johnson Amendment and allow our representatives of faith to speak freely and without fear of retribution.\"\nPrior to the election in November, Trump told the audience at a Virginia rally, \"I think it's very unfair, and one of the things I will do very early in my administration is to get rid of the Johnson Amendment so that our great pastors and ministers, rabbis and everybody and priests and everybody can go and tell and can participate in the process.\"\nSome supporters of the Johnson Amendment claim that organizations receiving tax exemption from the government should not directly engage with those who could determine whether to increase or decrease their benefits. Those opposed claim it violates the First Amendment's freedom of speech protections.\nTrump also announced that his first foreign visits as president would be to Saudi Arabia, Israel and The Vatican, mentioning each country's religious foundations.",
    "label": 3
}