{
    "index": 862,
    "text": "President Donald Trump has hired a Washington law firm to send a letter to a member of the Senate Judiciary Committee saying he has no connections to Russia, White House press secretary Sean Spicer said Tuesday.\nSpicer's revelation was in response to a question from reporters on a briefing about committee member Sen. Lindsey Graham’s remarks that he wants to look into whether Trump has any business dealings with Russia.\n\"The president, obviously, was aware of Senator Graham's suggestion after he made it today and he's fine with that. He has no business in Russia. He has no connections to Russia. So he welcomes that,\" Spicer said.\n\"In fact, he is already charged a leading law firm in Washington, D.C., to send a certified letter to Senator Graham to that point that he has no connections to Russia,\" Spicer said.\nThe announcement that Trump had retained a lawyer to deal with the Russia probe came just hours before the news broke that he'd fired FBI Director James Comey, who was leading an investigation into the administration's Russian ties.\nRelated: Trump Fires FBI Director James Comey Over Email Investigation\nGraham, a Republican who ran against Trump in the early days of the presidential campaign and has broken with him on several issues, said earlier Tuesday that he has no evidence of improper business ties Trump and the Russians, but he said he wanted to know if any business ties exist.\n\"I have no evidence that the Trump business organization did anything illegal with the Russians. I have no evidence of collusion. But do I want to know about business ties? Yes,\" Graham, who represents South Carolina, told reporters.\nGraham's comments come a day after a hearing before a Senate Judiciary subcommittee in which former Acting Attorney General Sally Yates testified that she warned the Trump administration that then-national security adviser Michael Flynn could be blackmailed by the Russian government because he misled the vice president about his \"problematic\" conduct.\nFlynn misled officials, NBC News and others have reported, by saying he hadn't discussed Obama administration sanctions on Russia in conversations with Russia's ambassador before Trump was inaugurated.\nRelated: Trump White House Was Skeptical of Yates' Warning on Flynn\nFlynn resigned in February over what he called \"incomplete information\" he inadvertently gave to the vice president-elect and others about the phone calls with the ambassador. Trump said at the time he fired Flynn for misleading Vice President Mike Pence.\nPresident Barack Obama personally warned Trump against hiring Flynn, NBC News reported Monday. Flynn was director of the Defense Intelligence Agency under Obama until he was pushed out in 2014.\nThe U.S. intelligence community believes Russia was involved in a covert campaign to interfere in the 2016 presidential election. Russia has repeatedly denied the claim.\nTrump and other Republicans have acknowledged Russia was likely involved but have said they believe the alleged attempt had no effect on the outcome.",
    "label": 2
}