{
    "index": 457,
    "text": "USATODAY - Washington Top Stories\nSubscribe\nThis feed's current articles are shown below. Subscribe for updates to all the content available in this feed, or click through here to see the original article.\nRussia squeezes Ukrainian strongholds in the east as officials plead for more weapons: Live updates\n2022-05-27 12:36 UTC by USA TODAY\nRussian forces have made slow but persistent advances as they bombarded and sought to encircle both Lysychansk and Sievierodonetsk.\nBelarus sending troops to Ukraine border; Finland prime minister visits Ukraine: Live updates\n2022-05-27 12:15 UTC by USA TODAY\nSecretary of State Antony Blinken laid out how the White House aims to use the bloc opposed to Russia's invasion of Ukraine to compete with Beijing.\nMcConnell signals Republicans willing to engage on limited gun measures 'directly related' to Uvalde\n2022-05-27 12:13 UTC by USA TODAY\nSen. Mitch McConnell said he's asked Republicans to look into gun control measures in the wake of the school shooting in Uvalde, Texas this week.\nWhat did the May primaries teach us about the future of the U.S. Senate?\n2022-05-27 12:06 UTC by USA TODAY\nIn May Senate primaries, GOP newcomers with ties to former President Donald Trump replaced more establishment Republicans running for Congress.\nTed Cruz walks away from interview after question on US mass shootings: 'Your political agenda'\n2022-05-27 12:04 UTC by USA TODAY\nU.S. Sen. Ted Cruz, R-Texas, walked away from an interview after a reporter asked him why mass shootings happen \"only in America.\"\nGun control vs. mental health: We tracked congressional campaign messaging after the Texas shooting\n2022-05-27 10:24 UTC by USA TODAY\nUSA TODAY analyzed social media posts from more than 1,000 congressional candidates to map what they said on gun violence after the school shooting.\nOnPolitics newsletter breaks down events daily. Sign up!\n2019-11-13 21:52 UTC by USA TODAY\nSign up here!\nEven after an Uvalde school shooting left 19 children and two teachers dead, the NRA will hold its annual convention 300 miles away in Houston, Texas.\nAbortion brawl draws Ruth Bader Ginsburg's legacy on Roe v. Wade into the spotlight\n2022-05-27 09:01 UTC by USA TODAY\nA leaked draft opinion that rocked the nation in early May rejected Ginsburg's view that abortion restrictions raised questions about gender equality.\nRussia-Ukraine explained: Inside the crisis as US calls Russian movements an invasion\n2022-02-22 21:02 UTC by USA TODAY\nWith the US and allies preparing to impose sanctions on Russia for actions in Ukraine, USA TODAY looks at the conflicts causes and potential outcomes.\nBiden to address Naval Academy, Delaware commencements over Memorial Day weekend\n2022-05-27 08:19 UTC by USA TODAY\nPresident Joe Biden will address the graduating classes at the U.S. Naval Academy and the University of Delaware over Memorial Day weekend.\nDespite Trump's interference, Brian Kemp and Brad Raffensperger won their primary contests. Here's what that means for Georgia's GOP.\nTexas officials investigate whether police acted fast enough to stop shooter at Uvalde school\n2022-05-27 10:42 UTC by Austin American-Statesman\nTexas officials investigate the massacre timeline at Uvalde's Robb Elementary School to see whether police acted quickly enough to stop the shooter.\nFormer special agents will not face charges in FBI's botched investigation of Larry Nassar\n2022-05-26 23:44 UTC by Indianapolis Star\nLarry Nassar, a former USA Gymnastics doctor was sentenced to more than 100 years imprisonment in 2018 for sexual abuse.\nOnPolitics: Despite Texas shooting, gun control advocates fear inaction\n2022-05-26 20:50 UTC by USA TODAY\nGun control advocates fear that the mass shooting at an elementary school in Uvalde, Texas on Tuesday will not spur tough gun control laws.\nVoting rights in the USA: Inside a pivotal year for changes to American elections\n2022-05-26 20:44 UTC by USA TODAY\nLaws aimed at voter suppression are said to be the worst in decades. With midterm elections this year, 2022 could help shape voting rights in the US.\nBiden to travel to Texas to comfort families of Uvalde school shooting victims\n2022-05-26 21:40 UTC by USA TODAY\nPresident Joe Biden says he hopes to comfort the Uvalde, Texas community after an elementary school shooting that saw 19 children and 2 adults killed.\nBiden said he would have needed to be a 'mind reader' to respond quicker to the baby formula shortage, but analysts said he should have acted sooner.\nDemocrat leaders demand stricter gun laws after Uvalde shooting left 19 children dead\n2022-05-26 17:44 UTC by USA TODAY\nDemocrat leaders called out Republican senators as they make the case for stricter gun laws following the mass shooting in Uvalde, Texas.\nOklahoma governor signs nation's strictest abortion ban, effective immediately\n2022-05-26 17:07 UTC by Associated Press\nOklahoma implements an anti-abortion law prohibiting most abortions beginning at fertilization.\nPast mass shootings at Virginia Tech, Sandy Hook and Parkland High School all sparked hopes gun control laws would be coming, but bills got blocked.\n'A charged moment for the world': Blinken says war in Ukraine will not distract US from China threat\n2022-05-26 16:50 UTC by USA TODAY\nSecretary of State Antony Blinken said China is testing American diplomacy like \"never before,\" as he laid out how the U.S. should respond.\nZelenskyy mocks, rejects Kissinger plan to concede parts of Ukraine to Russia\n2022-05-26 14:42 UTC by Associated Press\nHenry Kissinger urged Ukraine to concede occupied territory, telling the West not to pursue a defeat of Russia to facilitate an end to the conflict.\n'Enough.': Biden signs police reform order on two-year anniversary of George Floyd killing\n2022-05-26 00:07 UTC by USA TODAY\nPresident Joe Biden's policing order will limit use of force, call for national accreditation standards and create a database of police misconduct.\nWhat are HR 8 and HR 1446? Gun control bills still await Senate votes after Texas shooting\n2022-05-26 14:27 UTC by USA TODAY\nFollowing the mass shooting at an elementary school in Uvalde, Texas on Tuesday, the future of increased gun control legislation is still uncertain.\nJan. 6 committee was told that Trump spoke approvingly of calls to 'Hang Mike Pence': report\n2022-05-25 23:16 UTC by USA TODAY\nMark Meadows told colleagues that Trump reacted approvingly on Jan. 6 to rioters' chants to \"Hang Mike Pence,\" according to a New York Times report.\nBeto O'Rourke approached the stage where Gov. Abbott spoke from at a press conference addressing Tuesday's shooting at Robb Elementary.\nOnPolitics: POTUS calls on lawmakers to 'stand up to the gun lobby'\n2022-05-25 21:06 UTC by USA TODAY\nBiden challenged lawmakers to resist the gun lobbies after at least 19 children were shot to death at a Texas elementary school.\nLawmakers responded with prayers, calls for mental health resources and renewed vows for gun legislation after 21 people were killed in a shooting.\nBaby formula shortage: FDA chief admits federal regulators were 'too slow' to act\n2022-05-25 19:35 UTC by USA TODAY\nThe baby formula shortage will drag on at least another month, according to testimony Wednesday.\nThe agency - the nation's gun enforcement agency - has been without a Senate confirmed director for seven years.\nPennsylvania to recount votes in GOP Senate primary between Trump-backed Oz and McCormick\n2022-05-25 18:58 UTC by USA TODAY\nLess than 1,000 votes separated Dr. Mehmet Oz, backed by ex-President Donald Trump, and hedge funder David McCormick in the Republican Senate primary.\nSarah Sanders wins primary, Brooks headed to runoff, Paxton defeats Bush\n2022-05-25 15:57 UTC by USA TODAY\nSarah Huckabee Sanders, former White House press secretary in the Trump administration, won the Republican primary in the Arkansas governor's race.\nSchumer, McConnell react to deadly Texas elementary school shooting\n2022-05-25 15:50 UTC by Associated Press\nMajority Leader Chuck Schumer and Minority Leader Mitch McConnell opened the Senate by addressing the deadly school shooting in Uvalde, Texas.\nBrowser-Friendly feed by FeedBlitz RSS Services, the premium FeedBurner alternative.",
    "label": 2
}