{
    "index": 310,
    "text": "President Trump and House Republicans, in their rush to resuscitate a bill rolling back the Affordable Care Act, are increasingly isolating themselves from outside input and rejecting entreaties to work collaboratively, according to multiple healthcare officials who have tried to engage GOP leaders.\nThe White House and its House GOP allies are hoping to reschedule a vote on their overhaul plan in the coming days, following last month’s embarrassing retreat when the bill was pulled shortly before a vote.\nBut they continue to refuse to reach out to Democrats. Even Senate Republicans have been largely sidelined, though their support will be crucial to putting a measure on Trump’s desk.\nAnd senior House Republicans and White House officials have almost completely shut out doctors, hospitals, patient advocates and others who work in the healthcare system, industry officials say, despite pleas from many healthcare leaders to seek an alternative path that doesn’t threaten protections for tens of millions of Americans.\n“To think you are going to revamp the entire American healthcare system without involving any of the people who actually deliver healthcare is insanity,” said Sister Carol Keehan, president of the Catholic Health Assn., whose members include many of the nation’s largest medical systems.\nAdvertisement\nHealth insurers, who initially found House Republicans and Trump administration officials open to suggestions for improving insurance markets, say it is increasingly difficult to have realistic discussions, according to numerous industry officials.\n“They’re not interested in how health policy actually works,” said one insurance company official, who asked not to be identified discussing conversations with GOP officials. “It’s incredibly frustrating.”\nAnother longtime healthcare lobbyist, who also did not want to be identified criticizing Republicans, said he’d never seen legislation developed with such disregard for expert input. “It is totally divorced from reality,” he said.\nThe result may be a short-term victory for House leaders and the White House as Trump nears his 100-day mark, assuming they muster the votes this time. But prospects for final passage of a healthcare overhaul bill remain dim.\nObamacare 101: A periodic primer on the debate over repealing and replacing the Affordable Care Act »\nHouse Speaker Paul D. Ryan’s office did not respond to a request for comment.\nTrump and senior House Republicans have steadfastly defended their bill, however, promising it would lower healthcare costs while preserving protections for vulnerable Americans.\n“The plan gets better and better and better,” Trump said last week at the White House. “And it’s gotten really, really good. And a lot of people are liking it a lot.”\nHouse Republican leaders are now working to win over wavering members of their caucus with a proposed amendment making it easier for states to drop key protections in the current law that, among other things, prohibit insurers from charging sick people more for coverage.\n“What this amendment does is it gives states more flexibility and tools to reduce premiums and increase choices,” Ryan, of Wisconsin, said Thursday, explaining states would still have to assure coverage is available for sick consumers, even if they are priced out of the market.\nBut not a single major group representing doctors, hospitals and patients supported the original House legislation, which the nonpartisan Congressional Budget Office has estimated would increase the ranks of the uninsured by 24 million over the next decade.\nOpposition among those who work in healthcare has only deepened amid the current GOP efforts to win over conservative lawmakers with the new amendment, with the American Medical Assn. and the American Hospital Assn. restating their rejection of the House legislation.\nThe American Cancer Society’s advocacy arm — one of many leading groups representing patients with serious illnesses who have spoken out against the GOP campaign to repeal Obamacare — warned of the return of “a patchwork system of health coverage in which patients with preexisting conditions in some states would no longer be protected.”\nThe powerful AARP said that provisions in the House bill would push up insurance costs for older Americans while doing nothing to tackle high prescription drug costs.\nAnd on Wednesday, a coalition of six leading physician groups representing more than 560,000 doctors — including pediatricians, family physicians and obstetricians — urged congressional leaders to put aside the House GOP legislation and work with doctors on an alternative that would not jeopardize insurance coverage for millions of Americans.\n“Our members see firsthand the important role that healthcare coverage and access to affordable, high-quality care plays in people’s lives and their pursuit of better health and well-being,” the groups wrote.\n“They also recall those days when patients faced discrimination based on their age, gender or health conditions, and remember when those with mental and behavioral health needs were denied coverage.”\nThe House legislation would dismantle Obamacare’s extensive system for expanding health insurance coverage to millions of Americans, cutting nearly $1 trillion in federal aid that has allowed states to expand the Medicaid safety net programs and scaling back tax subsidies that help millions of low- and middle-income Americans buy commercial healthcare plans.\nA proposed amendment to the bill that House Republicans are now considering could also weaken other consumer protections in the current law, including mandates that require health insurers to cover basic benefits such as mental health and maternity care.\nAt the same time, the House bill would repeal major taxes that the current law imposed to fund the expansion of health coverage.\nThat would deliver major tax breaks to the medical device and insurance industries and to wealthy Americans. The House bill also scraps the unpopular requirement in the current law that Americans have insurance or pay a penalty.\nThe House bill is deeply unpopular, with polls showing fewer than one in five Americans backing the legislation.\nEven many Republican senators — including conservatives such as Tom Cotton of Arkansas and Lindsey Graham of South Carolina — have voiced deep reservations about the legislation.\nAnd after the bill appeared to collapse last month when GOP leaders didn’t have enough votes to bring it to the House floor, many who work in the healthcare system pleaded with the White House and congressional Republicans to undertake a new, more collaborative approach.\n“This is not a problem either party can solve alone, but it is solvable with bipartisan efforts,” the Catholic Health Assn. noted at the time.\nRohit Kumar, who was a senior aide to former Senate Majority Leader Bill Frist (R-Tenn.), said that imperative remains even more crucial today.\n“If you’re going to make progress, you’re going to have to bring in more stakeholders,” said Kumar, a leading tax and healthcare advisor at consulting giant PwC.\nThat simply hasn’t happened, according to multiple healthcare leaders.\nWhen asked if he’d been contacted by any Republican leaders for suggestions about ways to improve the legislation that failed last month, a senior lobbyist at one leading patient advocacy group simply laughed out loud.\nA side-by-side comparison of Obamacare and the GOP’s replacement plan »\nnoam.levey@latimes.com\n@noamlevey\nALSO\nObamacare 101: A periodic primer on the debate about repealing and replacing the Affordable Care Act\nWhat’s the big debate over health insurance cost-sharing subsidies?\nThe First 100 Days: Tracking President Trump’s campaign promises",
    "label": 3
}