{
    "index": 929,
    "text": "Placeholder while article actions load\nDonald Trump’s presidency has always been predicated on a shaky link between undocumented immigrants and crime. From the first minutes of his campaign announcement through his speech accepting the Republican nomination last summer, Trump consistently argued that crime in the United States — which he has also shakily claimed is surging — is in some large part a function of immigrants who are in the country illegally. There’s no strong evidence that there’s a link between immigrants and crime beyond a number of salacious anecdotes. But campaign rhetoric is often imperfectly tethered to reality, particularly when offered by Trump.\nOn Friday, Attorney General Jeff Sessions offered the administration’s latest attempt to link crime to undocumented immigrants. In a letter sent to nine jurisdictions — the state of California, Chicago, Las Vegas, Miami, Milwaukee, New Orleans, New York City and Philadelphia — the Justice Department threatened to end federal funding if the locales continue to follow “sanctuary city” policies, laws that restrict how and when federal immigration officials are informed about contact with undocumented immigrants.\nThe Justice Department’s announcement reads, in part:\nAdvertisement\n[M]any of these jurisdictions are also crumbling under the weight of illegal immigration and violent crime. The number of murders in Chicago has skyrocketed, rising more than 50 percent from the 2015 levels. New York City continues to see gang murder after gang murder, the predictable consequence of the city’s “soft on crime” stance. And just several weeks ago in California’s Bay Area, after a raid captured 11 MS-13 members on charges including murder, extortion and drug trafficking, city officials seemed more concerned with reassuring illegal immigrants that the raid was unrelated to immigration than with warning other MS-13 members that they were next.\nThis is a good example of the point made above: The use of anecdotes to make a case that the data don’t support. New York City still has murders, certainly, and some are gang-related. But the number of murders in New York is far, far lower then in years past — and the murder rate kept falling even as the city abandoned its tough-on-crime, “stop and frisk” policy. Chicago has such a severe problem with homicide that it alone is responsible for much of the increase in murders in America’s large cities. But not many of those murders are linked to illegal immigration; when Trump linked the two, experts readily disagreed. As for the claim that the above-named jurisdictions may be “crumbling,” that will probably come as a surprise to their residents.\nThe more important point is that these nine jurisdictions are not among those with the most severe crime problems in the United States.\nIn terms of number of murders, New York City is often near the top of the list. But, then, it’s the largest city in the country by a wide margin. If you look at the murder rate — the number of killings per every 100,000 people, the picture is different. Here is a comparison of murder rates to population in cities tracked by the FBI. (Figures are for 2015, the last year for which full FBI data are available.)\nNew York is far higher than other places in terms of population — but there are a lot of jurisdictions with higher murder rates. In fact, of the 8,300 jurisdictions for which the FBI collects data, 1,360 have higher murder rates than New York.\nConsidering only violent crime, 1,060 jurisdictions have higher rates than New York.\nThe jurisdictions mentioned by the Justice Department aren’t all the most violent or deadly even among large cities. Below is every jurisdiction of 100,000 people or more, with the Sessions jurisdictions highlighted. (We highlighted most major cities in California, plus Salinas, the city with the highest murder rate in that state.)\nSt. Louis, for example, had the highest murder and crime rates in 2015. It didn’t get a letter.\nAdvertisement\nSessions would apparently argue that it’s the sanctuary city policies in the locations that received the letter that necessitates action. Independent analysis, though, found that in 2015, large counties with sanctuary policies reported lower crime rates — and equivalent homicide rates — than counties without such policies.\nOn Twitter, The Washington Post’s Devlin Barrett noted an irony in pulling federal funding from New York.\nSo @theJusticeDept is threatening to withhold \"Byrne grant'' money from NYC unless it stops being a sanctuary city for illegal immigrants 1/ — Devlin Barrett (@DevlinBarrett) April 21, 2017\nThe grants are named after Eddie Byrne, an NYPD officer murdered by drug dealers in 1988 while he guarded a witness's house 2/ — Devlin Barrett (@DevlinBarrett) April 21, 2017\nByrne's murder was a huge deal - brazen targeting of a cop by drug dealers - & it spurred a lot of action, including fed grants to locals 3/ — Devlin Barrett (@DevlinBarrett) April 21, 2017\nThe year Byrne was gunned down in his patrol car there were 1,896 murders in NYC. Last year there were 335. 4/ — Devlin Barrett (@DevlinBarrett) April 21, 2017\nThe federal funds at risk were introduced after a particularly heinous crime in New York, and, in the years after that funding began, the crime and murder rates in the city plummeted. The causal relationship there is uncertain, but it raises a good point more generally: Is giving Chicago less money for law enforcement a good way to bring down its murder rate?\nUpdate: New York’s mayor weighs in.\nIf President Trump believes it, then I invite him to come to NYC, look our officers in the eye and tell them they're soft on crime. — Mayor Bill de Blasio (@NYCMayor) April 21, 2017\nGiftOutline Gift Article",
    "label": 3
}