{
    "index": 332,
    "text": "As they scramble to get votes to advance legislation to roll back the Affordable Care Act , President Trump and House Republican leaders insist their bill would protect Americans who have preexisting medical conditions.\nBut most healthcare experts and patient advocates dispute this, noting that the House GOP plan would allow states to scrap many protections put in place by Obamacare, as the law is often called.\nThis week, even late-night talk host Jimmy Kimmel jumped into the debate, telling his viewers Monday night about how his son was born with a congenital heart condition that would have once made him uninsurable.\nIf you’re trying to make sense of the competing arguments, here’s a look at Obamacare’s protections for sick patients and how those safeguards could change under the GOP alternative.\nObamacare 101 is a periodic primer on the debate over repealing and replacing the Affordable Care Act »\nAdvertisement\nHow did Obamacare change how preexisting conditions are handled?\nOne of the healthcare law’s most revolutionary advances was prohibiting health insurers from denying coverage to people with preexisting medical conditions, a protection called guaranteed issue.\nThe practice of denying coverage was once widespread in the insurance industry.\nIn order to get healthcare coverage (if they did not get it through work), consumers had to fill out detailed medical histories.\nAnd insurance companies routinely turned down people who had had major illnesses, such as cancer, or even less serious ailments such as arthritis.\nAlternatively, insurers would charge people with preexisting medical conditions more for their health plans.\nThis also was barred by Obamacare, a protection that is known as community rating.\nJimmy Kimmel reveals his son was born with a heart defect.\nHow many people did these new protections affect?\nIt is difficult to know how many sick Americans who were denied coverage before Obamacare now have a health plan.\nBut federal census data and other surveys show that more than 20 million previously uninsured people have gained coverage since the law began guaranteeing coverage in 2014.\nAt the same time, other research suggests that as many as one in four Americans have some kind of preexisting medical condition, which could have made them uninsurable before 2014.\nWhat would the House Republican plan do?\nThe American Health Care Act , as the House Republican healthcare bill is called, does not eliminate the guaranteed issue provision of Obamacare.\nBut a proposed amendment to the bill by Rep. Tom MacArthur (R-N.J.) would make some significant changes to the insurance protections enacted in Obamacare.\nImportantly, the amendment would allow states to obtain a waiver from the federal government to eliminate the community rating requirement in the current law. That would allow insurance companies to once again charge consumers with preexisting medical conditions more for coverage.\nIn other words, a patient with diabetes , heart disease or cancer might still be “guaranteed” coverage, but only if he or she agreed to pay five or 10 times as much for a health plan.\nBut didn’t Trump and other Republicans say the bill would enhance protections for patients with preexisting conditions?\nYes. Supporters of the amendment say that sick Americans would still be protected in these states because the amendment, among other things, requires states to enact other protections, such as offering a special insurance plan for sick customers, known as a high-risk pool.\nThe House bill offers states billions of dollars to operate these high-risk pools.\n“The AHCA provides significant resources at the federal and state level for risk-sharing programs that lower premiums for all people,” House Speaker Paul D. Ryan (R-Wis.) claims on his website.\nSo would sick consumers be protected?\nNot necessarily.\nNothing in the amendment requires states to certify that health plans available through the high-risk pools would be affordable.\nPatients with preexisting conditions in some states would no longer be protected.— American Cancer Society Cancer Action Network\nThat means that many sick consumers might not be able to buy such a plan, leaving them once again unable to get coverage, as many were before Obamacare.\nIn fact, many states operated high-risk pools before the current law was enacted. Most were underfunded, forcing states to either charge unaffordable rates for coverage or cap how many people could sign up for a plan.\nDo advocates for the sick think the legislation will protect patients?\nIn a word, no.\nNot a single major group representing physicians or patients supports the House bill.\nIn a letter to lawmakers last month, the American Cancer Society’s advocacy arm warned that the proposal could “have the effect of returning the nation to a patchwork system of health coverage in which patients with preexisting conditions in some states would no longer be protected.”\nAnd this week, a coalition of 10 leading patient advocacy groups, including the American Diabetes Assn., the American Heart Assn., the Cystic Fibrosis Foundation and the March of Dimes, called on Congress to scrap the approach.\n“We challenge lawmakers to remember their commitment to their constituents and the American people to protect lifesaving healthcare for millions of Americans, including those who struggle every day with chronic and other major health conditions,” the groups warned.\nAlready a subscriber? Thank you for your support. If you are not, please consider subscribing today. Get full access to our signature journalism for just 99 cents for the first four weeks.",
    "label": 3
}