{
    "index": 76,
    "text": "The election was viewed as a referendum on France's future in the EU.\n— -- Emmanuel Macron, a centrist former economy minister who emerged from a crowded field of seasoned politicians, has won the French presidential election, a race widely viewed as a referendum on the swell of nationalism imbuing the continent.\nAfter polling agencies initially projected Macron to receive 65 percent of the vote to far-right candidate Marine Le Pen's 35 percent, Le Pen conceded the race and French Prime Minister Bernard Cazeneuve formally declared Macron the winner as a mass of his supporters celebrated in Paris outside the Louvre.\nMacron, 39, was running in his first bid for elected office against Le Pen of the National Front, a political party founded by her father Jean-Marie Le Pen.\n\"A new page in our long history is opening,\" Macron said in French in his victory speech. \"I want that page to be one of hope and renewed trust... From the very first day of my presidency, democracy will be the foundation of my activity and I will not let any obstacle come in my way.\"\nLe Pen campaigned on a protectionist platform and has voiced skepticism about the European Union.\nThe upstart Macron, who resigned from his ministry position to start his own independent political party, En Marche, just over a year ago, was widely viewed as a longshot candidate when he announced his bid for the presidency. He and Le Pen advanced to a runoff election after finishing first and second in an initial vote two weeks ago.\nMacron is expected to be sworn in within days, succeeding current French President Francois Hollande. Hollande called Macron to congratulate him after polls closed on Sunday and wrote on Twitter in French that he expressed his \"best wishes for success.\"\nSupporters of French independent centrist presidential candidate, Emmanuel Macron react outside the Louvre museum in Paris, May 7, 2017. Laurent Cipriani/AP Photo\nThe president-elect's initial challenge will be to reconcile with the widespread nationalistic fervor that buoyed his opponent.\nLe Pen, in her second run for the presidency following a failed bid in 2012, took steps to moderate the hard-line right-wing positions upon which her father founded the National Front.\nDespite Macron's projected wide electoral margin, turnout at the polls was far below normal and a large number of ballots were cast in which no candidate was selected, which may be further evidence of the political divisions in the country. The 35 percent received by Le Pen would be the strongest showing for a National Front candidate in a presidential election by a wide margin.\n\"I know the divisions of our nation that led some to extreme votes. I respect these,\" Macron said. \"I know the anger, the anxiety, the doubts that a large part of you have also expressed. It is my responsibility to hear these.\"\nLe Pen's candidacy was the latest in a wave of competitive elections for nationalists in Europe, jump-started by Great Britain's vote last summer to exit the European Union. In March, the Dutch Party for Freedom led by Geert Wilders -- an ally of Le Pen who pledged to \"de-Islamise\" the Netherlands -- finished second in that country's general election.\nFrench presidential election candidate for the far-right Front National (FN) party Marine Le Pen delivers a speech in Paris, May 7, 2017, after the second round of the French presidential election. Bertrand Guay/AFP/Getty Images\nLe Pen's positions on national security and the admittance of refugees drew parallels to U.S. President Donald Trump. Trump did not formally endorse a candidate in the French election but did call Le Pen, \"strongest on borders.\"\nTrump had kind words for Macron on Twitter after the result was announced Sunday, writing, \"Congratulations to Emmanuel Macron on his big win today as the next President of France. I look very much forward to working with him!\"\nAn additional statement from White House Press Secretary Sean Spicer said the administration looked forward to \"continuing [its] close cooperation with the French government.\"\nA spokesperson for German Chancellor Angela Merkel called the result a \"victory for a strong and united Europe.\" Le Pen frequently attacked Macron for close ties to the German leader, saying at a debate last week that, if elected, Macron would be beholden to her.\nMacron is expected to continue many of the policies championed by Hollande, particularly with regard to foreign relations. The former investment banker is an advocate of free market economics and his ardent support of the European Union was a tenet of his campaign.\nIn the last week, Macron received an endorsement from former U.S. President Barack Obama, whose influence on the French politician was apparent in a campaign built on an outlook of hope -- the same message that vaulted Obama to the White House in 2008.\nABC News' Benjamin Gittleson, Mike Trew, Marcus Wilford and The Associated Press contributed to this report.",
    "label": 2
}