{
    "index": 284,
    "text": "Washington (CNN) A few hours after the House finally passed a bill to repeal and replace the Affordable Care Act, Mitch McConnell walked silently and expressionless from his office to a waiting black SUV outside the Capitol. Only his police detail and an aide were with him as he left the quiet building and drove off.\nThe solitary scene was a sharp contrast from the crowded and boisterous victory rally President Donald Trump threw for relieved House Republicans in the White House Rose Garden after the vote. But it may capture the low-key, no-frills style of McConnell, the determined Senate majority leader from Kentucky, that could serve him well as he takes on one of the most important legislative challenges of his career.\nAll eyes now turn to McConnell and his fellow Senate Republicans to see if they can accomplish what the House GOP did through fits and starts: Pull together an ideologically diverse conference and secure enough votes to get rid of Obamacare, a promise they've made repeatedly but failed to keep since President Barack Obama's health care law passed in 2010.\n\"The Senate is looking forward to getting it,\" Trump said after the House vote. \"Mitch McConnell knows how to do things, and I think we're going to have some really great health care for a long time.\"\nMcConnell, who has led the Senate Republicans for a decade, may be one of the most disciplined politicians in America and therefore uniquely suited for the task. He will need all the self-control and detachment he can muster to steer the complex health bill through the competing demands -- and passions -- of the various factions of his caucus while also writing effective legislation that could set the nation's health policy for a generation.\nMcConnell's reputation is that of the ultimate Washington insider, a talented legislative tactician who utilizes the dense Senate rules to achieve his goals. Those skills will be on display as he works to maximize what can pass using the Senate's complicated budget reconciliation process, which will allow Republicans to pass a repeal without any Democratic votes.\nJUST WATCHED Kasich: GOP health plan 'woefully inadequate' Replay More Videos ... MUST WATCH Kasich: GOP health plan 'woefully inadequate' 03:57\nHis working knowledge of the specialized ways of Washington, gained through 30 years in the Senate, make him someone who Trump, the outsider, needs to lean on to get the Obamacare repeal and other legislation passed. To date, despite GOP control of both chambers of Congress and the White House, Republicans have yet to score any major legislative accomplishments. That adds pressure on McConnell to get health care across the finish line.\nThat process will begin in about two weeks after the Congressional Budget Office delivers its official score of the House bill, an estimate of what it will cost taxpayers and how many people will gain or lose health insurance because of it. The CBO said the original House measure in March could mean 24 million fewer people are insured by 2026 than under Obamacare.\nJUST WATCHED Senate votes to trigger nuclear option Replay More Videos ... MUST WATCH Senate votes to trigger nuclear option 00:56\nAfter that, McConnell will square off against Democrats in a critical behind-the-scenes debate -- known in colorful Senate parlance as a \"Byrd Bath\" -- to determine which parts of the House bill meet the Senate's strict reconciliation rules and can stay in the bill and which parts must be cast aside.\nIt's based largely on whether the provisions are related to taxes and spending and will lower the deficit or if they are unrelated policy matters that aren't allowed in a budget reconciliation bill. The judge is the non-partisan Senate parliamentarian, Elizabeth McDonough, who will hear arguments on both sides before deciding.\nA politician who doesn't seek the limelight\nJUST WATCHED Warren cut off during Sessions debate Replay More Videos ... MUST WATCH Warren cut off during Sessions debate 01:13\nMcConnell is accustomed to the limelight even if he doesn't seek to bathe in it the way many politicians do. The 75-year-old sixth-term Kentuckian was unflinching in the face of withering criticism from Democrats after he blocked Merrick Garland, President Barack Obama's nominee to the Supreme Court last year and then used the \"nuclear option\" to make it easier for Trump to put his nominee, Neil Gorsuch, on the court. His defiance and fortitude won him praise and loyalty from most Republicans -- including Trump.\nRepublican senators routinely praise McConnell's leadership skills and soft-spoken but direct messaging style. For the most part, he doesn't suffer from the damaging internal backbiting many legislative leaders encounter. Texas GOP Sen. Ted Cruz once called him a \"liar\" on the Senate floor. But the clash was an aberration and McConnell responded coolly, dispatching other senior senators to chastise the younger Cruz.\nThe only time recently that McConnell has shown anger in public was during a February debate over the nomination of Sen. Jeff Sessions, R-Alabama, to be attorney general, when McConnell abruptly interrupted Sen. Elizabeth Warren and accused her of breaking Senate rules that forbid one senator from disparaging another member on the floor, something she denied doing.\n\"She was warned. She was given an explanation. Nevertheless, she persisted,\" McConnell said of Warren.\nIn the end, the late-night dust-up probably bolstered Warren's standing with liberals more than anything else.\nAnnoyance can he heard in McConnell's voice occasionally on the floor when he gets into a back-and-forth with Democratic Leader Chuck Schumer, D-New York, or Schumer's predecessor Harry Reid of Nevada. But McConnell is typically on-message, reading dryly from a well-honed text written by his staff that lays out exactly what he wants to say about a given issue, and not an ounce more or less.\nAnd McConnell doesn't mind hammering his messages home, often repeating the same lines day after day until they take root in the debate.\nAt news conferences, McConnell is unflappable, deflecting reporters who regularly bait him to criticize Trump. McConnell will be straightforward when he disagrees with the President -- and has said he should stop tweeting so much -- but McConnell has yet to make a major gaffe as he has juggled countless questions about Trump's unorthodox presidency.\nWhile McConnell is from the establishment wing of the party, he got behind Trump once the businessman won the nomination and never wavered the way House Speaker Paul Ryan did. While the two men are not close friends, they have a respectful working relationship. They meet in person or speak on the phone regularly. Trump called McConnell after the House vote Thursday, according to a White House official, to deliver the message that it's now the Senate leader's task to complete the work.\nMcConnell is tighter with Vice President Mike Pence, the former House member who attends weekly meetings with Senate Republicans, and who was a critical force in getting the repeal bill through the House. Pence is expected to play a similar role as the Senate considers the bill.\nQuiet persuasion may be key to success\nFor all his strengths as a politician, what McConnell may need most is the power of quiet persuasion as he works private meetings and phone calls to convince conservatives Republicans like Cruz and Sens. Mike Lee of Utah and Tom Cotton of Arkansas to accept an outcome that more moderate members of the caucus like Sens. Susan Collins of Maine and Lisa Murkowski of Alaska could vote for too.\nHe might also need the courage to cut loose someone like Collins -- or fellow Kentuckian Sen. Rand Paul, who has blasted the House bill -- if he feels they won't support an emerging deal, something GOP aides say could happen.\nMcConnell can afford to lose two members of his caucus and still get 51 votes with a tie-breaking vote from Pence.\nMcConnell will lead a 13-member Senate working group on health care that will go behind closed-doors to try to hammer out a compromise over the next several weeks.\nJUST WATCHED Tom Price SOTU full interview Replay More Videos ... MUST WATCH Tom Price SOTU full interview 10:01\nIf they reach a deal that can pass the Senate, McConnell then must determine whether to go into negotiations with the House to resolve differences between their bills or just send the House the Senate bill and force it to \"take-it-or-leave it.\" McConnell's decision would be critical because, while the pressure could be enormous on the House to accept whatever the Senate can pass, it would be a risky gambit in that House Republicans could reject the Senate bill and the whole effort could fail.\nIssues the Senate must resolve\nBut before that happens there are many difficult issues McConnell must help resolve to get a bill through the Senate.\nWhat to do about the expansion of Medicaid, which is supported by some GOP senators in swing states that expanded their Medicaid programs under Obamacare but is opposed by some GOP senators in red states that did not expand?\nWhat to do about tax credits that make insurance more affordable for lower-income consumers but that are expensive to the treasury?\nWhat to do about Obamacare regulations that are popular with some senators because they protect consumers but abhorred by others who argue they are mandates from Washington that drive up premiums?\nThe thorny issue of abortion is part of the debate too because the House bill includes language defunding Planned Parenthood. That won't sit well with some moderate Republicans who will want to take out the provision. But keeping it in could be a powerful incentive for conservative Republicans to accept other compromises in the bill they don't like.\nEach Republican senator has unique policy and political needs related the bill. It will be McConnell's job to understand and respect each situation and design a final bill that is carefully tailored to those imperatives and, in the end, is the least bad for most of them. He then must persuade the others, especially those not thrilled with the final agreement, to support it anyway.\nDemocrats warn to watch out for politics\nDemocrats warn privately that McConnell might put the political interests of his 52-member conference -- especially those up for re-election in 2018 -- ahead of the repeal-and-replace effort. They think McConnell would be happier to remain in the majority in two years and still have Obamacare in place than to than to get rid of law but be in the minority.\nIf over the next few weeks, McConnell can use his skills to quietly and deftly thread the needle between his party's policy and political interests, he might be able to have both.",
    "label": 3
}