{
    "index": 181,
    "text": "The U.S. 9th Circuit Court of Appeals on Monday will hear oral argument on President Trump's revised travel ban from early March and whether it violates the Constitution.\nThe federal appeals court, based in San Francisco, will hold a hearing at 12:30 p.m. ET in Seattle. The court will review the decision issued by Hawaii U.S. District Court Judge Derrick Watson regarding the ban's enforcement.\nThree judges, all appointed by President Bill Clinton, will decide the case, according to The Los Angeles Times. They are Judges Ronald Gould, Richard Paez and Michael Daly Hawkins.\nFollow below for live updates.\nWall calls for court to vacate or limit injunction against ban\nThe Trump administration's attorney called on the three-judge panel to vacate or at a minimum substantially narrow the injunction put in place by a U.S. district court judge in Hawaii.\nJudge Gould asks if the court could affirm the injunction on statutory grounds\nKatyal says the court could do that.\nKatyal says Trump never disavowed his statements on Muslims\nHe said he was surprised that Wall said that the president had disavowed his initial comments.\n\"The truth is there is no such statement,\" Katyal said.\nHe began quoting statements Trump made on the campaign trail, beginning in December 2015 when he called for a \"total and complete shutdown\" of Muslims entering the U.S. He said that the press release issued at that time had been left on his campaign's website until it disappeared from the site last week before 4th Circuit Court arguments.\nNeal Katyal is the attorney arguing against the ban on behalf of Hawaii\nKatyal is the former acting solicitor general of the U.S. and serves as a partner at Hogan Lovells in Washington, D.C.\nJudges skeptical that order is a Muslim ban disguised by national security justifications\nJudge Gould asked Wall how a court can know whether the executive order is in fact a Muslim ban in the guise of national security justification.\nJudge Hawkins asked if the president ever disavowed his campaign statements in which he called for blocking all Muslims from entering the U.S.\n\"Yes, he has said everything things approaching that,\" Wall said, adding that they are detailed in amicus briefs. \"Over time, the president clarified that what he was talking about were Islamic terrorist groups and countries sponsoring them.\"\nThe ban has nothing to do with religion, Wall says\n\"The order on its face doesn't have anything to do with religion,\" Wall said.\nHe said that the executive order operates \"with respect to aliens abroad.\"\nJudge Paez calls the revised ban an \"extremely broad order\"\nJudge Paez said that Trump's executive order is \"extremely broad\" and it doesn't involve an individual one-off by a consular officer. Wall said, \"I don't know that it's an extremely broad order.\"\nPaez asked rhetorically how many nationals the ban would apply to in the corresponding countries. \"A large number,\" he said.\n\"We don't know yet,\" Wall said, \"Because we haven't been able to implement the order.\"\nWall argued that Congress and the Obama administration singled out the countries under the ban as having ties to terrorism and were removed from the visa waiver program.\nJeffrey Wall is the attorney arguing for the Trump administration\nWall, acting solicitor general, argued that the global injunction cannot stand for three reasons, which includes that the U.S. district court applied the wrong legal reason.\nEach side will get 30 minutes to present their arguments for and against the ban\n\"The court's very well aware of the importance of this case,\" Judge Gould said.\nGould added that he will allow for more time if need-be.",
    "label": 3
}