{
    "index": 486,
    "text": "Lawmakers slam reports Trump revealed classified intel to Russians\nShow Caption Hide Caption Bombshell report: Trump revealed intel to Russians A bombshell report by the Washington Post cites government officials who reportedly say the President discussed classified information with Russians. USA TODAY\nResponding to reports that President Trump revealed \"highly classified information\" to the Russian foreign minister and ambassador at the White House last week, lawmakers called the alleged disclosures “inexcusable” and “deeply disturbing.”\nThe Washington Post, citing current and former U.S. officials, reported that Trump provided Russian Foreign Minister Sergei Lavrov and Ambassador Sergey Kislyak classified intelligence that was so sensitive it had been withheld from allies – and under close hold within the U.S. government as well.\n\"To compromise a source is something that you just don't do,\" Senate Foreign Relations Committee Chairman Bob Corker, R-Tenn., said. \"That's why we keep the information that we get from intelligence sources so close...to prevent that from happening.\"\nAs the White House pushed back on the story and criticized the use of anonymous sources – \"the story that came out tonight, as reported, is false,\" insisted Lt. Gen. H.R. McMaster, the president's national security adviser – Democrats issued a flurry of statements denouncing Trump's reported actions.\nSenate Minority Leader Chuck Schumer, D-N.Y., said Trump owed the intelligence community, Americans and Congress \"a full explanation\" of what happened. \"If the report is true, it is very disturbing,\" he said in a statement. \"Revealing classified information at this level is extremely dangerous and puts at risk the lives of Americans and those who gather intelligence for our country.\"\nSen. Mark Warner, the ranking Democrat on the Senate Intelligence Committee said that if the news was true, it was \"a slap in the face to the intel community.\"\n\"Risking sources & methods is inexcusable, particularly with the Russians,\" tweeted Warner, whose panel is separately investigating a hacking campaign by the Russians to influence the 2016 election.\nOther Democrats are calling for action. The top Democrat on the House Foreign Affairs Committee, Rep. Eliot Engel of New York, said \"this certainly raises questions about whether the president recognizes the serious implications of disclosing such sensitive information to an adversary\" and called for Congress to establish an independent commission to investigate the reports.\nAnd Rep. Adam Schiff of California, the top Democrat on the House Intelligence Committee, insisted the administration and intelligence committee \"must immediately and fully brief\" his panel \"on what, if anything, was shared with Russian officials, and whether it could impact either our sensitive sources and methods, or our intelligence sharing relationships.\"\nNew Mexico's Sen. Martin Heinrich, a Democratic member of the Senate Intelligence Committee, sent out a biting remark on Twitter.\nProtip: Don’t give the Russians classified information. #Classified101 — Martin Heinrich (@MartinHeinrich) May 15, 2017\nDuring the meeting, Trump described details of an Islamic State threat related to using laptop computers on aircraft, the Post reported. Additionally, he revealed the city in the Islamic State's territory where the U.S. partner detected the threat – which could damage a critical source of intelligence on the terror group.\nAccording to the Post, the president appeared to boast of his knowledge of a looming threat. \"I get great intel,\" Trump said. \"I have people brief me on great intel every day.\"\nTrump and the United States reportedly did not have permission to share the information from the partner who provided the details. According to an official who spoke to the Post, the president \"revealed more information to the Russian ambassador than we share with our own allies.\" Senior White House officials apparently called the CIA and National Security Agency after the meeting to try to \"contain the damage.\"\nRead more:\nYet the Trump administration on Monday evening denied the report. \"There is nothing that the president takes more seriously than the security of the American people,\" McMaster said. \"The president and the foreign minister reviewed a range of common threats to our two countries including threats to civil aviation. At no time were intelligence sources or methods discussed. And the president did not disclose any military operations that were not already publicly known.\n\"Two other senior officials who were present, including the secretary of State, remember the meeting the same way and have said so. Their on- the-record accounts should outweigh those of anonymous sources. I was in the room – it didn't happen.\"\nIn Trump's meeting with Lavrov, added Secretary of State Rex Tillerson, \"a broad range of subjects were discussed, among which were common efforts and threats regarding counterterrorism. During that exchange, the nature of specific threats were discussed, but they did not discuss sources, methods or military operations.\"\nThe Post story, however, did not explicitly say that Trump disclosed sources and methods; it said Trump discussed information in a way in which sources and method could be deduced.\nThe White House denials did not appear to convince the Democratic National Committee, which said in a statement: \"Russia no longer has to spy on us to get information – they just ask President Trump and he spills the beans with highly classified information that jeopardizes our national security and hurts our relationships with allies.\"\nAnd back on Capitol Hill, Sen. Bob Casey, D-Pa., along with a spokesman for Senate Minority Leader Chuck Schumer, D-N.Y., both resurfaced comments from House Speaker Paul Ryan last year lamenting the danger of individuals who are \"extremely careless\" with classified information.\nDoes the President sharing classified info with Russia count, Mr. Speaker? 👇 https://t.co/jRRUf9a3O0 — Matt House (@mattwhouse) May 15, 2017\nRyan had sent letters to then-FBI director James Comey and then-national intelligence director James Clapper after the FBI closed its investigation into Hillary Clinton's use of a private email server when she was secretary of State. He requested that Comey release all unclassified findings in the Clinton investigation and that Clapper refrain from classified briefings with Clinton during the campaign, for fear information could be exposed – though Ryan said the classified briefings could resume if she was elected.\nDoug Andres, a spokesman for House Speaker Paul Ryan, R-Wis., said, “We have no way to know what was said, but protecting our nation's secrets is paramount. The speaker hopes for a full explanation of the facts from the administration.\"\nContributing: Heidi Przybyla",
    "label": 3
}