{
    "index": 216,
    "text": "(CNN) Of the 238 House Republicans, just 20 bucked their party leadership Thursday to vote against the American Health Care Act . (Zero Democrats crossed party lines to vote for the bill.)\nSo, who are these 20 GOPers -- and, more importantly, why did they vote against the much-touted GOP effort to repeal and replace Obamacare? They tend to be moderates from the Northeast and Midwest -- 11 of the 20 are from Pennsylvania (four), New Jersey (three), New York (two) and Ohio (two) -- who sit in very competitive districts. There are also a handful of outliers who opposed the bill for their own unique reasons.\nBelow I break down the reason why behind each of the 20 GOP \"no\" votes. (For how all 435 members voted on the AHCA, check this out.)\n): Biggs is a member of the House Freedom Caucus and believed the bill didn't go far enough in repealing Obamacare. \"As amended, the American Health Care Act (AHCA) would not be the clean repeal of Obamacare I promised and would not lower premiums to pre-ACA levels,\" he said in a statement explaining his \"no\" vote\nMike Coffman (CO-06): Coffman sits in a suburban swing district. Hillary Clinton won it with 50.2% in 2016 and President Barack Obama carried it with 51.6% in 2012.\nBarbara Comstock (VA-10): Comstock's northern Virginia district was carried by Clinton in 2016 with 52.2% and Comstock is a major 2018 target for Democrats.\nRyan Costello (PA-06): Clinton won Costello's suburban Philadelphia district by less than a point in 2016 after Mitt Romney carried it over Obama by 2.5 points in 2012. This has been a tossup district held by Republicans for quite some time.\nCharlie Dent (PA-15): Dent was one of the most outspoken moderates in opposition to the legislation. \"I believe this bill, in its current form, will lead to the loss of coverage and make insurance unaffordable for too many Americans, particularly for low-to-moderate income and older individuals,\" : Dent was one of the most outspoken moderates in opposition to the legislation. \"I believe this bill, in its current form, will lead to the loss of coverage and make insurance unaffordable for too many Americans, particularly for low-to-moderate income and older individuals,\" Dent told the Allentown Morning Call . Interestingly, Trump carried Dent's seat by almost 8 points.\nDan Donovan (NY-11): Donovan represents a Staten Island-based district Trump carried by nearly 10 points. But, : Donovan represents a Staten Island-based district Trump carried by nearly 10 points. But, in a statement , he said that his vote was purely local; he argued the legislation would impose a tax increase on New York City residents to help offset the tax burden elsewhere in the state.\nBrian Fitzpatrick (PA-08): This suburban north Philly district might be the most closely contested between the two parties over the last two presidential elections. Trump won it by .2 percentage points in 2016 and Romney won it by .1.\nJaime Herrera-Beutler (WA-03): Herrera-Beutler sits in a district Trump carried by 7 points. But she took issue with the changes being made to Medicaid by the bill. \"I'm disappointed that it appears my amendment to strengthen the Medicaid safety net for the kids who depend on it for their health care will not be considered,\" : Herrera-Beutler sits in a district Trump carried by 7 points. But she took issue with the changes being made to Medicaid by the bill. \"I'm disappointed that it appears my amendment to strengthen the Medicaid safety net for the kids who depend on it for their health care will not be considered,\" she said in a statement\nWill Hurd (TX-23): Clinton carried Hurd's sprawling West Texas district by more than three points. More than 7 in 10 residents of Hurd's district are Hispanic.\nWalter Jones Jr. (NC-03): Jones Jr. is a regular rebel against leadership's wishes. This vote was no exception.\nDave Joyce (OH-14): Trump carried Joyce's northeastern Ohio district by 12 points. But, in a statement, Joyce expressed concern with the possible premium hikes as a result of passing the AHCA. \"The idea that premiums could potentially skyrocket for people with pre-existing conditions and increase 3 to 5 times for people nearing retirement is something I find unacceptable,\" : Trump carried Joyce's northeastern Ohio district by 12 points. But, in a statement, Joyce expressed concern with the possible premium hikes as a result of passing the AHCA. \"The idea that premiums could potentially skyrocket for people with pre-existing conditions and increase 3 to 5 times for people nearing retirement is something I find unacceptable,\" he said on Facebook\nJohn Katko (NY-24): Clinton carried Katko's district by almost four points in 2016.\nLeonard Lance (NJ-07): Lance, like Dent, is a high profile moderate. He also represents a central New Jersey seat that Clinton won by a point in 2016.\nFrank LoBiondo (NJ-02): Trump carried LoBiondo's south Jersey district by almost 5 points. And LoBiondo has been in favor of repealing the ACA. But, this bill didn't do enough \"to address key and vital issues I have on the bill's impact on residents and businesses in South Jersey,\" : Trump carried LoBiondo's south Jersey district by almost 5 points. And LoBiondo has been in favor of repealing the ACA. But, this bill didn't do enough \"to address key and vital issues I have on the bill's impact on residents and businesses in South Jersey,\" he said\nTom Massie (KY-04): Massie, who aligns with fellow Kentuckian and libertarian-leaner Sen. Rand Paul, : Massie, who aligns with fellow Kentuckian and libertarian-leaner Sen. Rand Paul, said that the AHCA was \"worse than Obamacare.\"\nPat Meehan (PA-07): LIke Fitzpatrick and Costello, Meehan represents a swing suburban Philadelphia district. Clinton won it by 2.3 points in 2016.\nDave Reichert (WA-08): Reichert was undecided all the way up to the vote on Thursday. He voted \"no\" out of concern for cuts to Medicaid in the bill. \"I don't care. I have to do what I think is right,\" : Reichert was undecided all the way up to the vote on Thursday. He voted \"no\" out of concern for cuts to Medicaid in the bill. \"I don't care. I have to do what I think is right,\" Reichert told the Seattle Times of his vote , adding of the pressure he received from House leaders: \"What are they going to do? Shoot me? Stab me? I've been stabbed before.\" (Reichert was the sheriff of King County prior to his service in Congress.)",
    "label": 2
}