{
    "index": 737,
    "text": "Eric Trump must not be too familiar with his father’s Twitter feed.\nIn an interview with Ireland’s Independent newspaper, the son of President Donald Trump blasted people who are mean on Twitter:\n“No matter what side it is with, you are always going to get backlash. You are going to have a few people who have nothing better to do than to sit behind a computer and send a mean tweet. It’s unfortunate, but it’s the nature of the game.”\nTrump was responding to a question about golfer Rory McIlroy, who came under fire on social media after playing a round of golf with the president.\nTrump’s father, of course, is known for using Twitter as a platform to hurl insults. The New York Times has a list of 325 people, places and things Trump has insulted on Twitter since he declared his candidacy.\nEric Trump also complained that politics is “mean.”\n“Politics is a mean game,” Trump told the Independent. “I always said real estate is the most cut-throat industry in the world ― but it is nothing compared to some of these politicians.”\nEric Trump, son of President Donald Trump, complained about people who are mean on Twitter. AFP via Getty Images\nAdvertisement\nEric Trump isn’t the only member of the first family to express a thin awareness of Donald Trump’s persona on social media.\nBefore the election, Melania Trump said that if she were first lady, she would fight against cyberbullying as her cause, despite tweets from her husband such as these:\nArnold Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired by his bad (pathetic) ratings, not by me. Sad end to great show — Donald J. Trump (@realDonaldTrump) March 4, 2017\n.@JebBush today said he didn't want to be the front-runner, he would rather be where he is now, 2%. That is the talk of a loser, can't win! — Donald J. Trump (@realDonaldTrump) December 21, 2015\nAdvertisement\nHave a good chance to win Texas on Tuesday. Cruz is a nasty guy, not one Senate endorsement and, despite talk, gets nothing done. Loser! — Donald J. Trump (@realDonaldTrump) February 26, 2016\nHow low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy! — Donald J. Trump (@realDonaldTrump) March 4, 2017\nDopey @GeorgeWill, a big proponent of the Iraq War and other catastrophes, doesn’t like me very much. That means I win! — Donald J. Trump (@realDonaldTrump) November 19, 2015",
    "label": 2
}