{
    "index": 833,
    "text": "The Trump administration's move toward tougher enforcement of laws against illegal immigration demonstrated the biggest change in priorities during its first 100 days at the Homeland Security and Justice Departments.\nWhile the president's efforts to temporarily restrict immigration by executive order from a handful of predominately Muslim countries were blocked by the courts, the federal government moved ahead with changes in domestic immigration policy.\nTrump also succeeded in putting a new justice on the U.S. Supreme Court, though much of the credit for that accomplishment was shared with Senate Republicans — most notably, majority leader Mitch McConnell.\nRead: Rewriting the Rulebook: Trump's Chaotic First 100 Days\nFederal court rulings in Washington, Hawaii, and Maryland blocked Trump's first and second versions of an executive order to ban immigration for 90 days from a half dozen countries connected with terrorism. The cases are now on appeal, so it's likely enforcement will remain on hold for at least another few months.\nThe Justice Department began a new push urging local governments to notify immigration authorities when illegal immigrants are about to be released from local jails. In the strongest move to date, the administration notified nine local governments that they could lose some federal grant money unless they are more cooperative.\nAttorney General Jeff Sessions, in a clear break from the Obama administration, said the Justice Department would be less interested in opening civil rights investigations of local police departments.\n\"We need, so far as we can, to help police departments get better, not diminish their effectiveness. And I'm afraid we've done some of that,\" he said.\nRead: In Their Own Words: Experts on Donald Trump’s Presidency\nThe administration also changed its policy on transgender students. It rescinded guidance to the nation's schools issued by the Obama administration, which warned that failing to allow students to use the bathrooms matching their gender identity could cause them to lose federal funds.\nBecause of that turnaround, the U.S. Supreme Court dropped plans to hear a major legal showdown on transgender rights, and 13 states ended a lawsuit against the federal government over the earlier policy.\nThe Department of Homeland Security took the first steps toward building a wall on the southern border, awarding contracts for two prototypes to explore what the new segments should look like. And DHS abandoned the \"catch and release\" policy, which had allowed people caught illegally entering the country to be released with a date to appear in court.\nMultiple layers of steel walls, fences, razor wire and other barricades are viewed from the United States side of the of the US-Mexico border in San Ysidro, California on Jan. 26, 2017. David McNew / AFP - Getty Images file\nMost notably, Immigration and Customs Enforcement agents arrested about 30 percent more suspected illegal immigrants since January.\nMost were in a high priority category for removal, or deportation, because they had committed other crimes. But arrests of immigrants with no criminal records more than doubled.\nDespite a campaign pledge to end the Obama policy on so-called dreamers, people who came to the U.S. illegally as children, President Trump made it clear they will be allowed to stay.\nThey can \"rest easy,\" he told the Associated Press, because his administration is \"not after the Dreamers, we are after the criminals.\"",
    "label": 3
}