{
    "index": 367,
    "text": "An oil drilling site at a Westside golf course has flouted city rules by repeatedly installing new equipment without city approval, according to a recently released report.\nCommunity activists say that the reported violations are a symptom of a systemic problem for the city: its failure to adequately monitor drilling sites across Los Angeles.\nThe Rancho Park drill site sits on nearly two acres owned by the parks department and has operated there for more than half a century. Earlier this year, Los Angeles City Councilman Paul Koretz called for an investigation into the drilling site after a resident complained that a gas burner had been installed there without city approval.\nCity officials found that equipment had been repeatedly placed at the drilling site without city permission, including pipe supports, fire protection systems, electrical installations and five wastewater tanks that hold more than 5,000 gallons each, the report said.\nThe oil company had received a permit from the South Coast Air Quality Management District to operate the gas burner, but it was installed without obtaining city building department permits to ensure it was stable, according to the report.\nAdvertisement\nThe oil company also failed to seek approval from the planning department for the burner, a piece of equipment that has proved controversial elsewhere in the city. Last year, a city zoning official rejected plans by a different company to install an enclosed burner at a South Los Angeles drilling site, saying he was worried about possible emissions near homes.\nInstalling the Rancho Park gas burner could violate city rules because it represents “a change and expansion” of operations at the site, Planning Director Vincent Bertoni wrote in the report.\nOther state and local agencies detected additional violations at the Rancho Park site, including overdue testing for an injection well, according to the city report. After an inspection, the Los Angeles Fire Department also required the company to test its fire alarm and sprinkler systems and to clean up wastewater at the site.\nIn response, Hillcrest Beverly Oil Corp. issued a statement saying that the report had “inaccuracies and omissions” and had failed to include city permits and approved plans.\nThe company, an affiliate of E&B Natural Resources in Bakersfield, declined repeated requests to provide further details about what was missing or wrong in the report. Its spokeswoman, Amy Roth, said Hillcrest Beverly Oil would send a formal letter to the city expressing its concerns.\nRoth said the site is regularly inspected by the Air Quality Management District and other agencies. The new burner “reduces air emissions and increases safety in the surrounding areas, which is why we have not received complaints from residents, businesses, park users or schools,” Roth said in a statement.\nThe report has been referred to a City Council committee that is focused on planning issues. Bertoni has called on the company to turn in paperwork that would kick off a planning department review of the burner and other issues on the site. That process could ultimately lead to additional requirements for running the drilling site.\nUnder the lease for the Rancho Park drilling site, the company is required to adhere to city and state laws. If it fails to comply with the agreement, the parks department can terminate the lease after sending out a written notice. The parks department is still reviewing the violations and has not sent out that notice, spokeswoman Rose Watson said Monday.\nMichael Salman, a West Adams resident who alerted Koretz and other city officials to the burner at the Rancho Park site, said that the city report underscores fundamental problems with how L.A. oversees oil operations. The planning department should be required to do annual inspections to check whether sites are in line with city codes and conditions, he said.\n“The underlying problem is that oil operators don’t pay attention to the city code and city conditions,” Salman said, “because they know that for decades … the city has not been doing inspections.”\nWestside Neighborhood Council board member Colleen Mason Heller said that she was encouraged that the city was taking action but said the city needs to reexamine its enforcement at drilling sites across the city.\nRancho Park “is just the poster child,” she said.\nEnvironmental activists with the Stand-L.A. coalition, in turn, said the problems uncovered at the Rancho Park site were part of a “persistent pattern of safety violations by oil companies” that could only be addressed by eliminating oil and gas drilling near homes, schools and other sensitive sites. The group urged the city to devote the same attention to other urban sites.\nKoretz, who faced criticism over the Rancho Park site as he campaigned for reelection this year, said Los Angeles should explore whether to charge a fee to increase oversight of drilling sites.\n“I doubt that this site is particularly worse than any other site — it just happens to be one of the ones that came to our attention,” Koretz said. “We have to find some way to clean up how we deal with oil and gas sites in the city.”\nemily.alpert@latimes.com\nTwitter: @LATimesEmily",
    "label": 3
}