{
    "index": 364,
    "text": "A judge has delivered a humiliating new legal defeat to Los Angeles elected officials, striking down the city’s approval of a Hollywood Target shopping center for the second time in three years.\nTarget’s partially built, three-story structure has sat empty since 2014, when Los Angeles County Superior Court Judge Richard L. Fruin Jr. concluded that the City Council’s approval of the project violated planning rules. Council members responded two years later by approving new zoning for the site, but that vote drew a new legal challenge.\nLast week, Fruin ruled that the council’s do-over on the project also violated the law. City officials, he said, failed to properly examine the environmental effects of its new zoning mechanism on the larger neighborhood.\nThe decision means that Target, which first filed an application to build the project in 2008, will continue to be prohibited from finishing construction.\nA lawyer for the La Mirada Avenue Neighborhood Assn., which sued to stop the project, said Target should respond to the ruling by demolishing the structure and building a store that is no taller than 35 feet — considerably shorter than the current project — and in accordance with planning and zoning rules.\nAdvertisement\n“We think that would be the proper outcome,” said Robert P. Silverstein, the neighborhood group’s attorney. “Compliance with the law has always been the focus of this litigation.”\nKristy Welker, a Target spokeswoman, said company officials are disappointed with the decision and “evaluating next steps.”\nRob Wilcox, spokesman for City Atty. Mike Feuer, declined to say whether the city will appeal Fruin’s decision.\n“We are reviewing the ruling and will be advising our client accordingly,” he said in an email.\nCitizens Coalition Los Angeles, a second plaintiff, had also challenged the Target project.\nThe Target decision follows a string of legal setbacks for City Hall on real estate development. Last week, a different judge ruled that the council failed to comply with the state’s environmental law when it approved a Frank Gehry-designed mixed-use complex at Sunset and Crescent Heights boulevards.\nOver the last five years, judges have also struck down the city’s approval of Sunset and Gordon, a 299-unit apartment building, and the Millennium skyscraper project — both in Hollywood. In addition, a judge ordered the council to repeal its 2012 Hollywood Community Plan update, which sought to allow taller and more dense development along Hollywood’s transit corridors.\nPlanning officials are hoping for a new council vote on that plan later this year.\nCouncilman Mitch O’Farrell, who represents part of Hollywood said through a spokesman that he is disappointed and wants to see the project completed. A spokesman for Mayor Eric Garcetti said the mayor does not discuss ongoing legal matters.\nThe legal dispute over Target has centered, in part, on the rules governing the height of buildings near several Hollywood subway stations. The zoning for the Target site originally limited shopping centers to 35 feet, unless they incorporate housing.\nThe council voted in 2012 to allow Target to build a 74-foot-tall structure, saying the company would face an “unnecessary hardship” if it had to comply with the height rules.\nTarget’s lawyer said at one point that the company pursued a taller project at the request of Garcetti, who was then a councilman representing Hollywood, and community members. Garcetti pushed for the additional height to ensure that the project would have more amenities on the first floor.\nFruin said in his 2014 ruling that Target could have complied with the city’s height rules had it built an underground parking garage at a cost of at least $5 million. The judge ordered the city to invalidate the project’s building permits, halting construction.\nAfter that ruling, the council amended its zoning for the site, allowing Target to build up to 75 feet without constructing any housing.\nSilverstein, the La Mirada Avenue Neighborhood Assn.’s lawyer, said the city needed to conduct an environmental review of the change, arguing that other property owners in the area could seek the same zoning. Fruin agreed, saying the city did not examine the “foreseeable environmental effects” of having other developers in the neighborhood applying to build 75-foot-tall shopping centers.\n“New retail uses predictably will have traffic, noise, air pollution and [greenhouse gas] emission impacts,” he wrote.\nThe latest ruling dismayed Leron Gubler, president of the Hollywood Chamber of Commerce, who said the ruling would hurt low-income families in the neighborhood.\n“More than 250 permanent jobs have been in limbo,” he said. “The community needs those jobs and the shopping opportunities.”\nSilverstein said the project already would have been finished had Target followed the city’s rules.\ndavid.zahniser@latimes.com\nTwitter: @DavidZahniser\nALSO\nWhen developers strike deals with homeowner groups: ‘Hush money,’ or a way to defend L.A. neighborhoods?\nLos Angeles State Historic Park bridges past and present at grand opening celebration\n‘Grab the surf leash!’ Beachgoers frantically try to save woman attacked by shark at popular surf spot\nUPDATES:\n7:55 p.m.: This article was updated with a comment from a spokesperson for Councilman Mitch O’Farrell.\nThis article was originally published at 6:30 p.m.",
    "label": 3
}