{
    "index": 281,
    "text": "Washington (CNN) Two days after Donald Trump won the presidency, he came to visit the man he would replace at the White House. And, in that meeting, Barack Obama warned Trump about bringing Michael Flynn into his administration due to concerns about the retired general's ties to Russia.\nThe question now is why. Why, after being told by the outgoing president that Flynn was bad news -- in the sense that his name was all over the ongoing Justice Department investigation into Russia's attempts to hack the 2016 election -- did Trump ignore that advice within a week? And why has Trump continued to publicly defend Flynn in the face of repeated warnings -- from then acting Attorney General Sally Yates among others -- that his ties to Russian Ambassador Sergey Kislyak represented a major problem?\nI put that question to several current and former Trump officials.\n\"I wish I knew,\" responded one. The others chose not to respond at all. Which is telling. (Or maybe they are just extremely busy!)\nSo what could explain Trump's unwillingness to listen to Obama -- and others -- about Flynn? Here are a few theories:\n1. Dislike of Obama\nJUST WATCHED Spicer: It's true, Obama wasn't a fan of Flynn Replay More Videos ... MUST WATCH Spicer: It's true, Obama wasn't a fan of Flynn 00:51\nWhite House press secretary Sean Spicer suggested Monday that while Obama did tell Trump about his concerns, it was seen through the lens of Flynn's active role as a Trump surrogate and critic of Obama. \"President Obama made it known that he wasn't a fan of General Flynn,\" Spicer said Monday. He added that if Obama felt so strongly about Flynn then his administration should not have approved his security clearance in April 2016.\nRELATED: The many paths from Trump to Russia\nThere's no question that Trump, for all his insistence of how great he and Obama got along in their Nov. 10 meeting, viewed his election as a rejection of Obama's eight years in office. Taking Obama's advice on who to pick as one of his closest advisers would not be the sort of thing Trump would do. There's no question that Trump, for all his insistence of how great he and Obama got along in their Nov. 10 meeting, viewed his election as a rejection of Obama's eight years in office. Taking Obama's advice on who to pick as one of his closest advisers would not be the sort of thing Trump would do.\n2. Loyalty\nTrump prizes loyalty above all else. And no one was more loyal to him than Flynn. Not only was Flynn an early endorser of Trump, he was one of his most aggressive and effective surrogates. By the end of the campaign, Flynn was Trump's de facto hype man/lead introducer at rallies.\nTrump doesn't forget that sort of loyalty. And he wants to reward it.\n3. Trusts his own judgment\nTrump, as businessman and now a politician, believes that his gut is, in every situation, right. The campaign he ran, to his mind, was an affirmation of his gut being smarter and better than all of the advice the so-called professionals were offering. After all, they said he had no chance to win!\nGiven that, why listen to all the voices telling him to get as far away from Flynn as possible? Why not, on the other hand, embrace Flynn as a symbol of the very outsider movement that elected him in the first place?\nWhile it's not clear exactly what motivated Trump to ignore all sorts of advice -- from President Obama on down -- about Flynn, it's very likely we won't ever know the real reason. Trump is not one to admit mistakes or explain himself. And he -- and his White House -- appear to be bunkered in when it comes to Flynn.",
    "label": 2
}