{
    "index": 84,
    "text": "\"We're keeping our word,\" Ryan told Stephanopoulos in an exclusive interview.\n— -- House Speaker Paul Ryan said he isn't worried about the possibility of Republicans losing congressional seats in the 2018 midterm elections in a voter backlash to the bill to replace the Affordable Care Act.\n\"We're keeping our word\" on repealing Obamacare, Ryan told ABC News Chief Anchor George Stephanopoulos in an exclusive interview on \"This Week\" Sunday.\n\"People expect their elected leaders, if they run and campaign on doing something, they expect them to do that. And that's what we're doing.\"\nIn contrast, the House's Democratic leader, Nancy Pelosi, told her Republican colleagues ahead of the vote on the bill Thursday that approving the legislation would put their seats at risk.\n\"You have every provision of this bill tattooed on your forehead. You will glow in the dark on this one,\" Pelosi said. \"So don't walk the plank.\"\nThe GOP bill, the American Health Care Act, narrowly passed the House on Thursday and now heads to the Senate. Some senators have signaled that they plan to start from scratch in writing a new health care bill.\nIn response to the House vote, Cook Political Report changed its projections on 20 House elections in 2018 in favor of Democrats, saying passage of the American Health Care Act \"guarantees Democrats will have at least one major on-the-record vote to exploit in the next elections.\"\n“House Republicans' willingness to spend political capital on a proposal that garnered the support of just 17 percent of the public in a March Quinnipiac poll is consistent with past scenarios that have generated a midterm wave,\" David Wasserman wrote for the political report.\nBut Ryan said it was necessary to replace Obamacare which he said is failing.\n\"Health care is a complicated and very emotional personal issue. And we completely understand that,\" Ryan said. \"The system is failing. We're stepping in front of it and rescuing people from a collapsing system.\"",
    "label": 2
}