{
    "index": 378,
    "text": "The Metropolitan Transportation Authority has seven committees of elected officials that debate issues as high-profile as rail construction budgets, and as obscure as the amount of water needed to wash 2,248 buses.\nWhat doesn’t exist is a panel that focuses on what it’s like to take transit in Los Angeles County.\nThat will change this summer, with a new directive from Los Angeles Mayor Eric Garcetti, who is also a Metro director. During his State of the City address Thursday, Garcetti announced the committee, saying taking Metro “shouldn’t be a burden — it should be a convenience.”\n“Positively or negatively, every single thing Metro does affects the passenger experience,” said Los Angeles City Councilman and Metro director Mike Bonin, who will run the group. “But it’s not often the primary prism through which a decision is made.”\nGarcetti will begin his second term as Metro chair in July. The committee will start meeting after that. Here’s what they may discuss:\nAdvertisement\nSpending an influx of cash\nLater this year, Metro will start receiving revenue from Measure M, a sales tax increase for transportation that county voters approved last year. The tax is expected to generate $860 million in 2018, and more than $120 billion over its first four decades.\nMore than half of that revenue is already earmarked for highway projects and new bus and rail lines that will dramatically expand the size of the region’s transit network.\nAn additional 27% of the revenue — or $232 million, in 2018 — will go toward transit service, which could influence the number of buses and trains, and how often they run. An additional 2% will be spent on improvements for pedestrians and cyclists.\nThe committee could weigh in to make sure sure that county voters’ multibillion-dollar investment is as user-friendly as possible, Bonin said.\nImproving Metro for current riders\nMore than three-quarters of Metro riders do not have access to a car. A key goal of the committee will be making transit service cleaner, safer and more reliable for those transit-dependent passengers.\nService complaints are one reason Metro ridership has fallen in recent years.\nIn a Metro survey of more than 2,000 former passengers, more than six in 10 respondents said they stopped taking transit because it was slow, infrequent, unreliable or difficult to access.\nTwenty-nine percent stopped riding because they felt unsafe or uncomfortable.\nThe committee will also focus on making transit feel more comfortable, including nudging cities to add more bus shelters (or upgrade the ones they already have) and to improve sidewalks and bike lanes near stations, Bonin said.\nAttracting new customers\nWhen it comes to commuting, driving still dominates Los Angeles County. More than four in five residents get to work in the car, while 7% take a bus or train, according to census data.\nMetro chief executive Phil Washington has said he wants to triple the rate of transit riders. That ambitious goal will require attracting and retaining new customers at a much faster rate than the population grows.\nBonin said the committee will explore ways to boost ridership, noting that “there’s still a lot that we don’t know about why people with the option of using transit don’t choose transit.”\nReaching riders in new ways\n“I want it to be very much about feedback, and input,” Bonin said. “I don’t want that to mean people have to come down to MTA headquarters. I want to get creative about how we hear from people.”\nOne idea, he said, would be to hold some meetings at rush hour at a transit station.\nThat strategy could address one common criticism of Metro’s public process: Monthly meetings start at 9 a.m., and are always downtown, meaning many working people can’t attend.\nWhat do you think?\nIf you’re a Metro rider, what improvements do you want to see during your commute?\nIf you don’t take transit, why not? What would make you change your mind?\nExplain in the comments section, or reach out to transportation reporter Laura Nelson on Twitter or via email.\nlaura.nelson@latimes.com\nFor more transportation news, follow @laura_nelson on Twitter.\nALSO\nMetro is eliminating free parking at the San Fernando Valley’s two Red Line stations\nThe number of pedestrians, cyclists and drivers killed in L.A. traffic rose sharply in 2016\nL.A. might start citing motorists again for parking on city parkways",
    "label": 3
}