{
    "index": 469,
    "text": "Trump's immigration travel ban faces familiar foe in appeals courts: Trump\nShow Caption Hide Caption High-stakes legal battle as Trump's travel ban returns to court President Donald Trump's travel ban is in court this week. Elizabeth Keatinge (@elizkeatinge) has more. Buzz60\nWASHINGTON -- President Trump's second travel ban targeting immigrants from six predominantly Muslim countries begins a new round of federal court hearings Monday battling a familiar Achilles' heel: Candidate Trump.\nFrom Richmond, Va., to Seattle, Wash., federal appeals courts with a majority of judges nominated by Democratic presidents will hear government lawyers defend the revised ban against immigrants and refugees as Trump's national security prerogative.\nCivil liberties and immigrants' rights groups will contend that the new executive order continues to discriminate against Muslims based on their religion, a violation of the First Amendment's establishment clause -- and they will use Trump's words from the campaign trail as Exhibit A.\nIt was still 2015 when Trump -- before any votes had been cast in primaries and caucuses — called for \"a total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what is going on.\"\nMore: Refugee admissions plummet under Trump\nThose and subsequent comments by Trump and his associates have been used by challengers to prove that regardless of other reasons, the travel ban represents an unconstitutional violation of religious rights.\nBut unlike the first round of court battles in February, which sent the White House back to the drawing board to draft a new executive order, administration officials and their allies have reason to believe they are on firmer legal ground now.\nTrump issues new travel ban on six majority Muslim countries The president's previous executive order on immigration was suspended by federal judges. Time\nTravel ban 2.0 exempts thousands of foreign nationals who hold valid visas or green cards. It eliminates Iraq from the original list of affected countries, leaving Iran, Libya, Somalis, Sudan, Syria and Yemen. It lasts for 90 days, not indefinitely, as had been the case for Syria. It contains no preference for religious minorities, which had favored Christians. And it includes a waiver process for those claiming undue hardship.\n\"On its face, it doesn't target Muslims,\" says Christopher Hajec, litigation director for the conservative Immigration Reform Law Institute. \"The political branches of our government have the sovereign right to protect the country.\"\nTRUMP V. TRUMP\nChallengers say targeting Muslims is exactly what the travel ban does, and they cite Trump's words as proof.\n\"President Trump publicly committed himself to an indefensible goal: banning Muslims from coming to the United States,\" the American Civil Liberties Union and National Immigration Law Center argue in court papers. \"The president refused to repudiate that goal on multiple occasions, including after he was elected, and he continues to advertise it to this day on his own website.\"\nKaren Tumlin, NILC's legal director, says that violates the Constitution's ban on government establishment of religion and gives Muslim Americans \"a constant feeling that the highest office in the land is disparaging their religious choice.\"\nRead more:\nThe government insists the impetus for both versions of the travel ban is the same: national security. Every president for the past three decades has temporarily suspended entry of some aliens, it says. Near the end of the Obama administration, it notes, immigrants from the same six nations were blocked temporarily under the visa waiver program because of concerns about terrorism.\nThat argument didn't work the first time around in February. A federal district court judge in Washington State and a three-judge panel of the U.S. Court of Appeals for the 9th Circuit stopped the ban in its tracks -- after a chaotic first few days at international airports and a round of visa cancellations by the State Department.\nVersion 2.0 didn't fare much better in March. This time, federal judges in Hawaii and Maryland got in the way, just as the ban was about to go into effect. In Hawaii, Judge Derrick Watson cited \"significant and unrebutted evidence of religious animus\" toward Muslims. In Maryland, Judge Theodore Chuang said the \"history of public statements\" indicated the purpose was \"the realization of the long-envisioned Muslim ban.”\nThomas Lee, an international law professor at Fordham University School of Law, says the second executive order stands a better chance of being upheld but remains burdened by the earlier anti-Muslim rhetoric.\n\"They can’t completely disavow the past statements,\" Lee says. \"You can't put that genie back in the bottle.\"\nLAST STOP: SUPREME COURT?\nThe government and conservative interest groups backing it say statements Trump made when he was not president are largely irrelevant. \"Even in the domestic setting, courts judge the legitimacy of a law by what it says and does, and occasionally by the official context that surrounds it — not by what supposedly lies in the hearts of its drafters,\" the government's brief says.\nThat may not be enough to convince the judges hearing the cases on Monday in Richmond and the following week in Seattle. Both courts are among the most liberal in the country.\nThe Richmond hearing will be held in front of the entire 15-member U.S. Court of Appeals for the 4th Circuit, which is extremely unusual. Appeals court cases usually go before three-judge panels; the full court only rarely agrees to hear cases even after a panel rules.\n“It’s been more than half a century since the court has done it,” Tumlin says. “It’s a bit of a legal unicorn. You don’t get this very often.”\nIf both the 4th and 9th Circuit appeals courts rule against Trump, he will get one final chance if the Supreme Court agrees to weigh in. The high court, now at full strength with the addition of Trump's nominee, conservative Justice Neil Gorsuch, has divided closely in the past on issues involving immigration.\nLast June, it deadlocked 4-4 over President Barack Obama's effort to protect more than 4 million undocumented immigrants from deportation and allow them to seek work permits. The tie vote left a lower court ruling against the program intact.\nBut the justices often defer to the president and executive branch on issues involving national security.\n“If I were a betting man,\" Lee says, \"I would bet that the government wins.”",
    "label": 3
}