{
    "index": 637,
    "text": "NEW You can now listen to Fox News articles!\nEvery administration is divided by policy battles as the president and his aides hammer out what they want to do and how they can push it through.\nBut it’s rare that this plays out so publicly.\nAnd part of the reason is that the Trump White House is filled with celebrities—not just the former reality TV star but a collection of advisers who have become household names.\nKellyanne. Bannon. Spicer. Jared. Ivanka. Reince.\nA number of them have their own “SNL” characters: Alec Baldwin, Melissa McCarthy and whoever plays that Grim Reaper guy. They aren’t just names in a newspaper.\nJust yesterday, the Washington Post ran a story headlined “Top Trump Advisers At Odds Over Paris Climate Deal.” Jared Kushner and Ivanka Trump are “considered supportive of the deal.”\nThe Post published a second piece: “On Russia, Trump and His Top National Security Aides Seem to Be At Odds.”\nNikki Haley, Rex Tillerson, H.R. McMaster and Mike Pompeo are much tougher in their rhetoric toward the Putin regime than is Donald Trump.\nBut the key to why we follow this internecine warfare so closely may be reflected in this Politico piece on how senior Trump aides have become famous in their own right—not just famous-for-Washington, but actual television stars.\nKellyanne Conway is swarmed by selfie-seekers everywhere she goes.\nSean Spicer draws about 3 million viewers for his daily briefings, and sometimes more than that. A Politico/Morning Consult poll put his name recognition at over 60 percent—the question isn’t usually asked about White House press secretaries.\nSteve Bannon and Reince Priebus have both been subjected to waves of speculative stories about whether they are losing influence or on their way out—which have mostly overblown or just wrong.\nAnd The Family makes news with every skirmish or skiing vacation.\nPolitico suggests that Trump orchestrated all this so that his White House would indeed resemble a television series. I rather doubt that. It may be driven more by the intense media interest in all things Trump, with a reflected spotlight on those around him.\nIn the last administration, how much did journalists really care whether David Axelrod, Valerie Jarrett and Robert Gibbs were getting along? Or Andy Card, Karl Rove and Ari Fleischer? After an initial period, the press briefings were rarely carried live.\nOf course, we didn’t have a president who made news with virtually every tweet.\nWhether top White House aides and Cabinet officers are clashing over policy initiatives is definitely news, if not the stuff of \"The Apprentice.\"\nBut at a time when even the courtiers in Trump’s royal court are boldfaced names, there is a soap-opera quality to the coverage.",
    "label": 2
}