{
    "index": 647,
    "text": "NEW You can now listen to Fox News articles!\nThe Trump administration is weighing the possibility of imposing additional sanctions on North Korea if the rogue nation continues to fire missiles or conducts its sixth nuclear test.\n“We are exploring a new range of diplomatic, security, and economic measures in response to the North Korean regime's continued provocations. North Korea must understand that the only path to a secure, economically-prosperous future is to abandon its development of nuclear weapons, ballistic missiles, and other weapons of mass destruction,” an administration official told Fox Business Network.\nAmong the sanctions under consideration reportedly are an oil embargo, a ban on North Korea's national airline Air Koryo, and a crackdown on companies or individuals who do business with North Korea or lend financial support to its nuclear proliferation program.\n“There’s a whole host of things that are possible, all the way up to what’s essentially a trade quarantine on North Korea,” an administration official told Reuters news agency, which was first to report potential new sanctions.\nTensions in the Korean Peninsula are increasingly on edge this week as North Korea prepares to celebrate the birthday of Kim Il-sung, its founding father, on Saturday.\nThe anniversary has been marked in past years by military parades and displays of its weapons, including in 2016 when it tested a new intermediate-range missile.\nOn Thursday, China’s foreign ministry issued a statement after the call asserting President Xi believes the North Korea “issue” can be “solved through peaceful means and is ready to maintain communication and coordination with the United States on the issue.”\nPresident Trump tweeted he has “great confidence that China will properly deal with North Korea” but, he added on Thursday morning, “if they are unable to do so, the U.S., with its allies, will! U.S.A.”\nSpeaking at an afternoon event at the White House, Trump said frankly, \"North Korea is a problem, the problem will be taken care of.\"\nState Department spokesman Mark Toner also said during a Thursday briefing that the administration remains concerned about North Korea.\nAlthough he did not offer details about Vice President Pence's upcoming trip to Asia, he reaffirmed the U.S. commitment to its allies. He said a message will be sent to North Korea that the \"steadfast, ironclad support\" for Japan and South Korea remains \"absolute.\"\nHow to deal with Pyongyang’s provocations actions continue to factor largely in talks between the U.S. and China.\n“Had a very good call last night with the President of China concerning the menace of North Korea,” Trump tweeted Wednesday.\nJust last month the administration opted for non-military punitive measures in response to recent missile launches.\nIn response to Pyongyang’s ongoing development of nuclear weapons and violations of United Nations resolutions, the Treasury Department sanctioned 11 North Koreans and one North Korean coal company for providing financial support to North Korea.\n“Today’s sanctions are aimed at disrupting the networks and methods that the Government of North Korea employs to fund its unlawful nuclear, ballistic missile, and proliferation programs,” said Secretary of the Treasury Steve Mnuchin in a March 31 statement.\nBut the U.S. decision to launch missiles on a Syrian military airbase last week -- and most recently to drop the military's largest non-nuclear bomb on an ISIS target in Afghanistan -- could be seen as sending a message to Pyongyang and its allies.\nAfter the April 5 firing of a ballistic missile into the Sea of Japan, the Chinese government issued an order sending several ships carrying coal back to North Korea.\nIn February, China banned all imports of coal from North Korea after it tested a new intermediate-range missile.\nWhile Chinese imports of coal declined 51.6 percent in the first three months of 2017 compared with 2016, Beijing retains strong trade ties with Pyongyang.\nAccording to data released by China on Thursday, overall trade between the nations has increased 37.4 percent in the first quarter of 2017.\nTrump this week ordered the USS Carl Vinson aircraft carrier group toward the Sea of Japan, but Pentagon officials assert it was diverted out of prudence, not because of a “specific reason” or event.\n“[The USS Vinson] operates freely up and down the Pacific, and she's just on her way up there because that's where we thought it was most prudent to have her at this time. There's not a specific demand signal or specific reason why we're sending her up there,” Secretary of Defense Jim Mattis told reporters on Tuesday.\nFox Business Network's Blake Burman contributed to this report.",
    "label": 3
}