{
    "index": 370,
    "text": "The union that represents Los Angeles police officers launched a broadside against Mayor Eric Garcetti’s budget on Thursday, warning that the spending plan will divert funds away from neighborhood patrols and to the policing of Metro buses and trains.\nGarcetti’s budget proposal for 2017-18 calls for $121 million for sworn-officer overtime, up from the $90 million planned in the current year. But about a third of the money would go to patrol the county’s Metropolitan Transportation Authority, which signed a contract with the Los Angeles Police Department earlier this year.\nFor the record: A previous version of this article misspelled the last name of City Administrative Officer Rich Llewellyn as Llewelyn.\nIn a letter to the City Council, the Los Angeles Police Protective League said the reduction in overtime hours for non-Metro duties would leave the LAPD with fewer officers to respond to neighborhood-level crime. Union leaders contend the shift would also increase police response times and leave some non-emergency calls unanswered altogether.\n“This budget is a sneaky and disingenuous affront to every resident that wants safer neighborhoods, swifter response times and more community policing,” said union board member Robert Harris, appearing Thursday before the council’s Budget and Finance Committee, which is reviewing Garcetti’s spending plan.\nFor months, the police union has been pressuring city leaders to take action with what league officials believe is one of the most pressing issues facing the city: how officers are deployed.\nAdvertisement\nThe league contends there aren’t enough officers patrolling city streets, forcing cops to rush from call to call, causing response times to creep higher and limiting the quality of interactions they can have with residents.\nNow, union leaders are threatening to sue over Garcetti’s spending plan, saying it violates the terms of the league’s contract, which guarantees a minimum $100 million of sworn overtime in the coming fiscal year. That overtime was supposed to go to city patrols, not Metro duties, league officials said.\nCity Administrative Officer Rich Llewellyn, the city’s top budget advisor, said the spending plan complies with the union contract. Meanwhile, Garcetti spokesman George Kivork defended the plan, saying it will increase overall LAPD overtime spending and put more officers on the street.\n“That’s why Mayor Garcetti led the push to secure LAPD’s security services contract with Metro, which will put 150 additional officers on the bus and rail lines in our communities across the city every day,” he said in a statement.\nDespite those reassurances, Police Chief Charlie Beck acknowledged that Garcetti’s budget would pare back non-Metro officer overtime by $10 million in the coming year — a reduction of 11%, or 164,000 hours.\n“We had hoped there would be an increased allotment of overtime,” Beck said, ”but we also realize the fiscal realities of the city.”\nBeck said the reduction in non-Metro overtime pay would likely force the city to expand its practice of “banking” overtime pay — assigning officers to work overtime, but delaying payment for those hours potentially years into the future, and at a more expensive rate.\nThat practice, described by some officials as putting LAPD overtime on “the city’s credit card,” could occur in May 2018 if funding is not increased, Beck said.\n“That’s something the council has to think about — whether you’re willing to incur that debt,” he said.\nThe LAPD relied heavily on banking hours during the recession, racking up tens of millions of dollars in unpaid employee costs. Although the department has paid off some of those obligations, Beck said, resuming the practice could push the overtime bank past $100 million next year.\nCouncilman Mitch Englander voiced dismay at that idea that the city would again delay payment to its officers into the future. Garcetti deputy chief of staff Matt Szabo argued that the overtime budget was one of several difficult decisions made by the mayor as officials worked to close a budget gap of $263 million.\n“We understand that it’s not the most ideal situation,” Szabo told Englander. “But the entire budget presented a less than ideal situation. So we had to make choices.”\nMetro’s board voted in February to award the LAPD a five-year, $369-million contract for policing services. Garcetti had pushed for that change, which shifts law enforcement duties for more than half the bus and rail system from the county sheriff to the Los Angeles and Long Beach police departments.\nL.A.’s police union gave its support to the LAPD’s Metro contract. But on Thursday, league officials said they would not have done so had they known that overtime hours would be cut for non-transit duties in Los Angeles.\n“You have to remember, when everybody went to advocate for the MTA contract, the deal was, this will not impact ... our regular day-to-day policing,” said league spokesman Dustin DeRollo. “And that’s what’s going to happen.”\nBeck described the Metro contract as “really important” to overall public safety. Officers will respond more quickly to transit-related crimes, he said, instead of relying on another agency.\n“It puts Los Angeles police officers where they belong — on the streets of Los Angeles,” he said.\nTimes staff writer Laura J. Nelson contributed to this report.\ndavid.zahniser@latimes.com\nTwitter: @DavidZahniser\nkate.mather@latimes.com\nTwitter: @katemather",
    "label": 2
}