{
    "index": 485,
    "text": "5 unanswered questions from latest Trump-Russia intelligence leak\nShow Caption Hide Caption Bombshell report: Trump revealed intel to Russians A bombshell report by the Washington Post cites government officials who reportedly say the President discussed classified information with Russians. USA TODAY\nWASHINGTON — Reports that President Trump shared top secret intelligence about Islamic State terror threats with Russian diplomats in the Oval Office last week led to quick denials from the White House Monday.\nBut the details of the Washington Post report and the White House explanations leave many unanswered questions, including:\nWhat is the White House denying?\nSeveral senior administration officials have denied the Washington Post report, calling it \"false.\" But the White House is rebutting points that weren't reported in the story. National Security Adviser H.R. McMaster said the president did not reveal sources and methods.\nBut the Post did not allege he did. According to the Post, Trump \"did not reveal the specific intelligence-gathering method, but he described how the Islamic State was pursuing elements of a specific plot and how much harm such an attack could cause under varying circumstances.\" Specifically, according to the Post's anonymous sources, Trump revealed the Islamic State-controlled city where the plot was first detected — information that the Russians could use to piece together information about possible sources.\nWashington Post reporter Greg Miller, who broke the story with colleague Greg Jaffe, accused the White House of \"playing word games\" in its denial.\nWhy did he do it?\nThere's no question that the president has the legal authority to divulge classified information — even to rivals and adversaries. What complicates this incident is that the information wasn't his to give: The information came from an unnamed U.S. ally.\nMcMaster said the exchange came as Trump and the Russian diplomats \"reviewed a range of common threats to our two countries.\" He did not say that the Russians offered any intelligence in return.\nAnd the Washington Post report suggests that Trump's motive was to boast. “I get great intel. I have people brief me on great intel every day,” Trump told the Russians, according to an official who spoke to the Post.\nWho leaked?\nAs with past controversies, the White House will likely fight back by deploring the leaks of classified information about a sensitive Oval Office meeting.\nAnd there's no shortage of possible suspects in the leaks. Trump has had a strained relationship with the intelligence community. He has accused agencies of illegally spying on him during the campaign and he fired the FBI director the night before the Oval Office meeting with the Russians.\nThe antagonism between Trump and the intelligence community was laid bare over the weekend, when former Director of National Intelligence James Clapper said U.S. institutions were \"under assault\" from Trump.\nAre the conversations recorded?\nThe report is likely to put even more pressure on the White House to confirm or deny the existence of Oval Office tapes. That issue first exploded last week when Trump tweeted that James Comey — the FBI director he had just fired — \"better hope that there are no 'tapes' of our conversations.\" But since then, the White House has refused to discuss whether those tapes exist, even as members of Congress have demanded that they be preserved as evidence in investigations into the growing investigations into Russian interference during the 2016 presidential election.\nThe Washington Post reported that there was a transcript of the meeting, but those can be compiled from stenographers and National Security Council note-takers without the use of an audio recording.\nWhat will the diplomatic consequences be?\nThe Washington Post did not identify the third country that provided the intelligence to the United States. But it's entirely possible that Trump could meet with that country on his upcoming foreign trip.\nIn Saudi Arabia on Saturday, he's expected to meet with the Persian Gulf nations in the Gulf Cooperation Council. He'll then travel to Israel next week, followed by meetings with NATO allies in Brussels, the Group of Seven in Sicily.",
    "label": 2
}