{
    "index": 368,
    "text": "Jackie Broxton remembers the day the riots swept through her city, when the only way to get back to her car after church was to brave the flames and plumes of smoke that had engulfed the surrounding streets of South L.A.\nShe needed to get her daughter home to Ladera Heights, and for a moment she thought she would have to walk from the First African Methodist Episcopal Church down rubble-ridden West Adams Boulevard. Luckily, a fellow parishioner offered to drive her around the corner.\n“You came out of church with a sense of hope, but you got outside and it was chaos,” she said.\nBroxton, 69, was among about 100 others who gathered across the street from the church at the Allen House gardens Saturday afternoon to mark the 25th anniversary of the 1992 riots. City officials and members of the African American and Korean communities gathered at the home of the oldest black congregation in L.A. to promote a single message: unity.\n“If we don’t find a way to work together, it could happen again,” Broxton said.\nAdvertisement\nKorean buk drums are played as the Rev. J. Edgar Boyd, right, of First AME Church waits to enter with his wife, Florence Miles-Boyd, and L.A. City Council President Herb Wesson, left. (Brian van der Brug / Los Angeles Times)\nLeaders from both communities pledged to work together in what they described as a special day — the event marked the first time the two groups came together to commemorate the riots, said Laura Jeon, president of the Korean American Federation of Los Angeles.\n“Twenty-five years ago, Koreatown was in chaos, its buildings charred and its community in ruins,” Jeon told the crowd. “If the Korean community and the African American community had been communicating back in 1992, the pain, agony, anger felt by both communities might have been avoided.”\nThe riots are considered the “greatest injury and tragedy to the Korean community” in the history of Korean immigration, she added.\nThe event was among many in a week recalling the riots, which left 63 people dead, another 2,000 people injured and roughly $1 billion in property damage across the city.\nThe L.A. riots was not a black-Korean issue. It was a poverty issue; it was an issue of language barriers. — Los Angeles City Councilman David Ryu\nIn an unscheduled moment Saturday at another event at a Koreatown church, Los Angeles City Councilman David Ryu enthusiastically dragged a man by his arm up to the stage.\nRyu, the first Korean American to serve on the council, recounted how he and the man, Nathan Redfern, had worked together more than 20 years ago in the years following the riots. Ryu, then a fresh college graduate, and Redfern, a former Crips gang member, worked together at a Koreatown nonprofit’s dispute resolution center.\nRyu recalled how the two men would go out to businesses in East and South L.A. to help resolve conflicts between Korean store owners and their customers, defusing the types of tense situations that led to the riots.\nLater, they worked on a citizenship project, Ryu teaching classes in English as a second language and Redfern giving mock citizenship exams at the Korean American Coalition, the councilman said.\n“We used to go out together, arm in arm,” Ryu said at the event organized by the Korean Churches for Community Development. “The L.A. riots was not a black-Korean issue. It was a poverty issue; it was an issue of language barriers.”\nThe day’s program included a joint choir performance of Korean, black and Latino groups singing “We Shall Overcome.” Congressional candidate Robert Lee Ahn, former L.A. Mayor Antonio Villaraigosa and state Treasurer John Chiang — the latter two poised for the governor’s race — also made an appearance.\nGrace Oh, right, chats with minister Barbara Brooks. (Brian van der Brug / Los Angeles Times)\nOn the afternoon of April 29, 1992, a jury in Ventura County acquitted four white Los Angeles police officers in the beating of Rodney King, a black motorist, after a high-speed pursuit. The incident, caught on amateur videotape, had sparked national debate about police brutality and racial injustice. The verdict stunned L.A., where angry crowds gathered on street corners across the city.\nThe flashpoint was a single intersection in South L.A. — Florence and Normandie avenues — but it was a scene eerily repeated in many parts of the city in the hours that followed.\nMayor Tom Bradley called a local state of emergency later that day, and Gov. Pete Wilson, at Bradley’s request, ordered the National Guard to activate 2,000 reserve soldiers.\nThe riots had multiple causes beyond the not-guilty verdicts — including grinding poverty and hopelessness in South L.A., and a police force with a reputation for treating minorities poorly.\nIn some ways we are much better and stronger, more resilient. We’re not cocky anymore; we know what our faults are. — Los Angeles Mayor Eric Garcetti\nCity officials who spoke at the First AME Church event Saturday lauded the progress Los Angeles institutions have made since 1992, including a more diverse police force and a City Council that is more representative of the city it serves.\n“In some ways we are much better and stronger, more resilient,” Los Angeles Mayor Eric Garcetti told the audience. “We’re not cocky anymore; we know what our faults are.”\n“We still have a long way to go,” he added.\nStill, he said, Los Angeles’ progress in the last 25 years points to the city’s resilience.\n“We survive,” Garcetti said. “We always do get through the most difficult of days.”\nSome at the commemoration acknowledged that the relationship between African Americans and Korean Americans in South L.A. has gotten better but still needs work.\nMeanwhile, the Latino community keeps growing, forming the majority in most of the area’s neighborhoods. Although there’s black and Latino tension, diversity is a strength, they said.\nThe Rev. Barbara Brooks, associate minister at First AME Church, said remembering the civil unrest together serves as a vehicle to better relations and fight “complacency.”\n“It’s like when you have a goal of losing 50 pounds, and when you reach your goal you say, ‘OK, I don’t have to do to do this anymore,’ ” Brooks said. “But to maintain what you’ve lost, you’ve got to do something different.”\nFor the African American and Korean communities, Brooks said, that “something different” is teamwork.\nKieja Kim, president of the Victor Valley Korean American Assn., wasn’t in Los Angeles during the riots, but she came Saturday to show solidarity and support.\n“Community relationships are important,” said Kim, 60. “We aren’t different. Black, Korean, Asian — we’re human.”\nAs the event came to a close following afternoon prayers, the crowd made their way inside, where they sat down for that other common symbol of unity: breaking bread.\nsarah.parvini@latimes.com\nTwitter: @sarahparvini\nvictoria.kim@latimes.com\nTwitter: @vicjkim",
    "label": 3
}