{
    "index": 104,
    "text": "On the 100th day of his presidency, President Donald Trump has already solidified his place in history as one of the more unconventional presidents, using social media unlike any of his Oval Office predecessors.\nBut while the tweeter-in-chief takes to social media to provide his own running commentary on hot button topics facing the American public, data findings by SocialFlow, a publishing optimization platform, show it's the youngest Trump that has captured America's hearts and minds.\nSocialFlow compiled data after running an exhaustive search on major social media platforms like Twitter, Facebook and LinkedIn, including content that ran through their own site to those platforms from over 300 major media companies.\nBarron, the son of the president and first lady Melania Trump, was the target of a rash of social media mockery after he appeared at Mr. Trump's January inauguration. The 11-year-old Trump was immediately defended by people from both sides of the aisle, including Chelsea Clinton, the daughter of former presidential candidate Hillary Clinton.\nUsing a mathematical algorithm, SocialFlow looked at the most-clicked articles about Trump since he was sworn in. The company found that stories defending Barron's right to privacy were by far the most-read stories of the top 500 stories from the first 99 days of Trump's presidency.\nSocialFlow CEO Jim Anderson tells CBS News that Americans' reactions to coverage of Barron appeared to be enormously encouraging.\n\"At a time when so much seems to divide our country, this is one example of how people from all parts of the spectrum share a common value: keep the children out of it,\" said Anderson. \"And if we can find one common shared value, it's a good bet there are others.\"\nImmigration-focused stories were also found to be widely popular in reach and engagement of social media users from a mix of both pro-Trump supporters and his opponents.\n\"Immigration is a topic that is incredibly important to Americans on both sides of the issue. Whether you believe that immigration is a core part of what has made America great, or a critical threat to our continued safety and prosperity -- the emotions are high,\" added Anderson.\nThe reversal on Mr. Trump's temporary travel ban by a federal judge was the most-shared story, with more than 116,000 shares, according to SocialFlow.\n\"When then-candidate Trump proposed in December 2015 a ban on Muslims entering the country, our data showed that it eclipsed all other topics in the campaign at the time. At that point, he was the most talked about person on the planet, and we had to stop comparing him to other political candidates and start comparing him to the kind of attention generated by celebrities,\" noted Anderson.\nA surprising finding? Issues like the chemical weapons attack in Syria, the ongoing tensions in North Korea and even Mr. Trump's refusal to turn over his tax returns barely made the meter move in terms of social media engagement.\n\"The most surprising part was what wasn't there. We didn't see nearly as much engagement on stories about Russia, health care, the border wall, or tax returns or even FBI Director Comey,\" said Anderson.\nWhen Mr. Trump proudly announced he would not attend the White House Correspondents Dinner, jokes at the expense of the president were the second most-retweeted items and third most-popular in terms of engagement.\nI will not be attending the White House Correspondents' Association Dinner this year. Please wish everyone well and have a great evening! — Donald J. Trump (@realDonaldTrump) February 25, 2017\n\"Satire has of course long been popular in politics, so the popularity of satire pieces isn't surprising. What's interesting is how much more accessible the satire is. You don't have to buy a newspaper to see a political cartoon, or stay up until 11:30 p.m. to see a comedian's take -- the satire comes right to you in your social feed, often in small digestible chunks that are easy to like and share with your friends,\" noted Anderson.\nSocialFlow found that while the level of media coverage and public consumption has remained relatively flat since the inauguration, any drop-off in interest has been buoyed by the fact people, both supporters and opponents, are looking to read about just what Mr. Trump is really doing in the White House.\n\"We saw during the campaign that candidate Trump was a master at generating attention. Now of course as President Trump, he has an even bigger platform,\" Anderson said.\nAnderson adds, \"His ability to generate attention has remained high, and he has shown a willingness to consistently use that platform in a way that no other president ever has.\"\nCBSN Originals recently returned to Erie, Pennsylvania to reconnect with locals who hoped a fresh approach in Washington would bring about change in their struggling home town. Airing on May 21 at 8 p.m. EST, \"America | Redefining Hope\" looks at how that hope has evolved.",
    "label": 2
}