{
    "index": 47,
    "text": "— -- President Donald Trump had kind words for the Australian health care system at a meeting with that country's prime minister Thursday, just hours after Republican members of Congress succeeded in passing their efforts to roll back the Affordable Care Act.\n“We have a failing health care -- I shouldn't say this to our great gentleman and my friend from Australia because you have better health care than we do,\" said Trump.\nThe remarks were quickly seized upon by progressive critics of the president, including Sen. Bernie Sanders, I-Vermont, who have long advocated for a government-run universal health care option, similar to Australia's Medicare system.\n\"The president has just said it. That's great. Let's take a look at the Australian health care system, and let's move,\" said Sanders shortly afterward in an interview on MSNBC. \"Maybe he wants to take a look at the Canadian health care system or systems throughout Europe. Thank you, Mr. President. Let us move to a Medicare-for-all system that does what every other major country does.\"\nTrump's comments came as he and Australian Prime Minister Malcolm Turnbull met with the press during a visit to New York City. The pair met in-person for the first time before attending a dinner celebrating the 75th anniversary of the Battle of the Coral Sea in World War II aboard the Intrepid Sea, Air and Space Museum.\nDeputy press secretary Sarah Huckabee Sanders said Friday that Trump was \"simply being complimentary of the prime minister, and I don't think it was much more than that.\"\n\"I think he believes they have a good health care system for Australia,\" Sanders said, adding, \"What works in Australia may not work in the United States.\"\nBut just over an hour later, Trump appeared to refute Huckabee Sanders on Twitter by repeating his stance from the previous day.\n\"Of course the Australians have better healthcare than we do -- everybody does. ObamaCare is dead! But our healthcare will soon be great,\" wrote Trump.\nTrump's first conversation with Turnbull came in a heated January phone call in which the newly inaugurated president became upset over a deal between the countries for the U.S. to accept refugees for Australia. Trump tweeted in the aftermath that he would \"study this dumb deal!\" while Turnbull denied reports that he was hung up on.\nThe president addressed the call at the top of his remarks at Thursday's dinner, saying that the two \"didn't have a rough phone call.\"\n\"Everyone is talking about this phone call, the media is saying, 'What do you think about the phone call? You didn't really hang up,'\" said Trump. \"No, we had actually a very nice call.\"\n\"It got a little bit testy,\" Trump then admitted. \"But that's OK.\"\nThe pair got off to a late start Thursday afternoon after Trump delayed his departure for New York in order to hold a White House Rose Garden press conference with Congressional Republicans following the health care bill's vote.\nAfter a bilateral meeting, Trump and Turnbull attended the black-tie gala to honor those who fought in the Battle of Coral Sea, celebrate the American-Australian relationship and establish an American-Australian Veterans' Scholarship Fund.\n\"Together we discussed crucial issues ranging from national security to trade to immigration and enhanced economic cooperation,\" said Trump of his meeting with Turnbull in his speech. \"We reaffirmed the tremendous friendship between the United States and Australia and the vital importance of our security and our alliance.\"\nThe American Australian Association -- to which Trump claimed he has \"been contributing to ... for years\" -- hosted the dinner and noted that the \"critical\" 1942 \"battle that saved Australia\" was the \"first defeat suffered by the Empire of Japan and stopped the looming Japanese invasion of Australia.\" The navies of the U.S. and Australia successfully cooperated to prevent an invasion of Japanese ships.\nThe president recognized seven of the battle's surviving sailors in attendance at the gala, saying, \"These men stood at the breach in the battle to save civilization and their sacrifice kept us free free.\"\n\"They saw enemy planes flying toward them by the dozen. They saw the flames erupt into the air, and they saw the true cost of war in the faces of the heroes that never returned,\" said Trump. \"On this special gathering, on this special night, we remember the courage of these men and every man, Australian and American, who fought in the Battle of the Coral Sea.\"\nThe meeting with Trump was Turnbull's second with a member of the executive branch in the past month.In April, Vice President Mike Pence met with the Australian prime minister as part of a trip through Asia and Australia. During the visit, Turnbull pledged to continue the \"intimate\" relationship between the two countries.",
    "label": 2
}