{
    "index": 392,
    "text": "Diary of Trump’s first 100 days: Highlights of an unconventional presidency\nShow Caption Hide Caption Advice for President Trump after 100 days in office USA TODAY's Susan Page asks a panel of White House veterans and presidential scholars to offer President Trump advice after his first 100 days in the White House. USA TODAY\nDay 1: Jan. 20\nTrump is sworn in as president at noon on the West Front of the U.S. Capitol. In his first Oval Office appearance, before heading to inaugural balls, he signs an executive order directing agencies to find ways to \"ease the burden\" of Obamacare.\nDay 2: Jan. 21\nTrump makes an appearance at CIA headquarters, expressing his support for the intelligence community while attacking the media for reporting that he had a \"feud\" with them over investigations into Russian hacking and the election. He also criticizes media coverage of his inauguration, echoed later by press secretary Sean Spicer in an angry briefing room debut. Meanwhile, millions of people join Women's March protests around the world, including in Washington.\nDay 3: Jan. 22\nTrump starts the day with tweets touting his inauguration TV ratings and weighing in on the weekend protests against him: \"Watched protests yesterday but was under the impression that we just had an election! Why didn't these people vote?\" Top aide Kellyanne Conway makes waves with a Meet the Press appearance in which she says Spicer \"gave alternative facts\" in his press briefing in regard to inauguration crowd sizes.\nDay 4: Jan. 23\nTrump signs three presidential directives: withdrawing U.S. support for a Pacific trade deal; imposing a hiring freeze in civilian agencies; and restoring the so-called Mexico City policy that prohibits U.S. aid from supporting international groups that promote abortion. In a meeting with congressional leaders, Trump revives claims of voter fraud, blaming his popular vote loss on 3 million to 5 million people voting illegally.\nDay 5: Jan. 24\nTrump signs five executive actions on energy and infrastructure projects, including two memoranda intended to expedite the Keystone XL and Dakota Access pipelines. In a late-night tweet, he references plans to address one of his key campaign promises the following day: \"Big day planned on NATIONAL SECURITY tomorrow. Among many other things, we will build the wall!\"\nDay 6: Jan. 25\nTrump starts the day with tweets vowing a \"major investigation\" into alleged voter fraud. In the afternoon, he visits the Department of Homeland Security and signs executive actions aimed at building a wall on the Mexican border and clamping down on \"sanctuary cities.\"\nDay 7: Jan. 26\nTrump floats a proposal for a 20% tax on imports from Mexico to pay for his planned border wall. His plans for the wall drive a divide between the two countries and lead Mexican President Enrique Peña Nieto to cancel a meeting between the two leaders. Trump takes his first Air Force One ride, traveling to Philadelphia to speak at the GOP congressional retreat.\nDay 8: Jan. 27\nTrump has an hourlong phone call with Mexican President Enrique Peña Nieto. He has his first official meeting with a foreign leader, British Prime Minister Theresa May. During their news conference, Trump declines to say whether he supports a reduction of sanctions against Russia. He visits the Pentagon to charge his new Defense secretary with rebuilding the military and announce an executive action to clamp down on refugee admissions in the U.S.\nDay 9: Jan. 28\nTrump's executive order from the previous evening — which suspends the U.S. refugee program for 120 days, bans all immigrants from seven Muslim countries for 90 days, and orders the administration to develop \"extreme vetting\" measures — causes reverberations across the country, with stranded travelers, airport protests and legal challenges. The president makes a round of phone calls to world leaders, including Russian President Vladimir Putin. Trump also signs more executive orders: one to reorganize the National Security Council, another to strengthen ethics rules for the executive branch, and a third directing the military to present him a plan to defeat the Islamic State.\nDay 10: Jan. 29\nTrump, the target of protests, lawsuits and global criticism over his new refugee policy, takes to social media to defend it as a counter-terrorism measure. Some congressional Republicans suggest the order may have been too broad and hastily written. The president also faces blowback after giving chief strategist Steve Bannon an elevated role on the National Security Council.\nDay 11: Jan. 30\nAmid continued criticism over his temporary travel ban, Trump says that stopping terrorism involves hard choices and adds that he's following through on campaign pledges. Former president Barack Obama's office releases a statement that applauds those protesting the ban. That evening, acting Attorney General Sally Yates, a holdover from the Obama administration, says she won't defend the president’s travel ban in court. Three hours later, the White House announces that she's been relieved of her duties.\nDay 12: Jan. 31\nThe morning after firing his acting attorney general, Trump mocks his Democratic congressional critics and demands that the Senate confirm his attorney general pick, Alabama Sen. Jeff Sessions. He meets with drugmakers and pledges to cut taxes and streamline regulations for the pharmaceutical industry in a bid to drive down drug prices. The president caps off the day with his long-awaited Supreme Court nomination, announcing his selection of Neil Gorsuch to fill the seat of the late Justice Antonin Scalia.\nDay 13: Feb. 1\nTrump says the Senate should \"go nuclear\" and eliminate Democratic filibuster rights if that's what it takes to confirm Gorsuch. His nomination of Betsy DeVos for Education secretary takes a hit when two Republican senators say they'll vote against her. The president makes an unannounced trip to a Delaware military base to receive the remains of a Navy SEAL killed during a counter-terrorism raid.\nDay 14: Feb. 2\nIn remarks at the National Prayer Breakfast, Trump references leaked conversations between himself and Mexican and Australian leaders, telling attendees not to worry about his \"tough phone calls\" and that the country has to be \"tougher\" in meeting its challenges. He raises eyebrows by also asking for prayers for his Apprentice successor, Arnold Schwarzenegger, and the show's ratings, which Trump said have gone \"down the tubes\" in his absence. And he vows to make good on his promise to overturn the so-called Johnson Amendment, which bans public charities — including churches — from campaigning for or against a candidate for elected office.\nDay 15: Feb. 3\nThe Trump administration imposes new sanctions on Iranian individuals and companies, citing the Tehran government's missile tests and support for rebels in Yemen. The president signs executive actions rolling back key financial regulations of the Obama era, including restrictions on Wall Street banks and on financial advisers who sell clients expensive financial products with higher commissions.\nDay 16: Feb. 4\nTrump spends his weekend at Mar-a-Lago, the \"Winter White House.\" He asks a federal court to overturn a Seattle judge’s injunction halting his immigration ban, after he criticized the judge’s ruling as “ridiculous” and a “terrible decision.” In excerpts of a Fox News interview with Bill O'Reilly set to air before the Super Bowl the following day, Trump reiterates his desire to improve relations with Russia and dismisses concerns that Putin is a “killer.”\nDay 17: Feb 5\nTrump continues to attack the federal judge who voided his travel ban. \"Just cannot believe a judge would put our country in such peril,\" he tweets. \"If something happens blame him and court system. People pouring in. Bad!\" As the Justice Department appeals the judge's decision, Trump also tweets that he has \"instructed Homeland Security to check people coming into our country VERY CAREFULLY. The courts are making the job very difficult!\"\nDay 18: Feb. 6\nAs an appeals court reviews his travel ban, Trump claims that the public is with him, despite polls indicating otherwise. \"Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election,\" Trump tweets. \"Sorry, people want border security and extreme vetting.\" In a visit to the headquarters of the U.S. Central Command in Tampa, Trump tells troops he is 100% behind them in the fight against \"radical Islamic terrorism\" and claims that \"in many cases the very, very dishonest press doesn’t want to report\" on terrorist attacks.\nDay 19: Feb. 7\nTrump tells a group of county sheriffs that he will help them fight terrorism and illegal immigration, and he vows to take his travel ban all the way to the Supreme Court if necessary. DeVos is confirmed as Education secretary after a contentious battle in the Senate, with Vice President Pence breaking a 50-50 tie vote. Later that day, the 9th U.S. Circuit Court of Appeals hears oral arguments over a lower court's decision to halt Trump's travel ban.\nDay 20: Feb. 8\nTrump urges the 9th U.S. Circuit Court of Appeals to uphold his travel ban, arguing that national security is at stake and suggesting that judges sometimes act politically. The president attacks Nordstrom for dropping daughter Ivanka's fashion line, drawing criticism for mixing government and his family's business interests. The Senate debate on the Sessions attorney general nomination turns ugly after Democratic Sen. Elizabeth Warren is silenced by the GOP during a speech for \"impugning\" Sessions.\nDay 21: Feb. 9\nTrump accuses Sen. Richard Blumenthal, D-Conn., of distorting what Gorsuch said about the president's attacks on judges, even though administration officials and fellow senators confirm the gist of Gorsuch's comments. The president also uses Twitter to attack Sen. John McCain over his criticism of the White House calling the Yemen raid a “huge success.\" Watchdog groups file ethics complaints against Conway for promoting Ivanka Trump's fashion line during a TV interview. The U.S. Court of Appeals for the 9th Circuit weighs in that evening, refusing to reinstate Trump's travel ban.\nDay 22: Feb. 10\nIn a joint news conference with Japanese Prime Minister Shinzo Abe, Trump reaffirms the U.S. commitment to the defense of Japan but says both countries need to contribute more to military cooperation. He says he’ll take action the following week to strengthen border security in the wake of the appeals court ruling against his travel ban, but he declines to specify what that action might be. Meanwhile, a federal judge in Virginia blasts his travel ban, citing a lack of evidence that travelers from the seven Muslim-majority countries represent a specific threat.\nDay 23: Feb. 11\nTrump golfs with Abe at Trump National Jupiter Golf Club in Florida, while Melania Trump and Abe’s wife, Akie, spend the morning touring the Morikami Museum and Japanese Gardens in Palm Beach County. It's a relatively quiet day for the president on Twitter, with Trump vowing that cost estimates for his border wall will \"come WAY DOWN\" once he is involved with design and negotiations.\nDay 24: Feb. 12\nTrump takes to Twitter in the morning to again defend his travel ban. In Sunday show appearances, policy adviser Stephen Miller says the president is assessing all of his legal options on the ban, ranging from appealing to the Supreme Court to revising the executive order.\nDay 25: Feb. 13\nAfter a day filled with mounting questions and criticism, National Security Adviser Michael Flynn resigns, citing \"incomplete information\" that he provided White House officials about his dealings with the Russian ambassador. Earlier that day, Canadian Prime Minister Justin Trudeau visits the White House. Trump pledges \"bridges of commerce\" with Canada and says he wants relatively minor changes to NAFTA, adding that most of his problems with the trade deal involve the third partner, Mexico.\nDay 26: Feb. 14\nIn the aftermath of Flynn's exit, Spicer says Trump knew for more than two weeks that Flynn lied about his contact with a Russian ambassador and demanded his resignation because he could no longer trust him. That night, The New York Times reports that phone records and intercepted calls show members of Trump's campaign team \"had repeated contacts with senior Russian intelligence officials in the year before the election.\"\nDay 27: Feb. 15\nAmid the renewed questions about contacts between Trump's associates and Russia regarding the 2016 election, the president denounces \"conspiracy theories\" about his relationship with the Russians and said \"illegal\" news leaks brought down Flynn. Trump hosts Israeli Prime Minister Benjamin Netanyahu at the White House for a series of meetings. Andrew Puzder, the president’s embattled pick to become Labor secretary, withdraws his nomination.\nDay 28: Feb. 16\nIn a lengthy, fiery, wide-ranging news conference, Trump defends his administration as a \"fine-tuned machine,\" laments the \"mess\" he inherited from his predecessor and excoriates the \"fake news\" media. He says he asked Flynn to resign because he misled Pence about his phone calls to the Russian ambassador, but Trump says he didn't believe Flynn did anything wrong by making the calls and faults leakers for providing contents of the intercepted calls to the media.\nDay 29: Feb. 17\nThe Associated Press reports on the details of an internal Department of Homeland Security memo from January that proposes calling up as many as 100,000 National Guard troops to round up undocumented immigrants; it draws an angry response from the White House, with Spicer calling the AP report \"100% not true\" and insisting the memo is “not a White House document.” Trump conducts his first presidential visit beyond the Beltway with a stop in the Boeing facility in North Charleston, S.C., where he stresses his \"America First\" trade and economic policies.\nDay 30: Feb. 18\nTrump kicks off his third straight weekend at Mar-a-Lago seeking to calm reports of turmoil within his administration. \"Don't believe the main stream (fake news) media.The White House is running VERY WELL. I inherited a MESS and am in the process of fixing it,\" he tweets that morning. He holds a campaign-style rally in the evening in Melbourne, Fla.\nDay 31: Feb. 19\nTrump is ridiculed for apparently denouncing a non-existent terrorist attack in Sweden in his rally the night before but says he was referring to a Fox News report on violence in Sweden allegedly perpetrated by refugees. In New York City, more than a thousand people protest Trump's travel ban in the \"I Am A Muslim Too\" rally.\nDay 32: Feb. 20\nAcross the country, anti-Trump activists mark Presidents Day with “Not My Presidents Day” protests. The president spends the holiday at Mar-a-Lago and announces that Army Lt. Gen. H.R. McMaster will be his new national security adviser, replacing Flynn.\nDay 33: Feb. 21\nTrump speaks out against a series of bomb threats to Jewish community centers across the nation after coming under fire for sidestepping earlier opportunities to condemn several anti-Semitic acts since he took office. The Department of Homeland Security issues new directives to increase deportations among the country's 11 million undocumented immigrants.\nDay 34: Feb. 22\nTrump and his aides say they’ll roll out a proposed budget, a revamped health care plan and a new tax reform package over the following two months. The president, while meeting with budget officials, doesn't give specifics, but he tells reporters that \"our moral duty to the taxpayer requires us to make our government leaner and more accountable” and “we must do a lot more with less.” Later that evening, the Trump administration issues new guidance on transgender students' restroom use, rolling back the policies put in place by the Obama administration last year.\nDay 35: Feb. 23\nTrump meets with manufacturing executives at the White House and later holds a listening session on human trafficking. The Conservative Political Action Conference kicks off just outside of Washington. White House Chief of Staff Reince Priebus and Bannon make a joint appearance at the annual confab, in which they dispute media reports casting them as rivals and say they are working together to advance the president's agenda.\nDay 36: Feb. 24\nTrump starts off the day criticizing FBI \"leakers\" as he and aides push back on news reports that his chief of staff asked the bureau to \"knock down\" stories about investigations into possible contacts between Trump campaign associates and Russian officials. At his CPAC speech later that morning, Trump launches into a full-throated attack on journalism, saying some reporters make up unnamed sources for \"fake news\" and describing the media as \"the enemy\" of the American people. News organizations protest a White House decision that afternoon to hold a news briefing by invitation only.\nDay 37: Feb. 25\nThe president takes to Twitter in the morning with further complaints about the media. “The media has not reported that the National Debt in my first month went down by $12 billion vs a $200 billion increase in Obama first mo,” he tweets. In the evening, he announces via Twitter that he will not attend the annual White House Correspondents' Association Dinner in April.\nDay 38: Feb. 26\nThe president tweets that the Democratic National Committee election \"was of course, totally 'rigged' \" and takes another swing at the media, tweeting, \"Russia talk is FAKE NEWS put out by the Dems, and played up by the media, in order to mask the big election defeat and the illegal leaks!\" In the evening, Trump hosts the nation's governors for an annual dinner at the White House.\nDay 39: Feb. 27\nTrump signs off on top-line numbers in a budget outline that bolsters military spending while making deep cuts to other federal agencies. \"This defense spending increase will be offset and paid for by finding greater savings and efficiencies across the federal government,\" he says. \"We're going to do more with less.\" The president rejects the idea of a special prosecutor to look into Russian connections during the election and says, “I haven’t called Russia in 10 years.\"\nDay 40: Feb. 28\nTrump uses his first address to Congress to proclaim American greatness and push an ambitious agenda of economic nationalism, declaring, \"The time for small thinking is over. The time for trivial fights is behind us.\" He opens the possibility of a comprehensive immigration deal, pitches $1 trillion for \"Buy American, Hire American\" infrastructure spending, and says he will propose \"historic\" tax cuts. Earlier that day, the president signs executive orders targeting a water-protection rule and elevating an initiative on historically black colleges and universities.\nDay 41: March 1\nA day after Trump struck a more conciliatory tone in his address to Congress, critics predict he'll revert back to the more combative and divisive approach that characterized much of his first month in office. Aides, however, say the president is focused on enacting his campaign agenda. White House Deputy Counsel Stefan Passantino says in a letter that Conway did nothing \"nefarious\" when she promoted Ivanka Trump's fashion line on television and that a White House inquiry \"concluded that Ms. Conway acted inadvertently and is highly unlikely to do so again.\"\nDay 42: March 2\nThe news of Sessions' 2016 meetings with the Russian ambassador, contradicting his testimony during his confirmation hearing that he had no contact with the Russian government during the campaign, dominates the day. Trump says he \"wasn't aware at all\" of the meetings. Speaking to reporters during a tour of the USS Gerald Ford in Newport News, Va., the president says he still had \"total\" confidence in his attorney general. Later that afternoon, Session recuses himself from the Russia investigation.\nDay 43: March 3\nSeeking to get past stories about Sessions and Russia, Trump spends the day visiting a school in Florida. He uses Twitter to express his displeasure with Democrats, knocking them over his full Cabinet having not yet been approved and calling Senate Minority Leader Chuck Schumer a \"hypocrite\" in a tweet displaying a 2003 photo of Schumer and Putin.\nDay 44: March 4\nIn a morning tweetstorm, Trump accuses Obama of wiretapping him at Trump Tower prior to the November election: \"Terrible! Just found out that Obama had my 'wires tapped' in Trump Tower just before the victory. Nothing found. This is McCarthyism!\" the president tweets. An Obama spokesman rejects the accusation as \"simply false.\" Thousands of Trump supporters convene near Trump Tower and in other cities around the U.S. in what organizers bill as \"March 4 Trump\" demonstrations on behalf of the president.\nDay 45: March 5\nIn the morning, the president calls for a congressional investigation of his claims that Obama had him wiretapped during the election — while critics accuse Trump of trying to distract from the investigation into his own relationship with Russia. That evening, news reports indicate that FBI Director James Comey over the weekend sought a public rebuke from the Justice Department of Trump's wiretapping claim.\nDay 46: March 6\nTrump issues the long-awaited revised version of his travel ban, which no longer restricts travel from Iraq, one of the seven majority Muslim countries listed in his original order. The new order, set to take effect 10 days afterward, includes Iran, Libya, Somalia, Syria, Sudan and Yemen as part of the 90-day ban. Meanwhile, when White House deputy press secretary Sarah Sanders is asked on ABC's Good Morning America whether the president accepts Comey's statement that Obama did not authorize any wiretaps, she says: \"You know, I don't think he does.\"\nDay 47: March 7\nTrump kicks off the day by using Twitter to again bash Obama — this time in a false claim about Guantanamo Bay prisoner releases. He also denies reports of dissension within his staff. \"Don't let the FAKE NEWS tell you that there is big infighting in the Trump Admin,\" the president tweets. He praises the House GOP health care bill amid pushback from conservatives attacking the new plan. \"We're going to do something that is great,\" the president says during a meeting with House deputy whips. The plan is \"complicated, but it's very simple ... it's called good health care.\"\nDay 48: March 8\nWhile refusing to confirm or deny the authenticity of CIA documents released by WikiLeaks, Spicer says that \"this alleged leak should concern every single American in terms of the impact it has on our national security\" and says there's a \"massive, massive difference\" between exposing the emails of Clinton campaign chairman John Podesta and other Democratic officials, and leaking national security secrets. The president dines with former foe Sen. Ted Cruz. Sens. Lindsey Graham and Sheldon Whitehouse send a letter to the FBI director and acting deputy attorney general asking for specific information on Trump's wiretapping accusation against Obama.\nDay 49: March 9\nTrump meets with his National Economic Council and representatives of community banks. As GOP leaders try to quell concerns about the new health care legislation, the president tweets, \"Despite what you hear in the press, healthcare is coming along great. We are talking to many groups and it will end in a beautiful picture!\" Meanwhile, legal challenges mount from several states for Trump's revised travel ban.\nDay 50: March 10\nAs the president reaches the halfway point of his first 100 days, administration officials kick off a plan to use social media and interviews to promote \"50 days of action.\" Trump meets with House committee leaders and predicts a fairly rapid approval of the GOP health care bill. \"This is the time we’re going to get it done,\" he says. \"I think it’s just something that’s going to happen very shortly.\" He welcomes a better-than-expected jobs report showing that the economy added 235,000 jobs the previous month.\nDay 51: March 11\nTrump has lunch with a group of White House staff and Cabinet members at Trump National Golf Club in Sterling, Va. His administration moves forward with plans to dismiss 46 U.S. attorneys held over from the Obama administration amid criticism, and news reports emerge that an intruder was arrested on the White House grounds after scaling a fence the previous evening.\nDay 52: March 12\nTrump administration officials mount a vigorous defense of their effort to repeal and replace Obamacare while bracing for what could be a skeptical assessment from the Congressional Budget Office the next day. Speaking on NBC's Meet the Press, Health and Human Services Secretary Tom Price says the bill would lead to \"more people covered than are covered right now, and at an average cost that is less.\"\nDay 53: March 13\nThe CBO releases its analysis of the GOP health plan, determining that the bill would lead to 14 million fewer Americans with insurance by 2018 and 24 million by 2026. Price calls the projections \"just not believable.\" Trump launches an ambitious effort to reorganize the federal government, signing an executive order that he said would \"make it less wasteful and more productive.\"\nDay 54: March 14\nA senior White House official confirms that Trump paid $38 million in taxes in 2005 on an income of more than $150 million. The rare acknowledgement came in anticipation of a report by MSNBC's Rachel Maddow in which she disclosed a portion of the return. The news capped off an otherwise relatively quite day for the president during which Spicer pushed back against the CBO analysis of the Obamacare repeal and Trump hosted the deputy crown prince of Saudi Arabia for lunch in the State Dining Room.\nDay 55: March 15\nA federal judge in Hawaii issues a nationwide halt to Trump's second travel ban. Earlier that day, the president spars on Twitter with journalist David Cay Johnston over the previous night's leaked tax return, tweeting, \"Does anybody really believe that a reporter, who nobody ever heard of, 'went to his mailbox' and found my tax returns?\" Trump also travels to Detroit to speak to autoworkers before heading to a rally in Nashville.\nDay 56: March 16\nIn his first formal budget proposal to Congress, Trump seeks to increase defense spending by $54 billion and offsets that with cuts to non-defense spending, including steep cuts to education, environmental protection, health and human services and foreign aid. Senate Intelligence Committee leaders say in a statement that there are \"no indications that Trump Tower was the subject of surveillance,\" a day after the House Intelligence panel offered a similar assessment. Trump also meets with Irish leader Enda Kenny and attends the Friends of Ireland Luncheon on Capitol Hill.\nDay 57: March 17\nDisputing media reports that the GOP health care bill is in political trouble, Trump says he is \"100% behind\" the plan and is working with skeptical conservatives. He welcomes German Chancellor Angela Merkel to the White House after months of back-and-forth between the two leaders. During their news conference, Trump again defends his surveillance allegations. \"At least we have something in common, perhaps,\" he says, referencing past disclosures during the Obama administration that Merkel's cellphone had been monitored.\nDay 58: March 18\nThe president spends the weekend at Mar-a-Lago. In a pair of morning tweets, Trump lashes out at the media and Germany: \"Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel. Nevertheless, Germany owes ... vast sums of money to NATO & the United States must be paid more for the powerful, and very expensive, defense it provides to Germany!\" Meanwhile, at the White House, the Secret Service apprehends a person who jumped a bike rack near the security perimeter.\nDay 59: March 19\nA day before a high-stakes hearing featuring Comey's testimony, the leaders of the House Intelligence Committee say on Sunday talk shows that there's no evidence to back Trump's claims that Obama wiretapped him, though the committee's chairman, Rep. Devin Nunes, says investigators are looking at other types of possible surveillance of Trump and his aides during the campaign.\nDay 60: March 20\nAppearing before the House Intelligence Committee, Comey says the FBI and DOJ have \"no information to support’’ Trump’s assertions that Obama wiretapped him, and he also confirms for the first time publicly that the FBI is investigating Russian interference in the election. Trump heads to Kentucky to take part in a rally to build support for the GOP health care bill.\nDay 61: March 21\nThe morning after congressional Republicans released a modified version of their health care legislation seeking to win more conservative votes, Trump meets with GOP lawmakers on Capitol Hill, emphasizing how important it is that they stay united to pass the legislation. The president also signs a $19.5 billion bill to fund NASA programs and reaffirm what he called a \"national commitment\" to \"human space exploration.\"\nDay 62: March 22\nThe White House dismisses a report that Trump's former campaign chairman, Paul Manafort, received a $10 million contract a decade ago to advance the interests of Putin. Nunes says communications involving members of Trump's transition group were \"incidentally collected'' by intelligence officials after the election. The president meets with members of the Congressional Black Caucus, and negotiations continue over the looming health care vote in the House.\nDay 63: March 23\nIn a setback to Trump and Speaker Paul Ryan's efforts to repeal Obamacare, the House postpones its vote on the bill as negotiations continue with both conservative and moderate groups. The president touts the House Intelligence chairman's assertion that spy agencies engaged in \"incidental collection\" of Trump associates' communications, saying it's evidence to support his claim that Obama \"wiretapped\" Trump Tower. Trump also holds a listening session on health care at the White House with truckers and trucking CEOs.\nDay 64: March 24\nAs the Obamacare repeal bill bleeds GOP support ahead of its rescheduled vote, Ryan pulls the legislation from consideration — a major bump in the road for Trump's campaign promise to repeal and replace the health care law. The president blames the bill's failure on the lack of Democratic support. Earlier that day, Trump signs a permit to allow the construction of the Keystone XL pipeline, calling it \"a great day for American jobs.\"\nDay 65: March 25\nThe morning after Republicans' Obamacare repeal plan fell apart in Congress, Trump tweets, \"ObamaCare will explode and we will all get together and piece together a great healthcare plan for THE PEOPLE. Do not worry!\" The president stays in the D.C. area for the weekend, venturing to Trump National Golf Club in Sterling, Va.\nDay 66: March 26\nTrump takes aim at the House Freedom Caucus in a morning tweet: \"Democrats are smiling in D.C. that the Freedom Caucus, with the help of Club For Growth and Heritage, have saved Planned Parenthood & Ocare!\" In Sunday show appearances, Priebus and budget director Mick Mulvaney say Trump has not blamed Ryan for the failure of the Obamacare repeal bill.\nDay 67: March 27\nTrump taps son-in-law Jared Kushner to lead a new White House office designed to bring ideas from the private sector into the federal government. The president rolls back more Obama-era regulations, signing four bills that reverse rules on education, land use and federal purchasing, and he holds a meeting at the White House with female small-business owners.\nDay 68: March 28\nTrump signs an executive order on energy independence, a sweeping repudiation of Obama-era environmental initiatives that substitutes a strategy of combating climate change through international cooperation for an America-first energy policy. Nunes faces pressure to recuse himself or step down as leader of the investigation of Russian meddling in the 2016 presidential election.\nDay 69: March 29\nThe president kicks off the day with complaints on Twitter about the media. \"Remember when the failing @nytimes apologized to its subscribers, right after the election, because their coverage was so wrong. Now worse!\" he tweets. Trump later holds an opioid abuse listening session, joined by New Jersey Gov. Chris Christie, leader of the White House's new commission to combat the opioid crisis.\nDay 70: March 30\nTrump takes to Twitter to threaten the conservative group that opposed him on health care: \"The Freedom Caucus will hurt the entire Republican agenda if they don't get on the team, & fast. We must fight them, & Dems, in 2018! \" Later that day, The New York Times reports that two White House officials played a role in providing intelligence reports to Nunes. The president meets with Denmark’s prime minister, Lars Lokke Rasmussen.\nDay 71: March 31\nWhile Trump encourages Flynn to offer testimony to investigators in exchange for immunity, congressional leaders investigating Russia's interference in the election signal that it's too early to consider such an agreement. Trump promises to crack down on \"foreign importers that cheat\" with two executive orders that he said would lead to a historic reversal of the nation's trade deficit.\nDay 72: April 1\nTrump kicks off another Saturday with tweets attacking the media, with NBC's Chuck Todd as the target: \"When will Sleepy Eyes Chuck Todd and @NBCNews start talking about the Obama SURVEILLANCE SCANDAL and stop with the Fake Trump/Russia story?\" The president also uses Twitter to praise a New York Times article on Obamacare, though he still describes the newspaper as \"failing.\"\nDay 73: April 2\nTrump expresses confidence, both on social media and at the golf course, that he and aides can resurrect their attempt to repeal Obamacare. Before hitting the links with one of his critics on health care, Republican Sen. Rand Paul, the president tweets: \"Anybody (especially Fake News media) who thinks that Repeal & Replace of ObamaCare is dead does not know the love and strength in R Party!\"\nDay 74: April 3\nTrump welcomes Egyptian President Abdel Fattah al-Sisi to the White House, praises him for doing a \"fantastic job,\" and solicits his help in the fight against terrorism. The president donates $78,333.32 — his salary since taking office — to the National Park Service. Senate Democrats reach the threshold required to block Gorsuch's confirmation, setting up a major Senate rules change later in the week for the GOP to advance the Supreme Court nomination.\nDay 75: April 4\nFormer national security adviser Susan Rice, appearing on MSNBC, says she didn't seek to \"unmask\" the names of Trump associates for political purposes. Meanwhile, in a statement on a chemical attack in Syria, Trump blames the Assad regime and calls it a consequence of the Obama administration’s “weakness and irresolution.” The president promotes his \"America First\" domestic plan at the North America’s Building Trades Unions national legislative conference.\nDay 76: April 5\nA senior White House official confirms Trump has removed Bannon from the National Security Council and says Bannon was given the post as a check on Flynn. In an interview with The New York Times, Trump floats the possibility that Rice committed a crime, but he provides no evidence. In a news conference with Jordan's King Abdullah, the president denounces the chemical attack in Syria and suggests his administration will develop a new policy toward Bashar al-Assad's government.\nDay 77: April 6\nTrump orders a cruise missile strike against Syria, saying \"no child of God should ever suffer\" the horror of the chemical weapons attack Syria launched on its own people. Earlier that day, Trump meets with Wounded Warriors at the White House before heading to Mar-a-Lago to host a summit with Chinese President Xi Jinping, and Senate Republicans invoke the \"nuclear option\" to strip Democrats of their power to block Trump's Supreme Court nominee from being confirmed.\nDay 78: April 7\nTrump's decision to strike Syria in retaliation for a chemical weapons attack draws wide political support, though some lawmakers say he should have consulted with Congress, while Russia said the strike would undermine international cooperation. The president concludes his meetings with the Chinese president at Mar-a-Lago, and his Supreme Court nominee is confirmed by the Senate.\nDay 79: April 8\nTrump does not rule out additional military action against Syria, telling Congress that he was acting \"in the vital national security and foreign policy interests of the United States\" when he ordered the launch of cruise missiles at a Syrian air field. He provides his justification in a letter to Congress under the War Powers Resolution. Kushner and Bannon hold a negotiation session to try to mend a rift that triggered speculation about a White House staff shakeup.\nDay 80: April 9\nAdministration officials confirm that Trump will ask K.T. McFarland to step down as deputy national security adviser and serve instead as ambassador to Singapore, giving McMaster a chance to pick his own lieutenant. The president heads back to D.C. in the afternoon following a weekend at Mar-a-Lago.\nDay 81: April 10\nTrump takes part in the swearing-in ceremony for Gorsuch. The White House echoes its threat of additional missile strikes against Syria if Assad's government again uses chemical weapons, and Trump aides say the administration is reworking its tax reform plan and doesn't know whether it can put together a final proposal before Congress' August recess.\nDay 82: April 11\nSpicer makes waves during the daily briefing when he states, while comparing Assad and Adolf Hitler, that Hitler \"didn't even use chemical weapons.\" He attempts to clarify by saying Hitler \"was not using the gas on his own people the same way that Assad is doing.\" In a second attempt to clarify, he says he was \"trying to draw a contrast of the tactic of using airplanes to drop chemical weapons on innocent people.\" Meanwhile, the White House says there's overwhelming evidence that Syria used a sarin nerve agent to attack opponents of the government and that Russia is trying to help Assad's government cover up the illegal use of chemical weapons.\nDay 83: April 12\nTrump meets with NATO Secretary-General Jens Stoltenberg and says at a press conference afterward that he's satisfied that NATO has responded to the criticism he leveled at it during his campaign: \"I said it was obsolete. It is no longer obsolete.\" He also says relations with Russia \"may be at an all-time low\" following Syria's use of chemical weapons the previous week and the U.S. airstrike that followed.\nDay 84: April 13\nThe U.S. military announces an attack on an Islamic State tunnel complex in Afghanistan, and Trump says he endorsed the strike. Asked about the use of the \"mother of all bombs,\" Trump says \"what I do is I authorize my military. ... We have given them total authorization and that’s what they’re doing and frankly that’s why they’ve been so successful lately.\" The president tweets on foreign policy, including on North Korea: \"I have great confidence that China will properly deal with North Korea. If they are unable to do so, the U.S., with its allies, will! U.S.A.\"\nDay 85: April 14\nTrump hits the golf course at Mar-a-Lago as he and his aides braced for what North Korea calls a \"big event.\" Administration officials say they are hopeful that China can dissuade its communist neighbor from conducting a nuclear explosion or a missile test. The Trump administration says records of visitors to the White House will stay secret until at least five years after Trump leaves office, a reversal of policy quickly denounced by advocates of transparent government.\nDay 86: April 15\nNorth Korea attempts to launch a new missile, but the device blows up almost immediately. Pence arrives in Seoul hours after the failed missile test and says U.S. resolve to support and defend South Korea is unwavering \"in these troubled times.\" Meanwhile, thousands of protesters gather in U.S. cities for Tax Day rallies and marches, demanding that Trump release his tax returns.\nDay 87: April 16\nThe Trump administration takes a low-key approach to the previous day's failed missile test in North Korea and continues to express hope that China will rein in its nuclear-armed neighbor. The president says he's unimpressed with tax protests over the weekend and indicates he has no plans to release his tax returns anytime soon. \"Someone should look into who paid for the small organized rallies yesterday. The election is over!\" Trump tweets. He returns to D.C. after spending Easter weekend in Mar-a-Lago.\nDay 88: April 17\nTrump marks his first Easter Egg Roll by defending his record in office. \"We will be stronger and bigger and better as a nation than ever before and we are right on track,\" he says during remarks on the South Portico balcony. The White House declines to detail Trump's future strategy toward North Korea, even as its government threatens more missile tests. \"I think that the action that he took in Syria shows that when appropriate this president will take decisive action,\" Spicer says.\nDay 89: April 18\nTrump heads to Snap-On Tools in Kenosha, Wis., to speak about manufacturing and sign a \"Buy American, Hire American\" executive order. The order clamps down on guest worker visas and requires agencies to buy more goods and services from U.S. companies and workers. Watchdog group Citizens for Responsibility and Ethics in Washington expands a lawsuit against the president, adding new plaintiffs who claim they are hurt by the \"unfair\" advantage he enjoys in the hotel and restaurant industry.\nDay 90: April 19\nWith the closely watched special election in Georgia headed to a runoff, Trump pats himself on the back: \"Despite major outside money, FAKE media support and eleven Republican candidates, BIG \"R\" win with runoff in Georgia. Glad to be of help!\" he tweets. He signs the Veterans Choice Program Extension and Improvement Act and welcomes the Super Bowl champion New England Patriots to the White House.\nDay 91: April 20\nThe Trump administration launches an investigation into whether steel imports threaten national security, a move aimed at China's growing dominance in steel production. The president welcomes Italian Prime Minister Paolo Gentiloni to the White House. During their joint press conference, Trump says he's confident he can block North Korea's nuclear program, get a health care bill though the House, and avoid a looming government shutdown.\nDay 92: April 21\nWith a little over a week before Trump hits the 100-day mark of his presidency, he tweets, \"No matter how much I accomplish during the ridiculous standard of the first 100 days, & it has been a lot (including S.C.), media will kill!\" Trump aims to dismantle even more financial regulations with executive orders, directing Treasury officials to take another look at tax rules and oversight of \"too big to fail\" financial institutions. The president also says he intends to unveil a tax reform plan the following week.\nDay 93: April 22\nTrump announces his plans for the night of the annual dinner of White House correspondents — and the 100th day of his presidency. \"Next Saturday night I will be holding a BIG rally in Pennsylvania. Look forward to it!\" he tweets. He makes his his first official visit to Walter Reed National Military Medical Center, awarding a Purple Heart to a soldier injured in Afghanistan. People take part in protests across the country as part of the the March for Science.\nDay 94: April 23\nAs the 100-day mark approaches, Trump and his staff plan a busy week of events — including a new tax reform outline, a renewed effort to get a health care bill through the House, a high-profile National Rifle Association speech and a 100th day rally in Pennsylvania — all topped by the need for a new spending bill to keep the government open.\nDay 95: April 24\nTrump speaks with astronauts aboard the International Space Station, lauding NASA's work and praising a crew member who set a record for longest time spent in space. As his administration slaps new sanctions on Syria, Trump tells a group of U.N. diplomats that they need to work harder to confront the Syrian government and other \"serious and growing threats\" such as North Korea. He attempts to atone for past blunders on the history of the Holocaust with a strongly worded Week of Remembrance proclamation, pledging that \"we must never forget\" the annihilation of 6 million Jews by Nazi Germany.\nDay 96: April 25\nTrump vows to fight anti-Semitic violence during a ceremony at the U.S. Capitol to commemorate the memory of the Holocaust. \"Those who deny the Holocaust are an accomplice to this horrible evil, and we will never be silent,\" Trump says. Later that day, the president expresses confidence that he'll be able to build a wall along the Southwest border but stops short of saying whether he would insist that money to finance the barrier be included in a new spending bill to keep the government open past the end of the week.\nDay 97: April 26\nTrump signs an executive order calling into question the future of more than two dozen national monuments proclaimed by the last three presidents to set aside millions of acres from development. The administration pitches a tax reform outline calling for big corporate rate cuts, a simpler tax code and big increases in standard deductions. After briefing senators at a White House meeting, members of Trump's national security team said they're trying to coerce North Korea into giving up its nuclear weapons program by cutting off foreign money they need to finance it.\nDay 98: April 27\nTrump signs an executive order seeking to provide more protections to whistle-blowers at the Department of Veterans Affairs. A week after directing a wide-ranging investigation into whether foreign steel poses a threat to U.S. national security, Trump signs an order doing the same for aluminum. He welcomes Argentinian President Mauricio Macri and first lady Juliana Awada to the White House.\nDay 99: April 28\nCongress passes a stopgap funding bill to keep the government open another week, eliminating the threat of a shutdown starting on Trump's 100th day in office. He signs an executive order that could eventually open up Arctic waters and millions of coastal acres off U.S. shores to oil and gas drilling. He heads to Atlanta to speak at the National Rifle Association convention, where he vows to defend gun rights and reminisces about his election victory.\nDay 100: April 29\nTrump is set to hold a campaign rally in Harrisburg, Pa., as White House correspondents hold their annual dinner in Washington that is traditionally attended by the president.\nContributing: Katie Smith, David Jackson, Gregory Korte, Donovan Slack\nUSA TODAY coverage of Trump's first 100 days:\n100 days into Trump presidency, Americans are united on this: They're divided\nTrump’s 5 biggest wins and losses in Congress in his first 100 days\nOne Republican congressman's wild ride on the Trump train\nIn Gettysburg speech, Trump made 100 days of promises. Did he keep them?\nPence's first 100 days: He's stayed above the fray, but what does that say about his influence?\nThe Trump years: Hope, fear, elation and angst in 100 days\nNo regrets: 100% approval at 100 days from these Trump voters\nChuck Schumer, President Trump don't talk much in first 100 days\nWhat did Trump tweet in his first 100 days?\nAnalysis: A bumpy 100 days for Trump? Just wait for the 1,361 to follow\nRonald Reagan to Donald Trump: Comparing first 100 days of last six presidents\nUSA TODAY roundtable: Advice for Trump? Take a deep breath",
    "label": 3
}