{
    "index": 459,
    "text": "Are asylum seekers being turned away at the border?\nShow Caption Hide Caption Impact of Donald Trump's 'Great, Great Wall'? A look at the socioeconomic and environmental impact of a 2,000-mile long wall at the U.S.-Mexico border.\nIn mid-February, a Guatemalan man approached U.S. border officials in Nogales.\nHe had fled violence in his country and feared going back, so when he spoke to the officer at the DeConcini port of entry, he requested asylum.\nUnder U.S. law, Customs and Border Protection employees are supposed to register such statements, take the individual into custody, and eventually direct them to an asylum officer who assesses the validity of their claim.\nThat's not what happened in this case, according to faith-based migrant-rights group Kino Border Initiative.\nThe officer told the man that he would help him, but instead had him sign documents stating he was not admissible into the United States. The Guatemalan was then sent back to Mexico without what's known as a credible-fear screening.\n► Wednesday: Chanting protesters have peaceful dialogue with Border Patrol\n► Tuesday: Spending bill excludes border wall, but Trump declares victory anyway\nJoanna Williams, Kino Border Initiative's director of advocacy, said the case reflects a border agents' \"systematic\" practice during the last half of 2016, coinciding with a spike in migrants arriving at the Arizona-Sonora border.\n\"Our staff spent a lot of time with individuals at the border, trying to pressure CBP to exercise and fulfill their legal obligation, which is to process asylum seekers and put them into a credible-fear screening process,\" she said.\nA new report from an independent, nonprofit rights group claims the practice is widespread along the entire U.S.-Mexico border: U.S. officials turn away migrants seeking asylum at ports of entry, especially in California and south Texas.\nThe situation appears to have improved on the Arizona border, activists say, though they are unclear on why.\nThis week, Human Rights First published its report documenting at least 125 cases of federal agents unlawfully turning away asylum seekers at the U.S.-Mexico border.\nThe reports' authors and researchers traveled to border communities in California, Arizona and Texas between February and April, where they interviewed migrants, staff at shelters, and attorneys and volunteers who assist asylum seekers.\nThe group said the number of people turned away unlawfully is likely much higher than its report states since many cases never are documented.\nLead researcher Shaw Drake said advocates have expressed concern about CBP's handling of asylum seekers for some time, especially last summer, when thousands of Haitian migrants were stranded primarily on the California-Mexico border.\n► Sunday: How much does it cost to deport one migrant? It depends\n► April 25: U.S. undocumented migrant population stays flat for 8th straight year\nThat occurred under the Obama administration.\nBut the election of President Trump, who advocates for more immigration enforcement, appears to have emboldened officers to wrongfully turn away people, the report said.\nIt accuses U.S. authorities of intimidating and deceiving asylum seekers by telling them things such as: \"Trump says we don’t have to let you in,” or \"You don't qualify,\" even though only asylum officers are authorized to make that determination.\n\"Since the beginning of this administration, we have continued to see a really alarming rate of complaints and concerns being raised ... across the border,\" Drake said. \"For us, this is a threshold issue: If we can't guarantee meaningful access to protection ... then the very point of those systems are undermined.\"\nThe report is also critical of Mexican immigration authorities, who it states are openly hostile and complicit with U.S. authorities at times in making it more difficult for asylum seekers to reach U.S. ports of entry.\nMexican officials repeatedly made false claims that the U.S. was no longer granting asylum to discourage migrants from seeking protection, the report says.\nHuman Rights First urged Mexican and U.S. officials to comply with laws granting unrestricted access to apply for asylum. They also called on the Department of Homeland Security's Office of the Inspector General to investigate border officers and on Congress to exercise greater oversight of the agency.\n► April 21: Trump tells DREAMers to 'rest easy' — but one in Mexico can't\n► April 17: Trump's new rules could swamp already backlogged immigration courts\nThe Office of the Inspector General did not respond to requests for comment.\nIn a statement, Customs and Border Protection denied any change in policy toward asylum seekers, saying it adheres to U.S. and international law.\n\"If a CBP officer or agent encounters a U.S.-bound migrant at or between ports of entry, without legal papers, and the person expresses fear of being returned to his/her home country, our officers process them for an interview with an asylum officer with U.S. Citizenship and Immigration Services,\" the statement read.\nThe agency also denied any wrongdoing on the part of individual employees at the ports of entry.\n\"CBP officers do not determine or evaluate the validity of the fear expressed,\" the statement said. \"As an agency, CBP adheres to law and policy on processing asylum claims and does not tolerate abuse of these policies.\"\nIf the number of would-be asylum seekers being turned away in the Nogales area has declined, advocates are unsure why.\nResearchers said they found conflicting reports in Nogales on whether the situation had improved.\n\"More investigation needs to happen to determine whether the practice is as prevalent as we heard it was before,\" said Natasha Arnpriester, a researcher who traveled to Nogales in mid-April.\nIn March, a new director took command of Nogales-area ports of entry. Researchers said it's unclear if he issued new directives or responded to complaints from advocates.\n\"It would be wonderful to know if they actually took steps to alleviate the situation at the port. And obviously, we think port directors across the border should be doing the same thing if, in fact, the Nogales port is showing some leadership in this issue,\" Drake said.\n► March 31: What we now know about Donald Trump's border wall\n► March 29: Trump's travel ban could cost $18B in U.S. tourism, analysis shows\nThe Arizona Republic requested an interview with the Nogales port director, but the Customs and Border Protection officials said he was unavailable.\nThe report focuses on California and Texas but highlights the Arizona-Sonora border for violence and other dangers faced by migrants and asylum seekers face.\nLast year, the Kino Border Initiative documented 754 cases of aggression against migrants and asylum seekers, including 105 incidents involving physical violence and 52 involving kidnapping. But that number reflects only migrants who were encountered and willing to report the abuse.\n\"We know it’s dramatically underreported,\" Williams said. \"Most of the people we receive who say they’re victims of kidnapping or other crimes are completely unwilling to go to the police because they’re afraid that there will be retributions.\"\nA spokeswoman for Customs and Border Patrol in Arizona said the agency doesn't specifically track the number of asylum seekers at ports of entry. The number is included in a broader category of \"inadmissables,\" which includes unaccompanied minors, Central American families, and Cuban and Haitian migrants.\nSince the start of the fiscal year, the number of \"inadmissibles\" at Arizona's ports of entry has dropped sharply from 2,291 in October to 592 in March.\nFollow Rafael Carranza on Twitter: @RafaelCarranza",
    "label": 3
}