{
    "index": 48,
    "text": "States could seek a waiver to charge more to those with pre-existing conditions.\n— -- An amendment to President Trump's health care proposal does not go far enough in keeping protections for people with pre-existing conditions, according to analysts and an AARP spokesperson.\nThe protections are an area of rare bipartisan agreement on the Affordable Care Act: Even President Trump has said he wants to keep that key feature.\nBut under the current bill, states could seek a waiver so insurance companies could discriminate against such people, rate them separately and charge them much higher premiums.\nIt is unclear how many states would opt to do that. Before the ACA, the majority of states did not have protections for people with pre-existing conditions. Instead their sickest residents and most expensive ones to treat were often helped through state-run high-risk pools.\nAs a compromise to allay fears from lawmakers who are uneasy about gutting these protections, a few members today unveiled an amendment that would allocate $8 billion in additional funds to help states run these high-risk pools.\nCritics of the effort said $8 billion would be just a drop in the bucket and would not cover the majority of people with pre-existing conditions, who would be at risk of seeing their premiums skyrocket under the Republican health care bill under consideration in the House of Representatives, according to several think tanks and health care experts.\nAARP, which advocates for the interests of older Americans, was quick to tweet after the amendment was announced Wednesday morning that it is still opposed to the bill. It is urging its members to call their representatives and urge them to vote \"no.\"\nKaren Pollitz, a senior fellow at the Kaiser Family Foundation, which is focused on health reform and private insurance markets, said that relatively speaking, $8 billion \"is not a lot of money.\"\nShe estimated that would be enough to cover a couple hundred thousand people — nowhere near the 5 million to 10 million people with pre-existing conditions that the foundation estimates have insurance through the individual markets.\nThe most expensive 10 percent of the population accounts for 50 percent of health care costs, said Pollitz.\n\"High risk is high-high. These are not people who need a Band-Aid for a scraped knee. They need chemotherapy and organ transplants and hospital bills.\"\nMatt Fielder, a fellow for health policy at the Brookings Institution, echoed that sentiment. He said $8 billion would be \"far short\" of what states would need to avoid large premium increases for people with existing conditions.\nHe estimated that the total claims in individual marketplaces accounted for about $500 billion and that just over half of that came from people with pre-existing conditions who would have been denied or priced out of the individual insurance market before the ACA.\n\"You have to fill a hole that is much, much larger than $8 billion,\" Fielder said.\nHe added that the additional money Republicans included in the House bill was supposed to be allocated in the Senate to improve the law and help states in other ways, such as boosting tax credits. He said that by redirecting funds, House Republicans may be \"worsening problems somewhere else in the bill.\"",
    "label": 3
}