{
    "index": 473,
    "text": "OnPolitics Today: Sally Yates told us so\nHappy Monday, OnPolitics readers! We hope you're ready for another week of politics goodness. After tiring themselves out with that health care vote last week, the House is out for vacay/recess/a district working period. But the Senate is still in session and President Trump is around and the courts are at work, so there's still plenty to do. On today's docket: Sally Yates talks blackmail, judges question the revised travel ban and Barack Obama is unsurprisingly not happy about what's going on with health care.\nIt's OnPolitics Today. Subscribe here and let's get to it.\nSally Yates: I told you so\nBack in January, Sally Yates made headlines for (a) refusing to carry out President Trump's first try at a travel ban and (b) being fired for that decision. The former acting attorney general was at it again Monday, when she told a Senate committee that in the days before her dismissal, she warned the White House about then-National Security Adviser Michael Flynn. What happened exactly? According to Yates, she told the administration in two separate meetings that Flynn had lied about his conversations with Russian ambassador Sergey Kislyak before Trump's inauguration. \"You don’t want a situation where a national security adviser could get blackmailed by the Russians,\" she said. Fair. Who else warned Trump that hiring Flynn may not be a great idea? Barack Obama.\nTravel ban week\nSpeaking of the travel ban: The second iteration of the ban is up for judicial review this week. And if you're on the side of the administration, it's not going so well. Appeals court judges on Monday grilled government lawyers over the halted executive order, pointing to Trump's previous vows to institute a \"Muslim ban\" (btw, his 2015 statement on a Muslim ban has not-so-mysteriously disappeared from his campaign website). \"Is there anything other than willful blindness that would prevent us from getting behind those statements?\" asked Judge Henry Floyd. One thing to keep in mind: If the appeals courts rule that the nationwide blocks on the ban should stand, the issue goes to the Supreme Court, where the new appointment of conservative Justice Neil Gorsuch may tilt a ruling in Trump's favor.\nObama claps back\nBarack Obama is not too pleased about the GOP attempt to dismantle Obamacare. The former president accepted the John F. Kennedy Profile in Courage Award on Sunday — and spent much of his speech targeting congressional Republicans and President Trump (though he never mentioned Trump by name). He pointed out that congressmen who voted for the Affordable Care Act back in 2010 lost their seats but did the right thing. He then added, \"I hope that current members of Congress recall that it actually doesn’t take a lot of courage to aid those who are already powerful, already comfortable, already influential. But it does require some courage to champion the vulnerable and the sick and the infirm — those who often have no access to the corridors of power.\" Sidenote: Jack Schlossberg is a name you're going to want to bookmark.\nElsewhere in politics",
    "label": 3
}