{
    "index": 884,
    "text": "Vice President Mike Pence cast a rare tie-breaking vote Thursday in the Senate to pass a bill allowing states to withhold federal funds from health care clinics like Planned Parenthood.\nThe measure would roll back an Obama-era rule that barred states from withholding funds from clinics that also offered abortion services.\nTwo Republicans — Susan Collins of Maine and Lisa Murkowski of Alaska — voted against the 48 other GOP senators. The party has a 52-48 majority in the Senate, with lawmakers voting 51-50 to pass the legislation.\nPlanned Parenthood slammed the bill, saying it could potentially encourage states to discriminate against family planning healthcare providers that offer abortions.\n\"Mike Pence went from yesterday's forum on empowering women to today leading a group of male politicians in a vote to take away access to birth control and cancer screenings,\" Dawn Laguens, executive vice president of Planned Parenthood, said in a statement. “There’s a reason they could barely get enough votes to get this bill through a procedural step: People are sick and tired of politicians making it even harder for them to access health care, and they will not stand for it.\"\nThe Obama regulation — a Department of Health and Human Services rule — prohibits states from cutting Title X family planning grants to community health centers that serve mainly low-income Americans solely because they offer abortion services. The rule from December 2016 required funds be awarded based on a provider's ability to \"effectively deliver Title X services.\"\nAlthough Planned Parenthood and other abortion providers can receive Title X grants, legislatures have blocked them from receiving the funding in nearly a dozen states. The Obama administration's regulation was designed to outlaw this practice.\nIn a series of tweets, Senator Patty Murray (D-WA) called the vote an attack on women's rights and reiterated that she will oppose Trump's Supreme Court pick Neil Gorsuch, who Democrats fear will support overturning Roe v. Wade.\n\"Women and men are watching what is happening here, watching what Republicans are trying to do and they are paying attention,\" she wrote.\nRelated: Ryan, Trump Pile on the Freedom Caucus After Health Care Failure\nIn a statement to NBC News, Rep. Diane Black (R-TN) praised the vote. The congresswoman, who introduced the legislation in late January, said the measure will protect states' rights.\n\"The Obama rule tried to force states — including Tennessee — to send taxpayer money to abortion providers like Planned Parenthood instead of community health centers and other qualified health providers,\" she said. \"Title X has worked for 45 years until the Obama Administration changed the rules, and this legislation will simply undo this ill-conceived change.”\nUnder the Hyde Amendment, Planned Parenthood and other healthcare clinics already cannot receive federal money for abortion services. Originally enacted in 1976, the law states that clinics can only use Title X grants for non-abortion health services.\nThis isn't the first time Pence has had to break a tie in the Senate. Earlier this year, he was summoned to Capitol Hill to vote to confirm Trump's controversial pick for education secretary, Betsy DeVos.",
    "label": 3
}