{
    "index": 623,
    "text": "NEW You can now listen to Fox News articles!\nStop me if you’ve heard this one before …\nHouse Republicans are united.\nThey remain steadfast in their quest to repeal and replace ObamaCare.\n“We broke down many of those dividing lines within our conference,” proclaimed House Speaker Paul Ryan, R-Wis., as GOPers huddled in the basement of the U.S. Capitol Tuesday morning. “We are going to get there.”\n“We promised that we would repeal and replace ObamaCare. And that’s exactly what we’re going to do,” boasted House Majority Leader Kevin McCarthy, R-Calif.\n“The resolve of our conference to repeal ObamaCare and replace it has never been stronger,” bragged House Majority Whip Steve Scalise, R-La.\n“We remain committed to a better health care future to every person in this country,” said House Republican Conference Chairwoman Cathy McMorris Rodgers, R-Wash.\nWell, because this time, they really mean it.\nNow Republicans are just days from a two-week congressional recess for Easter and Passover. Many rank-and-file GOPers are trying to goad Ryan into calling a vote on the health care legislation the brass euthanized last Friday because it lacked the votes to pass. Lawmakers worry about raucous town halls. The dereliction of an eight-year campaign promise that they would repeal and replace ObamaCare.\n“I won’t tell you the timeline because we want to get it right,” said Ryan. “We have an aggressive agenda and we’ve been moving quickly on this aggressive agenda. But we want to make sure that we get it right.”\nOf course, it was Ryan who engineered the timeline to vote last week on the health care plan. The strategy would enable the Senate to vote on the health care plan this week and clear the decks to confirm Supreme Court nominee Neil Gorsuch next week.\nTimelines mattered before. But they might not now.\n“I don’t think we’ve seen the end of health care,” opined White House spokesman Sean Spicer. “We’re looking for a way forward. A lot of members have reached out.”\n“We’re approaching the Easter season,” proffered House Energy and Commerce Committee Chairman Greg Walden, R-Ore., who co-authored the health care legislation. “Some things rise from the dead.”\nYeah. But …\n“It’s like there’s some invisible wall out there,” said one House Republican lawmaker who asked not to be identified. “If we vote on this bill….”\nCould the House truly pass the bill?\n“My fear is that people lock in and kind of double down on their position,” said Walden on resuscitating the health care bill.\nIt’s possible that the positions of some lawmakers would harden – especially if they were nays before. If they didn’t like it the first time, resurrecting the old bill could infuriate the no votes even more. There’s also the distinct possibility of losing tepid yea votes. There’s a reason why these lawmakers halfheartedly supported the bill. The decision last week to yank it off the floor only solidifies their original gut instinct to oppose the package.\nBy the same token, some Republicans think a snap roll call vote could force a moment of truth. Either you’re for it or against it. Ryan’s so-called “binary choice.” Calling a vote with little fanfare could compel intransigent lawmakers to vote for it.\nBut that’s risky. It’s one thing if House vote counters were just a handful shy of votes for passage. It’s another matter when the number of noes are in the thirties and perhaps higher.\nAnd there’s another problem.\nHouse Republicans consolidated their health care measure into what’s called a budget reconciliation plan. Reconciliation is a special type of legislative process which inoculates bills from Senate filibusters. Senate Democrats would inevitably filibuster a garden variety bill to repeal and replace ObamaCare. However, this particular legislative route is filibuster-proof.\nThat said, it’s generally believed the House and Senate only get one crack at a reconciliation package. Defeat on the floor burns that particular reconciliation measure. Moreover, the House and Senate can’t have two “live” reconciliation plans in the parliamentary mix simultaneously. The House hopes to adopt a budget in the coming weeks. That could create a new reconciliation package. If the House doesn’t exhaust the current reconciliation package on health care, it could postpone work on a budget for the next spending cycle.\nUnless the House can’t approve a budget.\nRemember, the House failed to adopt a budget last year -- despite the GOP’s piety when it comes to budget resolutions.\nIf the bill fails, the House Republican leadership will blame its favorite bogeyman: the House Freedom Caucus. The Freedom Caucus deserves blame. But the House leadership struggled just as mightily to convince moderate Republicans to vote yes, too.\nFreedom Caucus leader Rep. Mark Meadows, R-N.C., says it’s “possible” the House could vote. But Meadows believes the leadership team is still dealing with “artificial deadlines.” He says there’s been no talk of “specifics” and changes to court the necessary votes to pass a bill.\nIt’s also virtually impossible to engineer a new bill in a few days or a week. Even if they did, many lawmakers would gripe they didn’t have sufficient time to digest the retrenched legislation.\nPresident Trump hosted a bipartisan reception at the White House for senators Tuesday night. The president declared that “we are all going to make a deal on health care. That is such an easy one. I have no doubt that that’s going to happen very quickly.”\nCutting a bipartisan pact may be the only way Trump can achieve anything on health care.\nUnless Republicans get their act together.\nThe GOP leadership claims the party is united. Optimism abounds. Surely this time they’ll repeal and replace ObamaCare.\n“Tomorrow is a good day,” said Kevin McCarthy about the health care bill. “I think we'll get it tomorrow.”\nOnly that’s what McCarthy said last Thursday.\nCapitol Attitude is a weekly column written by members of the Fox News Capitol Hill team. Their articles take you inside the halls of Congress, and cover the spectrum of policy issues being introduced, debated and voted on there.",
    "label": 3
}