{
    "index": 371,
    "text": "Los Angeles City Council candidate Joe Bray-Ali lost the endorsements Thursday of The Times, City Councilman Mitch O’Farrell and an Eastside Democratic group, one day after Bray-Ali apologized for comments he made in uncensored online forums that include racist content.\nThe Times editorial board had previously endorsed Bray-Ali as a knowledgeable outsider who appeared poised to shake up the status quo. But, the board wrote Thursday, “The revelations [about Bray-Ali] are so deeply disturbing — raising serious questions about both his judgment and his character — that The Times has re-evaluated its original position.”\nIn doing so, the newspaper did not endorse Councilman Gil Cedillo, the incumbent and Bray-Ali’s opponent in the May 16 runoff. “The hard truth for voters in this district is that they are left without a great choice,” The Times’ editorial said.\nO’Farrell, who had taken the rare step of endorsing a fellow council member’s opponent, decried Bray-Ali’s online activity.\n“I am deeply disappointed by his highly insensitive comments in online forums that breed hate and dehumanize already marginalized communities,” O’Farrell said in a statement. “People that I love and care about are hurt by these comments. There is no place for this type of speech anywhere, especially in the City of Angels.”\nAdvertisement\nAnd the East Area Progressive Democrats, which says it has 750 members and voted in January to endorse Bray-Ali, called his remarks “caustic and callous” Thursday.\n“They undercut the candidate’s claim of readiness to represent all the people of our diverse Eastside neighborhoods,” the group said in a statement.\nBray-Ali, a 38-year-old bike advocate, is seeking to topple Cedillo in Council District 1, which includes Chinatown, Westlake and several northeast neighborhoods.\nReached by phone Thursday afternoon, Bray-Ali said that he could understand why some had pulled their endorsements but that he would stay in the race. “Those endorsements were a great boost for my campaign, but they do not represent what a campaign needs to win,” he said.\nBray-Ali said he believed his campaign message — focused on affordable housing and clean, safe streets — still resonates with voters. He said he spent Thursday walking around Council District 1 neighborhoods. “On the ground, out in the streets, on the phone — it’s been all about the campaign that I’ve built,” he said.\nBray-Ali confirmed Wednesday that he had posted multiple comments about a year and a half ago on the website Voat, including on a channel whose title consists of a racial slur against black people and on another that mocks overweight people. He had also said gender reassignment surgery “doesn’t seem like something worthy of praise, but instead of being criticized as a shameful excess.”\nCouncilman Mike Bonin, of District 11, also condemned Bray-Ali’s comments. “At a time when voices of intolerance are given a bullhorn in the nation’s capital, it is essential that we speak up against such voices in our own neighborhoods,” Bonin said in a statement.\nAaron Sosnick, a New York-based financier, has given $225,000 to an outside committee to support Bray-Ali. A large portion of that money has already been spent or committed, Sosnick said in a phone interview, but he was “assessing” his support for the candidate.\nCity Controller Ron Galperin and community advocates denounced Bray-Ali at a news conference Thursday on Olvera Street.\n“The shameful conduct that he is engaged in certainly suggests that he is not fit for this office,” Galperin said.\nThe controller affirmed his support for Cedillo, whom Galperin described as a “champion of diverse communities.”\nGalperin stopped short of calling for Bray-Ali to pull out of the race, but Richard Zaldivar, head of the Wall Las Memorias Project, a community health organization, demanded exactly that.\n“If he’s really sorry for these comments and he’s learned from these mistakes, then he should suspend his campaign and withdraw from the election,” Zaldivar said. “Furthermore, he should become a volunteer and get to know people in the district … and learn about people that he dislikes.”\nZaldivar compared Bray-Ali’s rhetoric to that of the president, saying residents of District 1 “don’t need a replicate” of Donald Trump.\nMarco Antonio Pacheco, president of Casa de la Cultura Maya, a nonprofit cultural group, said he was initially neutral on the District 1 election, but after news came out about disparaging remarks Bray-Ali made about Mexicans nine years ago in a YouTube video and the comments on Voat, he had to take a stand.\n“We realized what kind of character he has,” he said. “We have to choose what’s going to be best for our community — the whole community.”\nWhile Pacheco and others endorsed Cedillo for a second term, The Times editorial board said Cedillo’s “spotty performance, his coziness with developers and the deep discontent among his constituents” prompted it to look for “a credible alternative. But Joe Bray-Ali is not that person.”\nnina.agrawal@latimes.com\nTwitter: @agrawalnina\nUPDATES:\n5:10 p.m.: This article was updated with comments from Bray-Ali.\n4:20 p.m.: This article was updated with The Times rescinding its endorsement.\n3 p.m. This article was updated to include remarks made at a news conference Thursday and a statement by L.A. City Councilman Mike Bonin.\nThis article was originally published at 11:35 a.m.",
    "label": 2
}