{
    "index": 863,
    "text": "First Read is your briefing from Meet the Press and the NBC Political Unit on the day's most important political stories and why they matter\nThe chances of a government shutdown just went up\nAfter all of the news over the past week — North Korea, the special congressional election in Georgia, the White House trying to resuscitate health care (again) — this could be the story that drives the weekend and next week: The chances of a government shutdown just increased. “White House budget director Mick Mulvaney said Thursday that he hopes to use negotiations to keep the government open past April 28 in an effort to force Democrats to back some funding for creating a new wall along the U.S.-Mexico border,” the Washington Post writes. “Mulvaney said the White House would be open to funding some of the Democrats’ priorities — such as paying insurance subsidies under the Affordable Care Act — if Democrats agree to fund some of the more controversial parts of President Trump’s agenda, notably the border wall.”\nIf this is the White House’s position, it could be precarious: Democrats (and even some Republicans) are opposed to spending money for Trump’s border wall. And with Republicans enjoying just a 52-48 majority in the Senate, they will need Democratic help to get 60 votes. Given this math, a budget showdown is eventually coming, but the thinking had been that it would get punted until the fall. But a border-wall demand — now — could produce that showdown sooner rather than later.\nTrump White House gets imprisoned Egyptian-American released\nMeanwhile, here’s a definite accomplishment for the White House: “An Egyptian American charity worker who was imprisoned in Cairo for three years and became the global face of Egypt’s brutal crackdown on civil society returned home to the United States late Thursday after the Trump administration quietly negotiated her release,” the Washington Post says. “President Trump and his aides worked for several weeks with Egyptian President Abdel Fatah al-Sissi to secure the freedom of Aya Hijazi, 30, a U.S. citizen, as well as her husband, Mohamed Hassanein, who is Egyptian, and four other humanitarian workers. Trump dispatched a U.S. government aircraft to Cairo to bring Hijazi and her family to Washington.” More: “The Obama administration unsuccessfully pressed Sissi’s government for their release. It was not until Trump moved to reset U.S. relations with Egypt by embracing Sissi at the White House on April 3 ... that Egypt’s posture changed.”\nA president with lots of free time at his disposal\nEvery recent American president has received criticism for extracurricular activities — whether it was Barack Obama’s rounds of golf or George W. Bush’s brush-clearing trips to Crawford, TX. But what’s extraordinary about President Trump’s extracurricular activities is that they’ve taken place so early in his tenure (today is his 92nd on the job), and that they’ve come before he’s made progress on his top policy goals. Consider how the president has used his time:\nHe’s made seven trips to his Mar-a-Lago club in Florida since becoming the nation’s 45th president.\nTrump has participated in numerous rounds of golf at Mar-a-Lago and elsewhere.\nThis week alone, he tweeted seven times about the GA-6 special election.\nHe spent hours with Sarah Palin, Ted Nugent, and Kid Rock at the White House. “During dinner, which ended with flaming baked Alaska in honor of Ms. Palin … the president and his guests engaged in a wide-ranging conversation that Mr. Nugent said included the following topics: ‘health, fitness, food, rock ’n’ roll, Chuck Berry and Bo Diddley, secure borders, the history of the United States, guns, bullets, bows and arrows, North Korea, Russia’ and a half-dozen other issues,” the New York Times writes.\nAnd Americans are starting to take notice. According to a Quinnipiac poll released Thursday, 50 percent of Americans say Trump is NOT spending enough time at the White House, versus 38 percent who say he’s spending the “right amount of time,” and just 2 percent who say he’s spending TOO much time.\nOn Trump's meeting at Mar-a-Lago with two former Colombia presidents trying to sink that country’s peace deal\nSpeaking of Trump’s Mar-a-Lago, this is a striking story that highlights the conflicts of interest his resort poses. The Miami Herald: “President Donald Trump quietly met a pair of former Colombian presidents last weekend at his Mar-a-Lago resort in Florida, thrusting his administration into an ugly power struggle in Latin America that threatens to undermine the country’s controversial peace agreement with rebel leaders. “The meeting between Trump and the former presidents, Álvaro Uribe and Andrés Pastrana — Colombia news media have reported it was arranged by an influential U.S. critic of the plan, Republican U.S. Sen. Marco Rubio of Florida — was not on the president’s schedule and was not disclosed to reporters who traveled with him to Palm Beach.”\nMore: “The undisclosed meeting also raises a number of questions about the ease with which people trying to influence Trump can access him through membership in his club without fear of public disclosure; a Mar-a-Lago membership costs $200,000 for the initiation alone.”\nAttorney General Sessions: 'I really am amazed that a judge sitting on an island in the Pacific' can stop Trump’s travel ban\nIt isn’t every day when the sitting attorney general of the United States attacks the judiciary. But check out what Jeff Sessions told conservative radio host Mark Levin this week, as CNN first reported: “‘We've got cases moving in the very, very liberal Ninth Circuit, who, they've been hostile to the order,’ Sessions said. ‘We won a case in Virginia recently that was a nicely-written order that just demolished, I thought, all the arguments that some of the other people have been making. We are confident that the President will prevail on appeal and particularly in the Supreme Court, if not the Ninth Circuit. So this is a huge matter. I really am amazed that a judge sitting on an island in the Pacific can issue an order that stops the President of the United States from what appears to be clearly his statutory and Constitutional power.’”\nA judge sitting on an island in the Pacific? Hawaii’s two U.S. senators took offense with that characterization. “Mr. Attorney General: You voted for that judge. And that island is called Oahu. It's my home. Have some respect,” tweeted Sen. Brian Schatz (D-HI). Added Sen. Mazie Hirono (D-HI): “Hey Jeff Sessions, this #IslandinthePacific has been the 50th state for going on 58 years. And we won’t succumb to your dog whistle politics.”\nIs it Trump vs. Obama in France’s election?\nFinally, don’t miss what APPEARS to be dueling near-endorsements that Barack Obama and Donald Trump have made in France’s upcoming election. First from Obama's office yesterday: “President Obama spoke on the phone to Emmanuel Macron this morning. President Obama appreciated the opportunity to hear from Mr. Macron about his campaign and the important upcoming presidential election in France, a country that President Obama remains deeply committed to as a close ally of the United States, and as a leader on behalf of liberal values in Europe and around the world. An endorsement was not the purpose of the call, as President Obama is not making any formal endorsement in advance of the run-off election on Sunday.”\nAnd then this tweet from Donald Trump today: \"Another terrorist attack in Paris. The people of France will not take much more of this. Will have a big effect on presidential election!\" he tweeted (and you could argue this was aimed at helped Marine Le Pen).\nWhat were other presidents doing on April 21?",
    "label": 3
}