{
    "index": 415,
    "text": "Tennessee lawmakers pass 20-week abortion ban\nShow Caption Hide Caption Pro-choice protesters dress as handmaids in Tennessee capitol Pro-choice protesters dress as handmaids to oppose anti-abortion bill on Senate floor that could reach the governor before the end of the week. Jake Lowary/USA TODAY NETWORK - Tennessee\nNASHVILLE — Tennessee lawmakers gave final approval Wednesday to a bill that would create one of the strictest abortion laws in the country.\nAfter lengthy debate, the House voted along party lines on the Senate version of the bill, which passed that body Monday, and the proposal heads to Gov. Bill Haslam. The sponsor, GOP Rep. Matthew Hill of Jonesborough, Tenn., said the bill is similar to laws in 20 other states that prohibit abortion after 20 weeks of pregnancy and argued that none of them have faced successful court challenges.\n\"How anyone can advocate for the taking of that life after science and medicine have deemed it to be able to survive as an individual human being is beyond me,\" Hill said.\nThe Guttmacher Institute, a private research group that supports abortion rights, lists 14 states that ban abortions after the 20th week post fertilization. Two additional states ban it after the 20th week from the beginning of a woman's last menstrual period, which takes two weeks off a fetus' age at conception, and that would include Tennessee if Haslam signs the bill. Both Arizona's and Idaho's 20-week abortion bans were struck down separately in federal courts, and Supreme Court justices declined to hear Arizona's case in 2014.\n► April 26: Why Martha Plimpton wore a red 'A' to 'Handmaid's Tale' premiere\n► April 7: Kentucky's last remaining abortion clinic won't close — for now\nNo Republicans voted against Tennessee Senate Bill 1180, but nine, including House Speaker Beth Harwell, did not vote. Democrats were vocal in their opposition.\nThe bill also requires a test for fetal viability and gestational age before a doctor could perform an abortion and subjects doctors who violate the law to a felony charge that could carry up to 15 years in prison. Tennessee law does not define fetal viability.\nBabies born at 22 weeks after a woman's last menstrual period, 20 weeks after conception, are considered extremely preterm. Single-child pregnancies last an average of 40 weeks from the first day of the last menstrual period to birth, according to the American College of Obstetricians and Gynecologists.\n► January: ACLU files suit to block Kentucky abortion law passed in 4 days\n► December: Ohio governor vetoes 'heartbeat' abortion bill but passes 20-week ban\n► May 2016: S.C. governor signs 20-week abortion ban\nAbout a quarter of babies born at that 22-week last-menstrual-period age survived to toddlerhood, according to a study of almost 5,000 extremely early births at 24 hospitals in the Eunice Kennedy Shriver National Institute of Child Health and Human Development Neonatal Research Network. Babies born before that age have not survived.\nHaslam can sign the Tennessee bill into law, veto it or allow it to become law without his signature.\nTennessee's governor rarely has vetoed bills in the past and has said he reviews every piece of legislation before making a decision on what action to take. After the state Senate passed the bill Monday, Haslam said he would review the bill with his staff and Tennessee Attorney General Herbert Slatery before deciding what to do.\n► 2015: Senate Democrats block bill to ban abortions after 20 weeks\n► 2015: GOP presidential hopeful Scott Walker signs abortion ban\nInitially, Slatery said SB 1180 and another abortion-related bill filed earlier this year were “constitutionally suspect,” but the provisions he objected to were subsequently removed. But the attorney general also said he was prepared to defend the potential law if challenged in court.\nSlatery declined to enforce two other abortion-related measures after the Supreme Court struck down similar measures in a Texas case.\nOn the floor of the state House, Democratic Rep. Sherry Jones of Nashville presented one of the more fiery dissents of the bill, saying its target was all wrong.\n► 2014: Mississippi governor signs mid-pregnancy abortion ban\n► 2014: Court won't revive Arizona's 20-week abortion ban\n“What we need to do is punish men who can’t keep their zippers up,” she said, especially those who commit incest and rape.\nThe Tennessee Medical Association, a group that represents and lobbies on behalf of physicians has been neutral on the bill. Spokesman Dave Chaney said the group has been following the legislation closely \"because if it becomes law we will need to help our members understand the changes and ensure they practice within the confines of the law.\"\n► 2013: Groups sue to halt key parts of Texas abortion law\n► 2013: Republicans push to restrict abortion at state level\nJeff Teague, president and chief executive of Planned Parenthood of Middle and East Tennessee urged Haslam to veto the bill, saying he was disappointed but not surprised at the Legislature's action.\n\"(The bill) will violate a woman's guaranteed right as found by the U.S. Supreme Court to safe, legal abortion,\" he told The Tennessean in a text message Wednesday. He also said Tennessee would become one of the most restrictive states in the nation on women's reproductive rights.\nFollow Jake Lowary on Twitter: @JakeLowary",
    "label": 3
}