{
    "index": 493,
    "text": "Rep. Trey Gowdy, a former FBI contender, keeps making Republican short lists\nShow Caption Hide Caption Trump: Search for FBI Director moving 'rapidly' During a White House meeting Monday with with Abu Dhabi Crown Prince Sheikh Mohammed bin Zayed Al Nahyan, President Donald Trump said his search for an FBI Director is \"moving rapidly\" following his dismissal last week of James Comey. (May 15) AP\nWASHINGTON — People who know Rep. Trey Gowdy say he isn’t seeking powerful roles within the government and would rather be at home with his family, but Republicans — and even some Democrats — keep pushing him to do more.\nAfter the abrupt firing of FBI Director James Comey last week, the South Carolina Republican's name made it onto the short list of possible replacements for Comey's post. Gowdy withdrew his name from consideration late Monday afternoon.\nGowdy said he told Attorney General Jeff Sessions that the FBI director needed to have \"impeccable credentials\" and also \"unite the country as we strive for justice and truth.\" He also said that he shared with Sessions \"my firm conviction that I would not be right person.\"\nBut Gowdy has some fans, even across the aisle, who would have preferred to see him lead the law enforcement agency.\n“Dems are going to hate me for this. I don't care. The best replacement for Comey is Trey Gowdy. He's as honest as day is long,” tweeted former South Carolina State Rep. Bakari Sellers, who is a Democrat. Sellers posted the tweet last week before Gowdy withdrew.\nGowdy doesn’t seek out high-profile posts, and yet, he keeps getting put up for them. He’s on three of the most coveted House committees: Intelligence, Judiciary and Oversight. Gowdy also led the special committee to investigate the terrorist attack in Benghazi and recently was named as a top Republican in the House Intelligence Committee’s Russia probe.\nGowdy is close to Republican leadership and well-liked in the conference, plus he’s a former prosecutor and known for his in-depth — and often intense — lines of questioning. In his 16 years as a prosecutor Gowdy never lost a case, according to Rolling Stone.\n“Our voting records, if we were in Congress together, we would probably share about 3%, 4% of the same votes and those would probably be post office namings. But the fact is, based on what Donald Trump has to choose from, I’ll take Trey over any of those guys,” Sellers told USA TODAY before Gowdy withdrew from consideration. Sellers said Gowdy’s time as solicitor general of the 7th Circuit gives him credibility for the role: “Trey was always fair.”\nGowdy was one of two current Republican lawmakers being considered for the post, the other is Texas Sen. John Cornyn who is apparently still in the running. Former House Intelligence Chair and retired FBI agent Mike Rogers remain on the list. Other candidates come from within the FBI or have other law enforcement or legal backgrounds, according to the White House.\nRead more:\n“No, goodness gracious” Gowdy doesn’t seek out these opportunities, Sen. Tim Scott, R-S.C. told USA TODAY.\n“People keep asking him to do things that are uncomfortable for him because his skill set is such an unusual skill set as a prosecutor who looks for the truth and doesn’t really get into the debate,” said Scott, who has been close to Gowdy since the two were elected to the House of Representatives in 2010. “He’d be good at any leadership position that he decided to fill.”\nScott and Gowdy eat dinner together most nights the two are in Washington. Neither drinks alcohol and Scott said they’re both introverts — though if you’ve watched either in a public setting that statement may come as a surprise. They talk about scripture and Scott entertains Gowdy with stories of his dating life. Gowdy talks about his life being married with two kids. Through these conversations Scott has also been able to glean that staying in Congress is not a long-term goal of his friend’s. Gowdy's office declined to comment for this story.\n“He's perfect for that (FBI) post. America would be lucky,” said South Carolina attorney Beattie Ashmore before Gowdy dropped out. Ashmore worked as a federal prosecutor with Gowdy in the 1990s.\n\"I trust Trey’s judgement implicitly and I’ve been in the trenches with Trey,” Ashmore said.\n“He will do well at whatever he decides to do. (To) do something half-way is not in his DNA,” said Doug Smith a long-time friend of Gowdy’s and former Speaker Pro Tempore of the South Carolina House of Representatives.\nGowdy is currently in his fourth term in Congress which he won by two-thirds of the vote. And in this deeply Republican district where the primary essentially decides who will win, no Republicans have challenged him since his first race in 2010.\nGowdy led the Benghazi Committee’s probe into what happened during the 2012 terrorist attack in Benghazi, Libya that killed four Americans went for more than two years and cost $7.8 million.\nIn the end, the panel did not single out wrongdoing by former secretary of State Hillary Clinton but many Democrats accuse Gowdy and the panel’s Republicans of using the committee to mount a political attack against Clinton. The accusation was inflamed when House Majority Leader Kevin McCarthy, R-Calif., said during the campaign that because of the committee, Clinton’s poll numbers were dropping.\nRead more:\n“He is most well-known for using public roles to political ends and that may be something that President Trump likes about him but it’s the opposite of what bipartisan majorities in the Senate say they want,” Jesse Ferguson, a Democratic strategist and former spokesman for Clinton's presidential campaign, told USA TODAY.\nSen. Lindsey Graham, R-S.C., said that Trump should not appoint someone from Congress to head the FBI. Other Republican lawmakers have stressed the importance of someone who will act independently regardless of the political environment.\nGowdy \"weaponized his role with the oversight committee to target his political opponents in the last election. That’s what they do in (Russia’s intelligence, formerly known as the KGB) not our FBI,\" Ferguson continued.\nFormer South Carolina Democratic Party Chairman Dick Harpootlian was no fan of the Benghazi investigation or how Gowdy handled it, but he thinks that was just one piece of the Gowdy he knows.\n“He’s got a pretty level head on his shoulders. Now, those folks who only know him from the Hillary Clinton Benghazi House Committee hearing I don’t think have a fair view of him. I certainly did not think that went particularly well for him or the committee in the way it was handled,” said Harpootlian, who now works as an attorney in Columbia, S.C. “But having said that, Donald Trump could do a lot worse than Trey Gowdy — and I have a feeling he will.”\nThe new FBI director, among other things, will inherit the law enforcement agency’s investigation into Russian meddling the 2016 election. That role will include looking into possible connections to the Trump campaign.",
    "label": 3
}