{
    "index": 81,
    "text": "— -- Former acting Attorney General Sally Yates is set to testify today in front of the Senate Judiciary Subcommittee on Crime and Terrorism in a hearing on Russia's meddling in the 2016 election.\nHer very public firing by President Donald Trump was back in January after a career spanning more than 27 years with the Justice Department.\nNow it appears that she's come back to haunt the Trump administration.\nYates was previously scheduled to testify on March 28 at a House Intelligence Committee open hearing as part of its probe into Russia's interference in the 2016 election.\nA week before her expected testimony, committee Chair Devin Nunes, R-California, postponed the opening hearing, the same day Yates' attorney advised the Trump administration that she would testify about internal discussions she had about communications between Trump's former National Security Adviser Mike Flynn and Russian Ambassador Sergey Kislyak.\nSince then, reports have emerged that the Trump administration sought to block Yates' testimony. The White House has pushed back against those reports, maintaining that it took no such action.\nHere's a look at Yates ahead of her testimony today:\nName: Sally Quillian Yates (née Sally Caroline Quillian)\nFamily: She and her husband, Comer Yates, have a daughter, Kelley, and a son, James \"Quill.\" Comer Yates is the executive director of Atlanta Speech School, a school for children with hearing and learning disabilities, and is a lawyer by training. Comer Yates also ran unsuccessfully for Congress in 1994 and 1996.\nSally Yates comes from a family of lawyers. Her father, Kelley Quillian, was a judge on the Georgia Court of Appeals, and his father and brother were also lawyers. Her grandmother was admitted to the State Bar of Georgia, but because of the times, she did not become a lawyer.\nHometown: Atlanta, Georgia\nAge: 56 (Born Aug. 20, 1960)\nEducation: Sally Yates graduated from the University of Georgia in 1982 with a bachelor's degree in journalism. She went on to get her law degree at the University of Georgia School of Law.\nHer legal career: Sally Yates passed the State Bar of Georgia in 1986 and went to work for three years at the Atlanta office of King & Spalding, as a commercial litigation associate.\nShe joined the U.S. Attorney's Office in Atlanta in 1989. She started as assistant U.S. attorney, working her way up to chief of the Fraud and Public Corruption Section from 1994 to 2002 and then first assistant U.S. attorney from 2002 to 2010.\nShe was the lead prosecutor in the 1996 trial of Eric Rudolph, the man convicted of the bombing at Atlanta's Centennial Park during the 1996 Olympics.\n\"The Rudolph case was one of the most interesting cases I've ever done,\" she said in a 2013 interview with the Atlanta Journal-Constitution. \"Of all the cases I've done, that's the greatest example of the power of a team.\"\nSally Yates became the first woman U.S. attorney for the Northern District of Georgia when she was appointed by President Barack Obama in 2010 and held the position for almost five years.\nOn Jan. 8, 2015, Obama nominated Sally Yates as deputy attorney general and she was confirmed to the position on May 13, 2015.\nHer high-profile firing in January\nWhen Loretta Lynch, who became U.S. attorney general when Sally Yates became deputy, left the DOJ on Inauguration Day, Sally Yates stepped in as acting attorney general until then-Sen. Jeff Sessions would be confirmed to lead the DOJ.\nUnder Trump, Sally Yates' stint as acting attorney general lasted a total of 10 days.\nSally Yates was fired on Jan. 30 after she instructed the DOJ not to defend Trump’s Jan. 27 executive order barring immigration from seven predominantly Muslim countries. The order was later blocked in court.\nThe White House said in a statement that Sally Yates \"betrayed the Department of Justice by refusing to enforce a legal order designed to protect the citizens of the United States.\"\n\"Ms. Yates is an Obama Administration appointee who is weak on borders and very weak on illegal immigration,\" the statement read.\nIn a letter to top DOJ lawyers handling the cases related to Trump's executive order on immigration, Yates directed them to hold off from defending it.\n\"At present, I am not convinced that the defense of the Executive Order is consistent with these responsibilities nor am I convinced that the Executive Order is lawful,\" Sally Yates wrote.\nShe continued, \"Consequently, for as long as I am the Acting Attorney General, the Department of Justice will not present arguments in defense of the Executive Order, unless and until I become convinced that it is appropriate to do so.\"\nDana Boente took over for Sally Yates after she was fired, and Sessions was confirmed on Feb. 8 as attorney general.\nWhen she warned the White House about Flynn\nWhen she was still acting attorney general, Sally Yates had informed White House Counsel Don McGahn on Jan. 26 that they were misled by Flynn about the nature of his calls with Kislyak before Trump took office.\nSally Yates also conveyed concerns that Russia might try to blackmail Flynn.\nFlynn resigned from his position on Feb. 13.\nHer exchange with then-Sen. Sessions\nDuring her Senate confirmation hearing on March 24, 2015, Sally Yates had an interesting exchange with then-Sen. Sessions, who is now attorney general.\n\"Do you think the attorney general has a responsibility to say no to the president if he asks for something that's improper?\" Sessions asked Sally Yates.\nShe replied, \"Senator, I believe that the attorney general or the deputy attorney general has an obligation to follow the law and the Constitution, and to give their independent legal advice to the president.\"",
    "label": 2
}