{
    "index": 251,
    "text": "Washington (CNN) The slow pace of nominations in Rex Tillerson's State Department is making what a typically a chaotic transition process even more drawn out.\nAs the Trump administration works to fill nearly 100 senior State Department positions that need Senate confirmation, including over 60 ambassadorships, officials are confronting the enormity of that challenge and navigating a sea of red tape to ensure their policies are well-represented abroad.\nConfirming a US ambassador has never been easy, and the Trump administration might be moving slower than others -- but the pace is generally a tedious and time-consuming one.\nRegardless of who's running the State Department, to become an ambassador requires expertise, connections, patience and a willingness to wade through \"half a truckload of paper,\" according to one who knows.\nRonald Neumann, now president of the American Academy of Diplomacy, who went through the nominating process three times for ambassadorial posts.\nThe former Foreign Service officer said the length of the process can vary tremendously, and is especially challenging in the first year of a new administration.\n\"If the decision is made by the State Department, in coordination with the White House, to nominate you for an ambassadorship, the next thing that happens is you get about a half a truckload of paper,\" he noted.\nThat goes for both career State Department officials elevated to ambassadorships and political appointees chosen for their resumes or connections to the White House.\nThere are financial disclosure forms, questionnaires from senators, background documents, security forms and more.\n\"It's a lot of paper,\" said Neumann. \"It's not something you do for fun.\"\nGovernment lawyers then pour over the paperwork, which can be a time-consuming process for candidates with complicated business interests and investments or extensive foreign ties.\nIf the White House decides to move forward with a nomination after the rigorous review, they turn to the government of the host country for approval -- a process called \"agrément.\"\nIf the foreign government objects to a potential nominee -- which is rare -- the process ends then and there.\n\"At this point, nothing has normally been made public,\" said Neumann. \"All that gets done, and then they do the official nomination process, and then you start waiting for a senate confirmation.\"\nFirst, the nominee has a hearing in the Senate Foreign Relations Committee. If the committee members approve of the nomination, it goes to the full Senate for a vote. And because of Senate rules, any senator can hold up any nomination for any reason.\n\"I was nominated twice (as ambassador to) Bahrain because the first time was in the end of the Clinton administration, and they didn't get around to (holding a) hearing (for) me for various reasons and the nomination expired\" when Clinton left office, he recounted. \"So I had to wait to be re-nominated by the Bush administration.\"\n\"For several months nothing happened,\" he said. But that all changed on September 11, 2001, when the al Qaeda terror attacks put a spotlight on US policy in the Middle East.\n\"I got a call at noon that my hearing was at 5:30, and by 6:30 I was voted out of the committee, and I was voted off the floor the next day,\" he said. \"So (the process) can be very slow and then all of a sudden jerk into high gear.\"\nThe confirmation process has bedeviled all modern presidents, including Trump's recent predecessors, who also suffered long delays in getting their nominees named and confirmed.\nPresident Barack Obama had nominated only four country-based or international organization-based ambassadors by this stage of his first term, putting him behind Trump, who has formally nominated five, and had two -- UN Ambassador Nikki Haley and Ambassador to Israel David Friedman -- confirmed. George W. Bush had nominated just two by this date in 2001.\nBut Obama and Bush far outpaced Trump in nominating senior officials to positions at the State Department headquarters in Washington.\nBy this point in his first term, Bush had nominated four undersecretaries, eight assistant secretaries, a USAID administrator and other key personnel, including the director general of the Foreign Service, who manages the department staff, and the director of policy planning.\nObama at this same date had nominated one undersecretary and eight assistant secretaries.\nBoth had deputy secretaries confirmed and in place by the end of March.\nTrump nominated John Sullivan as deputy secretary in April, but has yet to name any people to these next critical tiers of the department. Sullivan is still waiting for his hearing.\nAs State Department spokesman Mark Toner said recently, the nomination process is under way and that \"with any new administration, it takes time.\"",
    "label": 3
}