{
    "index": 319,
    "text": "Racing to convey a sense of momentum to President Trump’s sluggish legislative agenda, the White House unveiled a plan for what it called “one of the biggest tax cuts in American history” Wednesday, just ahead of the administration’s symbolic first 100 days in office.\nThe one-page outline, touted as an overhaul of the tax code, bears the hallmark of other early Trump proposals: a broad-brush overview of bold goals that is intended to serve as an opening bid with Congress rather than a fully baked policy proposal.\nThe plan was immediately met with skepticism from budget groups and faces a daunting future on Capitol Hill. Lawmakers from both parties are wary that the White House hasn’t said how it would pay for the cuts, which likely would provide the greatest benefits to higher-income earners and corporations.\nAt its center is a large reduction in corporate tax rates, to 15% — from multinational corporations to mom-and-pop shops. The current U.S. corporate tax rate is 35%, the highest among developed economies, but many companies pay a lower rate by using deductions in the tax code.\nThe plan also reduces the number of personal income tax brackets from seven to three, with rates of 10%, 25% and a top rate of 35%.\nAdvertisement\nThe outline released by the White House lacks many basic details, including income requirements pegged to new tax brackets, any explanation of a new tax break for childcare expenses, or any analysis of how much it would increase the national debt.\nAmong the deductions it would eliminate would be one for the payment of state and local taxes. That would be a big hit to Californians and residents of other states with high taxes and high earners.\nThe proposal also would eliminate the inheritance tax on multi-million-dollar estates and cut a 3.8% tax on investment income imposed as part of Obamacare.\nIt would eliminate the alternative minimum tax, a backstop intended to prevent the highest earners from using deductions and other strategies to avoid paying substantial taxes. The alternative minimum tax increasingly forces upper-middle-class earners to pay more taxes because it doesn’t adjust for inflation.\nIt also would impose an undefined one-time tax on corporate profits held overseas in an attempt to bring the money back to U.S. operations.\nIn an attempt to simplify, the plan would eliminate most deductions used by higher earners, but would preserve those for charitable giving and home loans, among the costliest and most popular. It would also double the standard deduction, which currently is $12,700 for a married couple filing jointly.\n“This tax reform package is about growing the economy, creating jobs,” said Gary Cohn, director of Trump’s National Economic Council, who presented the plan at the White House briefing with Treasury Secretary Steven T. Mnuchin.\nThe plan is sure to meet resistance and refinement on Capitol Hill, among Democrats who oppose heavy tax breaks for high earners and corporate interests, Republicans who worry about the deficit, and lobbying interests concerned with the potential loss of favored deductions.\nDemocrats and some outside groups also complained that the proposal would chiefly benefit wealthy Americans like Trump personally, rather than middle-class wage earners.\nIn response to a question, Mnuchin said Trump had no intention of releasing his tax returns, further slamming the door on a dispute that has persisted since the campaign, when the billionaire businessman became the first major presidential candidate since the 1970s to refuse to let voters see how much he pays in taxes and details about his business deals and investments.\nBut Trump and his advisors cast it as a historic and long-overdue opportunity to rewrite tax laws that have grown increasingly complicated since the last major rewrite in 1986 under President Reagan.\n“This isn’t going to be easy. Doing big things never is,” Cohn said. “We will be attacked from the left and we’ll be attacked from the right, but one thing is certain: I would never, ever bet against this president. He will get this done for the American people.”\nIf the plan does not pay for itself, it would need support from at least some Democrats under current Senate rules. Some were quick to denounce it on Wednesday.\nSen. Ron Wyden of Oregon, the top Democrat on the Finance Committee, called the proposal “an unprincipled tax plan that will result in cuts for the 1%, conflicts for the president, crippling debt for America and crumbs for the working people.”\nRepublican leaders in the House have worked for years on their own plans, which now include a smaller tax break for companies – a drop to 20% for corporations and a maximum of 25% for pass-through companies.\nTheir plan also depends on a border adjustment tax to bring in $1 trillion in revenue over the next 10 years to help recover the cost of the lower rates.\nThat tax would subject importers, including retailers, to higher taxes and produce breaks for companies that export. The proposal has split the business community.\nMnuchin said the administration likes some aspects of the border tax but is not backing it now.\n“We will be working very closely… with the House and the Senate to turn this into a bill that can be passed and the president can sign,” he said of the administration proposal. “And there’s lots and lots of details that will go into how that will pay for itself.”\nRepublican leaders on Capitol Hill issued a joint statement Wednesday that fell short of an endorsement but said Trump’s outline will “serve as critical guideposts for Congress.”\nTrump’s advisors argued that the plan will pay for itself through economic growth. But most economists dispute that analysis, which could put Trump at odds with long-held Republican promises to trim the deficit.\nThe nonpartisan Tax Policy Center estimated that Trump’s campaign tax plan, which includes eliminating the alternative minimum tax and other changes along with the tax cut to corporations proposed Wednesday, would reduce federal revenue by $7.2 trillion over the first decade.\nMarc Short, Trump’s director of legislative affairs, was deliberately vague on that point during a meeting with reporters this week, saying the administration did not intend to order an analysis of the plan’s deficit impact at this stage.\nHe called paying for the tax cuts without borrowing money “the goal,” but said the administration would weigh in later on whether it would support a plan that does not meet that goal.\nInstead, the administration is arguing the overall benefits to the economy, which it says will be spurred by corporations eager to reinvest in American jobs.\nRepublicans plan to use controversial dynamic scoring, which assumes the effects of economic growth, to determine the tax plan’s effect on the budget.\nWhile cutting the corporate rate is straightforward, assuring that other businesses that file individual tax returns pay a 15% rate is much more complicated.\nThose companies are known as pass-through businesses because their income passes through the individual tax code. Many are small, owner-operated firms. But pass-throughs also can be large partnerships, such as hedge funds, law firms and some of Trump’s own businesses.\nMnuchin said the tax plan would be structured so the 15% rate “won’t be a loophole for rich people who should be paying higher rates.” He provided no details.\nDemocrats and many budget analysts are skeptical that Trump can slash business taxes without causing budget deficits to soar.\n“We definitely need tax reform as a way to grow the economy,” said Maya MacGuineas, president of the Committee for a Responsible Federal Budget.\nBut she said higher economic growth won’t offset the plan’s lost revenue and it needs to be paid for by reducing tax breaks or other measures.\n“What I don’t want to see is that this tax reform is going to be paid for by magic,” she said.\nSteven M. Rosenthal, a senior fellow at the Urban-Brookings Tax Policy Center, predicted that wealthy and sophisticated taxpayers would exploit the drop on the corporate tax rate to pay less in taxes on their income.\n“The middle and working class cannot,” he said. “This piece of their plan will exacerbate inequality—and increase complexity.”\nBut some conservative groups applauded. Americans for Prosperity called it “a giant leap forward.”\nTrump’s interest in announcing the plan this week appeared to catch some of his advisors and allies on Capitol Hill off guard.\nThe president has dismissed the 100-day measuring stick, a tradition for presidents since the 1930s, as irrelevant. But he also has pushed his aides to make a vigorous case for his accomplishments ahead of Saturday’s 100th day in office.\nA major legislative achievement has been a big gap on his early resume, hampered by the failure to craft a viable replacement plan for President Obama’s signature healthcare bill.\nPutting forth a partial tax plan at this stage carries risks. Trump has made other bold pushes only to retreat, which could hurt his negotiating position on Capitol Hill.\nHe gave lawmakers an ultimatum during the House healthcare debate, demanding an up-or-down vote, only to pull back at the last minute to preserve negotiations for later. The bill was pulled before a vote to avoid a loss on the floor.\nThis week, he backed down from a showdown with Congress over funding his signature promise to build a border wall in a supplemental budget request, choosing to fight for money later rather than risk a partial government shutdown on Friday.\nStaff writer Lisa Mascaro contributed to this article.\nnoah.bierman@latimes.com\nTwitter: @noahbierman\nALSO\nTrump signs order to reconsider national monuments created by Obama, George W. Bush and Clinton\nHere’s where Trump’s campaign promises stand\nTrump, Bush or Obama? Test your knowledge of the president’s first 100 days\nUPDATES:\n4:35 p.m.: Updated to clarify the proposed change to the standard deduction.\n2:10 p.m.: This story was updated with details from the press conference.\nThis story was first published at 10:30 a.m.",
    "label": 3
}