{
    "index": 436,
    "text": "Three key findings in new report analyze polling and the 2016 election\nPolls leading up to Election Day showed Hillary Clinton winning the 2016 presidential election. And as we know, the polls were wrong.\nAccording to a new report out Thursday from the American Association for Public Opinion Research, there were a variety of factors why Donald Trump triumphed on Nov. 8. A few key findings:\n1. The national polls weren't wrong\nPer the report, national polls found that Clinton had a 3-point lead over Trump. In the end, Clinton won the popular vote -- what national polls most accurately predict -- by 2 points. Most years, the reasonable conclusion would be that the person who won the popular vote would also win the presidency. (Prior to 2016, there were only four times in U.S. history when a candidate won the popular vote but lost the election.)\n2. Polls did show the race was competitive — at the state level\nClinton only had a slim advantage in battleground states, the report noted. A closer look at the state-level polls found that Trump was only ever one state away from winning the election. Still, polls in Pennsylvania, Michigan and Wisconsin underestimated the levels of support Trump had, for a few different factors: voter preference did change in the last week, polls did not adjust for the over-representation of college graduates and some Trump voters did not want to reveal themselves as Trump voters. The report noted that state polls are often underfunded.\n3. Those 90% predictions that Clinton was likely to win may have affected turnout\nSeveral forecasts from academics and data journalists found that Clinton was likely to win by 90%. That led people to believe that she would win, and that may have had \"unknown consequences\" on turnout, the report said. Additionally, it pointed out that there's a difference between polls, which measures findings as a \"snapshot in time,\" and election forecasting models, which predict a future event.\nThe report said that 2016 should not be an \"indictment\" on polling.\n\"The performance of election polls is not a good indicator of the quality of surveys in general for several reasons,\" the report reads. \"Election polls are unique among surveys in that they not only have to field a representative sample of the public but they also have to correctly identify likely voters.\"\nRead the full report here.",
    "label": 3
}