{
    "index": 307,
    "text": "President Trump on Friday is expected to sign an executive order that could open large parts of the Pacific, Arctic and Atlantic oceans to new oil and gas drilling, a prospect that elicited a fierce backlash in California and elsewhere even before details of the order were clear.\nThe move, which is certain to face legal and political challenges, could undo a plan finalized late in President Obama’s second term that sought to limit fossil fuel development and fight climate change by not including new drilling leases off the coast of California or Alaska during the current five-year federal offshore plan, which extends through 2022.\nMany leaders in California have long sought a permanent ban on new leasing offshore, and they reacted swiftly to the possibility that drilling could expand.\n“California will fight this every step of the way,” Sen. Dianne Feinstein (D-Calif.) said late Thursday. “We do not want oil drilling off our coast. Period.”\nThe directive, called the America First Offshore Energy Executive Order, also would reverse a broad permanent ban Obama put in place in most of the Arctic’s Beaufort and Chukchi seas.\nAdvertisement\nBy late Thursday, that move and the possibility of any changes to the leasing plan were already prompting vows of legal challenges and public resistance.\nRevising the leasing program could take two years or more under federal rule-making procedures and would require public input, while attempting to reverse the permanent ban in the Arctic would wade into what experts say is murky legal territory.\nAlthough debate over Arctic drilling has persisted for years — Royal Dutch Shell conducted exploratory drilling there in 2015 — the public has been largely aligned against expanding offshore drilling in California for decades.\nThe Trump administration seemed to acknowledge that expanding drilling in California could be an uphill battle.\nInterior Secretary Ryan Zinke (Carolyn Kaster / Associated Press)\nIn a briefing about the order, Interior Secretary Ryan Zinke, who would carry out the directive, emphasized that the administration will weigh public opinion in areas where drilling might occur, and he noted California’s opposition.\n“I was out in Santa Barbara recently,” he said. “There’s a lot of people who don’t like it out there.”\nStill, California officials were not appeased. Some cited the massive 1969 spill off the coast of Santa Barbara that helped launch the modern environmental movement. Others pointed to the state’s ongoing effort to reduce the role of fossil fuels and boost renewable energy.\nAlthough 27 oil platforms continue operating off the state’s coast, new drilling leases have been banned in state waters since 1969, and no new leases have been issued in federal waters since 1984.\nLt. Gov. Gavin Newsom, who serves as chairman of the California State Lands Commission, suggested that the state could prevent new pipelines from being constructed between drill rigs and the shore.\n“California’s door is closed to President Trump’s Pacific oil and gas drilling,” Newsom said in an emailed statement, adding that the commission “is unequivocally resolved to create an environmental rampart along California’s coast.”\nGov. Jerry Brown joined the governors of Oregon and Washington in a joint statement that recalled spills off the coasts of all three states.\n“We remember the oil-soaked beaches and wildlife and the devastating economic impacts to local communities and the fishing industry,” the governors said. “Now is not the time to turn back the clock. We cannot return to the days where the federal government put the interests of big oil above our communities and treasured coastline.”\nThe Arctic presents a different political dynamic.\nExperts say as many as 24 billion barrels of oil and 104 trillion cubic feet of natural gas could be extracted from beneath the region’s sea floor off the coast of Alaska, and state leaders there have long pushed to open the area for drilling, in part to help offset declining production on land.\nBut the region is fraught with challenges, including its remote location and brutal conditions, rare and vulnerable whale and walrus species, and the high cost of working there at a time when oil prices are low.\nShell’s effort to drill there in 2015, after spending more than seven years and $7 billion in planning, ended with the company saying its results were disappointing and that it would abandon the region for the foreseeable future.\nLast year, then-Interior Secretary Sally Jewell cited “the unique and challenging Arctic environment and industry’s declining interest in the area” as reasons not to issue new leases there.\nAlaska leaders dismissed the Obama administration’s actions as disconnected from the will of most state residents. Sen. Lisa Murkowski, a Republican, accused the former president of treating Alaska like “a snow globe” and expressed hope that Trump would reverse Obama’s actions.\nEnvironmental groups questioned Trump’s legal authority to issue the new order and railed against his rejection of Obama’s climate efforts.\n“We’ll fight this move to sell out our children’s future for big oil and gas,” said Rhea Suh, president of the Natural Resources Defense Council.\nTrump’s order is not a surprise. Throughout his campaign, he vowed to roll back environmental regulations. After Trump won, Obama made more moves that experts said could stir novel legal fights.\nTo issue the permanent drilling ban in the Arctic, Obama relied on the rarely used Outer Continental Shelf Lands Act of 1953. The act says the president “may, from time to time, withdraw” federal waters from oil and gas development that are not already leased, but it does not specify whether another president can reverse a withdrawal.\nThe Trump order goes beyond questions of leasing. It also will instruct Commerce Secretary Wilbur Ross not to create or expand national marine sanctuaries and to review designations and expansions of marine sanctuaries created in the past decade. The fact sheet provided by the White House said it wanted to determine whether there is “energy or mineral resource potential” within monument areas.\nTimes staff writers Evan Halper and Noah Bierman in Washington contributed to this report.\nwilliam.yardley@latimes.com\nTwitter: @yardleyLAT\nchris.megerian@latimes.com\nTwitter: @ChrisMegerian\nALSO\nWikipedia co-founder Jimmy Wales says he has a plan to fix fake news\nPresident Trump has backed off many of his provocative foreign policy promises\nThe mainstream and conservative media are living in different worlds. So are those who read them",
    "label": 3
}