{
    "index": 809,
    "text": "TRUMP AGENDA: Takeaways from Trump's Tax Plan\nBenjy Sarlin sums up seven takeaways from Trump’s tax proposal.\nMore, from the Washington Post: “Trump’s proposal now poses key tests for both parties. Republicans, who for years chided President Barack Obama about any plan to raise the deficit, must decide whether to back a plan that many budget experts calculate will add to record levels of government debt… Democrats, meanwhile, must decide whether to negotiate with an unpopular president who is threatening to pull away tax revenue that pays for many of their cherished social programs.”\nThe New York Times writes that winners from the plan include businesses with high tax rates, very high income earners and Donald Trump himself.\nWith the new plan, Trump is promising to do what Ronald Reagan could not, the Washington Post notes: Create a tax plan that stimulates so much growth that it pays for itself.\nCan it actually pass? The Wall Street Journal: “Unless Mr. Trump can attract votes from Democrats—which appears unlikely—the plan must comply with legislative procedures that allow for a party-line vote in the Senate, where Republicans have 52 seats out of 100. The key to those procedures: Any tax plan can’t increase budget deficits beyond a 10-year period. The Committee for a Responsible Federal Budget said Wednesday that the plan would cost about $5.5 trillion in lost revenue over a decade. Those limitations could lead Republicans to make some or all of the tax cuts temporary to limit the long-run fiscal effect.”\nMeanwhile: What’s going on with health care? Leigh Ann Caldwell: “The once-sidelined Republican effort to repeal and replace Obamacare received a shot of momentum Wednesday as a group of conservative House Republicans came out in support of the bill after proposed changes to the underlying legislation. The announcement by the Freedom Caucus changes the dynamics of the discussion and could provide enough votes for House Republicans to pass the measure.”\nBut, as POLITICO notes, the Senate might not be on board.\nCaldwell also reports on the latest maneuvering to avoid a government shutdown tomorrow.\nAfter threatening to pull out of NAFTA, the Trump administration now says it will begin talks to renegotiate the agreement but not to cancel it.\nSpeaking of promises: Jane Timm keeps track of the promises Trump has made — but not kept so far.\nAlex Seitz-Wald speaks to “Mexico’s Hillary Clinton” about Donald Trump’s wall.\nOFF TO THE RACES\nGA-06: The Congressional Leadership Fund is going to pump another $2.5 million into advertising.\nThe Atlanta Journal-Constitution looks at why Karen Handel has decided to embrace Donald Trump in the runoff.\nMD-GOV: Maryland’s Democratic primary race has the first of what’s expected to be a crowded slate of candidates for governor.\nMT-AL: Rob Quist will appear with Alyssa Milano at a student rally Thursday.\nSC-05: Mike Huckabee is wading into the GOP primary, backing former state GOP chairman Chad Connelly.",
    "label": 3
}