{
    "index": 422,
    "text": "House passes bill to fund government through September\nShow Caption Hide Caption Congress passes $1.1 trillion spending bill The House easily passed a $1.1 trillion governmentwide spending bill on Wednesday, awarding wins to both Democrats and Republicans while putting off until later this year fights over President Donald Trump's promised border wall with Mexico and massive military buildup. (May 3) AP\nWASHINGTON — The House voted Wednesday to approve a bipartisan deal to fund the government through September and prevent a shutdown — at least for the next five months.\nHouse members voted 309-118 to pass the $1.1 trillion spending bill, which funds federal agencies and boosts defense spending through the remainder of fiscal year 2017. Current funding was set to expire at midnight Friday unless Congress acted. The Senate is poised to approve the legislation no later than Thursday, and President Trump is expected to sign the bill.\nRepublicans were divided on the bill, with more than 100 of them voting against it. In contrast, fewer than 20 Democrats opposed the bill.\nThe Republican majority had to work with Democrats to get enough votes to pass the bill and avert a shutdown. As a result, both Democrats and Republicans could claim victory for putting some of their spending priorities in the legislation.\n\"Every member of this House has a victory somewhere in this bill,\" said Rep. Tom Cole, R-Okla., who serves on the House Appropriations Committee. \"This shows all of us that we have the ability ... to sit down and work together for the good of the country.\"\nHowever, Trump, who was going through the funding process for the first time, was angered by Democrats boasting about how they fought off a White House request for $1.4 billion to begin construction of a wall along the U.S.-Mexico border. Trump tweeted Tuesday that he doesn't want to have to compromise with Democrats in the future and that, \"Our country needs a good shutdown in September to fix mess!\"\nRead more:\nThe president made his comments just as Congress is beginning work on spending bills for fiscal year 2018, which will once again require bipartisan agreement.\n\"We'll be back here with a stopgap (funding) measure and repeat this same crisis routine,\" predicted Rep. Alcee Hastings of Florida, the senior Democrat on the House Rules Committee. \"Maybe next time we'll skip the grandstanding and start off with a commonsense measure from the get-go.\"\nThe bill approved by the House on Wednesday includes $15 billion of a $30 billion request from Trump for extra funding for defense programs and combat operations in Afghanistan, Iraq and Syria. It also includes $1.5 billion in additional funding for border security, which was half of a $3 billion request from Trump. Although the president did not get funding for his wall, the bill gives the administration about $341 million to replace some existing border fencing, including about 40 miles of fencing in Arizona and California.\nCongressional negotiators of both parties rejected Trump's proposal to cut $18 billion from non-defense spending. The bill would reduce funding for the Environmental Protection Agency by about 1% and freeze funding for the Internal Revenue Service. It boosts defense spending by more than $25 billion for the full 2017 fiscal year, which Republicans touted as a major victory.\nThe bill does not include Trump's proposals to defund Planned Parenthood, hire more Immigration and Customs Enforcement agents, or restrict \"sanctuary cities\" from receiving federal grants.\nThe legislation provides $2 billion in additional funding for medical research at the National Institutes of Health. It also includes $100 million more to reduce opioid addiction, more than $130 million in additional funds for the Substance Abuse and Mental Health Administration, and $30 million more for grants to help states fund mental health programs for low-income residents. There also is more than $1 billion for a permanent extension of health insurance benefits for retired union mine workers and their families.\nThe bill also includes nearly $296 million to plug an emergency budget shortfall in Puerto Rico so that the U.S. territory won't run out of Medicaid funding this year. Democrats fought for the provision for the economically struggling territory, which declared bankruptcy Wednesday.\nLocal law enforcement agencies in New York and Florida would be reimbursed for a total of $68 million for the cost of helping the Secret Service protect Trump and his family when they are at Trump Tower in New York City or at the Mar-a-Lago estate in Florida.\nThe states of California, Louisiana, North Carolina and West Virginia would share more than $8 billion in disaster relief after being hit hard by floods, wildfires and other disasters during the past two years.",
    "label": 3
}