{
    "index": 380,
    "text": "A Los Angeles City Council candidate seeking to represent a heavily Latino district apologized for comments he made about Mexicans in a YouTube video posted online nearly a decade ago but said the video was intended for the popular “Ask a Mexican” column in the OC Weekly.\nJoe Bray-Ali, who is challenging City Councilman Gil Cedillo for the Council District 1 seat, appeared in a video titled “Ask a Mexican — Mexican Doorbell” that is posted to his YouTube page.\nIn the video, Bray-Ali holds his young daughter and speaks directly to the camera.\n“Dear Mexican, I’d like to know why all my neighbors think that the doorbell is a car horn. They wake up my baby,” Bray-Ali says.\nBelow the 13-second video is text reading, “Why do some of my neighbors think that their car’s horn is a doorbell? The asians, whites, and other groups I live near don’t honk to tell their friends they have arrived. What is up with the mexicans?”\nAdvertisement\nMichael Atkins, campaign spokesman for Bray-Ali, said Thursday that the video was intended to be a question for Gustavo Arellano’s “Ask a Mexican” column in the OC Weekly.\nAtkins’ comments came after he sent out a statement in which Bray-Ali apologized for the video. That initial statement didn’t explain that Bray-Ali was pitching the question to Arellano. The campaign spokesman said he hadn’t gotten a full explanation from Bray-Ali about the video.\nThe “Ask a Mexican” column is a humorous take on Mexican Americans’ behavior, with Arellano responding to readers’ questions.\nAsked why Bray-Ali issued an apology for the video if it was supposed to be directed toward Arellano, Atkins said the apology is intended for anyone offended by Bray-Ali’s comments.\nAtkins added that Cedillo was conducting a “smear campaign” by sending the video to reporters.\nBray-Ali’s ancestry is Indian, Hungarian and Irish. He’s married to a Mexican Chinese woman.\n“Joe apologizes,” Atkins said of the video. “He says the comment was stupid and it’s amazing how social media can remind of the mistakes of youth. This was nine years ago.”\nComedian George Lopez has made a similar joke about car horns and doorbells, Atkins said.\nA link to the video was sent to reporters Wednesday by Cedillo’s team after Bray-Ali called on the council member to denounce a racist comment made during a heated campaign debate Monday night in Westlake.\nAn audience member shouted out, “Go back to India,” to Bray-Ali, sparking outrage among his supporters.\nCedillo said in a statement Wednesday that he didn’t hear what was said but that he denounces the India comment.\n“I know from personal experience how hateful remarks can hurt. That is why I would like Mr. Bray-Ali to explain remarks he made on a YouTube video on March 9, 2008,” Cedillo said.\nBray-Ali, a bike activist, and Cedillo were the top two vote-getters in the March 7 primary election to represent Council District 1, which takes in several northeast neighborhoods and includes Westlake and Chinatown.\nThe runoff is May 16.\ndakota.smith@latimes.com\nTwitter: @dakotacdsmith\nALSO\nMan is fatally shot in the Leimert Park area\nAnother set of fossils discovered at Metro subway excavation site\nFeds say they didn’t deport ‘Dreamer,’ but acknowledge error on his DACA status\nUPDATES:\n1:30 p.m.: This article was updated with the Bray-Ali spokesman’s comments about the OC Weekly column.\nThis article was originally published on April 19 at 9:15 p.m..",
    "label": 3
}