{
    "index": 374,
    "text": "Good morning, and welcome to the Essential California newsletter. It’s Tuesday, April 25, and here’s what’s happening across California:\nTOP STORIES\nWhat Garcetti didn’t mention\nLast week at his State of the City speech, Los Angeles Mayor Eric Garcetti neglected to mention the more than $1.1 billion needed to pay for city employees’ pensions and healthcare after they retire. The cost of retiree benefits amounts to nearly 20% of the city’s general fund, which pays for basic city services. In 2002, the figure was less than 5%. “Every municipal government is feeling this pain,” said Joe Nation, a former Democratic state legislator who teaches at Stanford University’s Institute for Economic Policy Research. Los Angeles Times\nThe statue that started a debate\nA proposed statue with a Chinese face has sparked resistance and acrimonious debate in Monterey Park. A nonprofit proposed temporarily placing the statue near a fountain that was the centerpiece of a housing development with an ugly history: Midwick View Estates was meant for whites only. Los Angeles Times\nAdvertisement\nThe NRA targets gun control laws\nThe state affiliate of the National Rifle Assn. on Monday filed the first in a series of planned court challenges opposing sweeping new gun control laws approved in California after the San Bernardino terrorist attacks. Los Angeles Times\nMore charging stations for Teslas\nTesla will nearly double the size of its Supercharger electric car-charging network this year to 10,000 public charging units globally, up from 5,400, the company said Monday. California will get 1,000 of the new charging units. Los Angeles Times\nPlus: Here are seven reasons why investors are betting big that Tesla can’t accelerate from producing 80,000 vehicles a year to 500,000 in 2018. Los Angeles Times\nL.A. STORIES\nBannon’s Hollywood adventure: President Trump’s senior advisor Stephen K. Bannon cut his teeth and made millions in Hollywood. Here’s what he actually did during his time on the West Coast. The New Yorker\nA Mormon goes viral: Meet Greg Trimble, a Riverside Mormon who started a blog about the Church of Jesus Christ of Latter-day Saints. Mormons like his blog because he tackles tough topics and fearlessly shares his opinions. The Desert News\nQuestionable posters: Sabo, a right-wing street artist in Los Angeles, is raising eyebrows with advertisements posted around town that depict Caitlyn Jenner as the scary clown from Stephen King’s “It.” Los Angeles Times\nIMMIGRATION AND THE BORDER\nIn the shadows: About 1 in 8 students in California schools has at least one parent who is in the country illegally, according to a new brief from the Education Trust-West. EdSource\nAbout that wall: It’s an open secret on Capitol Hill: Trump may want a “big, beautiful” border wall, but few in Congress are willing to pay for it. The dispute may determine if the government is forced to shut down Friday. Los Angeles Times\nAbout that wall, Part 2: Former Los Angeles Times reporter Sonia Nazario won a Pulitzer Prize covering immigration. She argues that building a wall won’t secure the border. Los Angeles Times\nPOLITICS AND GOVERNMENT\nTime for reform: Tax reform is not just a pressing issue at the federal level. Times columnist George Skelton says it’s time for California to stop leaning on the rich and take up state tax reform. Los Angeles Times\nMeet the candidates: Republican businessman John Cox made his fortune in potato chips, and now the San Diego County resident is using his own money in his campaign for governor of California. KQED\nA different type of vending machine: UC Davis is one of the first college campuses in the country to have a vending machine that offers the Plan B emergency contraceptive, otherwise known as the “morning after pill.” Fox 40\nCRIME AND COURTS\nBound for court: A UC Berkeley student group on Monday filed a lawsuit demanding that the university allow conservative pundit Ann Coulter to speak on campus Thursday as originally planned. Los Angeles Times\nTrouble in prison: California Department of Corrections officers may face punitive damages after a mentally ill inmate was dragged from a cell and pepper-sprayed. Sacramento Bee\nArsonist sentenced: Dawud Abdulwali was sentenced to 15 years in prison for starting a massive fire at the Da Vinci apartment complex in downtown L.A. Prosecutors said he set the fire in anger over fatal police shootings of African Americans in Ferguson, Mo., and other cities. Los Angeles Times\nNo sign of missing boy: The father of a 5-year-old boy who vanished from a South Pasadena park has been arrested in connection with the disappearance. The boy was last seen about 8 a.m. April 15, when his mother handed him off to his father in Baldwin Park. Los Angeles Times\nTHE ENVIRONMENT\nCalifornia versus Trump: California is moving forward with more stringent emissions rules, setting up an expected showdown with the Trump administration. NBC News\nCat struggles: “Researchers analyzed thousands of saber-toothed cat bones from the La Brea Tar Pits — sludgy oil seeps found in the middle of Los Angeles — and found that the cats frequently injured their spines, likely through violent episodes of twisting and straining.” Popular Science\nCALIFORNIA CULTURE\nThe Comeback Kid: Joe Montana is getting a street named for him in San Francisco, but while standing onstage inside City Hall and holding a street sign that read “Joe Montana Drive,” he respectfully asked that the name be changed to “Montana-Clark Drive,” to honor his ailing friend and onetime teammate Dwight Clark. Los Angeles Times\nRemembering a legend: Selena Quintanilla-Pérez, the Mexican American singer, was murdered more than 20 years ago, but her fans still gather to celebrate her life, including at Plaza de la Raza in Lincoln Park, near her old home in Los Angeles. New York Times\nMake a reservation: The San Francisco Chronicle last week released its list of 25 rising star chefs. For the first time ever, the list includes no white men. San Francisco Chronicle\nWhat a building: Described as “the best constructed public building in the country” when it opened, the U.S. Court of Appeals building in San Francisco’s South of Market “reads like a love letter to granite and marble.” Curbed San Francisco\nCALIFORNIA ALMANAC\nLos Angeles area: partly cloudy Tuesday, sunny Wednesday. Sacramento and San Diego: partly cloudy Tuesday and Wednesday. San Francisco area: partly cloudy Tuesday, cloudy Wednesday: More weather is here.\nAND FINALLY\nToday’s California memory comes from Glenn Scott:\n“In 1982, I went to the San Diego airport to wait for my wife returning from a work trip. I entered the bar to wait. Upon entering, I noticed Paul Williams, the singer, songwriter and actor, sitting at the bar with a friend. I approached him, told him how much I enjoyed his work and offered to buy him a drink. Instead, he bought me a drink and we had a good time discussing his work.”\nIf you have a memory or story about the Golden State, share it with us. Send us an email to let us know what you love or fondly remember about our state. (Please keep your story to 100 words.)\nPlease let us know what we can do to make this newsletter more useful to you. Send comments, complaints and ideas to Benjamin Oreskes and Shelby Grad. Also follow them on Twitter @boreskes and @shelbygrad.",
    "label": 3
}