{
    "index": 147,
    "text": "A New York state senator has filed a bill that would require the New York State Department of Taxation and Finance to release New York State income tax returns for all government officials elected statewide — including the president of the United States.\n\"If lawmakers in Washington won't force president Trump to release his tax returns, lawmakers in Albany should do it instead,\" Democratic state Sen. Brad Hoylman, who introduced the bill, said in a recent statement. \"New Yorkers deserve to know if statewide officials — including Trump — pay their fair share of taxes.\"\nHoylman's proposed legislation requires the New York Taxation Department's website to post current officials' preceding five years' worth of tax returns within 30 days of the bill's passage, or in the case of future officials, within 30 days of taking the oath of office. It would apply to all records the department has on file for the president, vice president, U.S. senators from New York, the governor, lieutenant governor, comptroller and attorney general.\nPresident Trump is legally a resident of New York.\nHoylman also filed another piece of legislation in December, the T.R.U.M.P. (Tax Returns Uniformly Made Public) Act, requiring presidential and vice presidential candidates to disclose at least five years' worth of federal income tax returns to appear on the ballot in New York state and receive votes from New York's representatives in the Electoral College.\nBoth bills are currently in committee.\nNew Jersey Governor Chris Christie recently vetoed legislation that would force presidential and vice-presidential candidates for office to file a copy of their federal income tax returns in order to appear on the state's ballot.\nGov. Christie, a frequent ally to President Donald Trump, called the bill a \"transparent political stunt masquerading as a bill\" in a forceful veto statement on Monday, calling it \"politics at its worst.\"\nThe White House continues to face pressure to release the president's tax returns, particularly as the administration rolls out its plan for tax cuts. Secretary of Treasury Steve Mnuchin said last week that Mr. Trump has \"no intention\" of releasing his returns, although Mr. Trump told CBS News' \"Face The Nation\" on Sunday that he never spoke with Mnuchin about his returns.",
    "label": 3
}