{
    "index": 365,
    "text": "Good morning, and welcome to the Essential California newsletter. It’s Tuesday, May 2, and here’s what’s happening across California:\nTOP STORIES\nDisciplined sheriff’s officials get promoted\nDespite having histories of serious discipline within the department, two L.A. sheriff’s officials were recently promoted. The action runs the risk of “putting people in supervisory positions who are compromised,” said Sam Walker, a retired criminal justice professor at the University of Nebraska at Omaha. “People know their records,” he said, adding that it is difficult for supervisors to punish one of their underlings if they themselves have a history of serious discipline. Los Angeles Times\nMay Day protests fill downtown L.A.\nThe electronic screen hanging over a stage outside City Hall in downtown Los Angeles on Monday morning seemed to encapsulate the message of this year’s May Day protests in one word: Resist. Thousands of demonstrators gathered in downtown Los Angeles on Monday in a series of protests that took aim at President Trump’s policies on immigrants here illegally. Los Angeles Times\nAdvertisement\nWho is funding the candidates?\nThe small field of candidates hoping to succeed Gov. Jerry Brown next year has been raking in cash. So far the five candidates have raised more than $20 million, with Lt. Gov. Gavin Newsom raising $11.8 million. Asian American business leaders have contributed large sums to John Chiang, while Antonio Villaraigosa has reached out to wealthy Angelenos. Los Angeles Times\nLosing the housing race\nDevelopers in California are adding homes, relative to population growth, at a far higher pace than in recent years. But it’s still below what experts believe would be enough to keep up with California’s growing population, which topped 39.5 million last year. Los Angeles Times\nL.A. STORIES\nWriters strike averted: After several weeks of tense negotiations, the Writers Guild of America has reached a tentative deal with the major studios and networks for a new film and TV contract, avoiding disruption to productions nationwide. Los Angeles Times\nSenator in the spotlight: Sen. Kamala Harris follows in a long tradition of newcomer senators who enter office with a high profile and a desire to get things done. Harris has leveraged the pushback to the Trump presidency to become a key figure in the resistance movement. CNN\nWho is in the jail? The Twin Towers Correctional Facility is home to about 4,000 mentally ill inmates, which is about 30% of the county’s total jail population. This makes it likely the largest home of mentally ill inmates in the country. Associated Press\nBuilding fights in the Valley: Welcome to Pacoima, where a charter school and L.A. Unified have worked together on the building of innovative classrooms, even as the school system and charter association battle in court over funds for future construction projects. Los Angeles Times\nIMMIGRATION AND THE BORDER\nWill the wall get built? President Trump’s “big beautiful wall” is not in the $1-trillion spending plan to keep the government open through September, and Congress hasn’t shown much appetite for the idea. Los Angeles Times\nThe final green-card lottery? Even as Trump calls for dramatic restrictions on immigration, millions of people are hoping to win what could be the last U.S. green-card lottery. Washington Post\nInside a detention center: California’s largest immigration detention center is near San Bernardino. There are more than 1,800 immigrants there awaiting hearings or deportation after being arrested by U.S. Immigration and Customs Enforcement agents. Reuters\nCross-border bid: Meet the Cetys University women’s volleyball team, which is hoping to become the first Mexican member of the NCAA. New York Times\nPOLITICS AND GOVERNMENT\nDrilling site complaints: Los Angeles city officials say that an oil drilling site at a Westside golf course has flouted city rules by repeatedly installing new equipment without city approval. Los Angeles Times\nDeduct the deduction? A closer look at the proposed elimination of the federal deduction for local and state income taxes, a key aspect of the Trump tax plan. It is something that residents of high-income states such as California rely on to lower their tax rate. Californians deducted $101 billion in state income taxes in 2014, by far the most of any state. Los Angeles Times\nHow city employees’ pay stacks up: San Jose’s city manager and police chief led their counterparts at more than 200 other California cities in pay and benefits in 2016, and other Bay Area public employees received hundreds of thousands of dollars in overtime pay, new compensation data released Monday show. The Mercury News\nWhat a meltdown: Joe Bray-Ali’s campaign for L.A. City Council has crashed hard, but maybe voters and political observers should’ve seen it coming. LA Weekly\nCRIME AND COURTS\nMore details about the San Diego shooting: The man who opened fire on a pool party at a luxury San Diego apartment complex Sunday was distraught over a recent breakup and called his ex-girlfriend as he fired round after round, police said Monday. Peter Selis, a 49-year-old car mechanic who had been struggling with massive financial debt in recent weeks, killed one person and wounded several others before being fatally shot by police. Los Angeles Times\nA law stands: The U.S. Supreme Court has again rejected a challenge to California’s ban on so-called gay conversion therapy, letting the 2012 law stand without comment. A San Diego minister and others had argued the law violated their 1st Amendment religious freedoms. Los Angeles Times\nTHE ENVIRONMENT\nWildfire: A fast-moving wildfire that threatened homes in Riverside County on Sunday grew to at least 1,350 acres early Monday, officials said. Los Angeles Times\nMelting snow: The Sierra snowpack is huge — and melting fast. This could lead to large amounts of flooding this spring and into the summer. Sacramento Bee\nFun story: Here’s how a fishing boat in Sausalito is being used to save the state’s salmon population. ABC 7\nCALIFORNIA CULTURE\nA new arts center: Cheech Marin is teaming with the city of Riverside and the Riverside Art Museum to develop a Chicano art center. “It’ll be the one place worldwide that everybody can go to for all things Chicano art,” Marin said. Los Angeles Times\nWhere to go: Here are the some of the best things to eat in the Bay Area. San Francisco Chronicle\nWhere to go, Part 2: The Los Angeles Times Food Bowl began yesterday and goes all month. Here’s a list of all the events that will happen. Los Angeles Times\nFun for the summer: An iconic Mid-City roller rink, World on Wheels, will reopen this summer. LAist\nCALIFORNIA ALMANAC\nSacramento and Los Angeles area: partly cloudy Tuesday, sunny Wednesday. San Diego and San Francisco area: sunny Tuesday and Wednesday. More weather is here.\nAND FINALLY\nToday’s California memory comes from Glenn Davis:\n“The morning after the Rodney King verdict, I boarded a British Airways jet nonstop for LAX. I was in training for a commercial pilot rating at the time so knew our approach to L.A. would be ‘different.’ The pilot explained we were going out over Malibu (instead of the usual 52-mile straight-in approach) and landing downwind — as people were shooting at planes approaching the runways from the land side. Our 747 kept some extra speed to do that landing safely, then I was met by a driver in baggage claim to take me home to Irvine. The driver explained that the 405 was closed, but he was going to take it anyway, as it was the fastest way home, and no one was patrolling an empty freeway. In the car, he told me to get down behind the seats and don’t show my head. He was driving well in excess of 100 mph when we approached Long Beach. He told me to get up and look at the city — which seemed like a wall of flame. My sister was attending a convention there and was trapped in the Sheraton (I later found out) for four days.”\nIf you have a memory or story about the Golden State, share it with us. Send us an email to let us know what you love or fondly remember about our state. (Please keep your story to 100 words.)\nPlease let us know what we can do to make this newsletter more useful to you. Send comments, complaints and ideas to Benjamin Oreskes and Shelby Grad. Also follow them on Twitter @boreskes and @shelbygrad.",
    "label": 3
}