{
    "index": 404,
    "text": "Republicans miss 100-day target but still feel pressure to get Obamacare repeal done\nWASHINGTON — House Republicans will not vote to repeal and replace Obamacare within the first 100 days of President Trump’s administration, but what exactly that means for future timing of a vote remains unclear.\nLate Thursday night, House Republican leaders announced they did not have the 216 votes needed to bring legislation to a vote, despite a new amendment that brought on support of a significant number of conservatives earlier this week.\nThe amendment was negotiated by Rep. Tom MacArthur, a New Jersey Republican who co-chairs the moderate Tuesday Group, and Rep. Mark Meadows, R-N.C., who chairs the conservative Freedom Caucus. With the change, states can apply for waivers that would allow them to opt out of insurance mandates created by the Affordable Care Act.\nThe amendment brought on at least 80% of the roughly three-dozen members of the Freedom Caucus, whose members had helped kill an earlier effort to bring to the floor a repeal bill they thought did not go far enough.\nRead more:\nBut the changes also pushed away some moderates who, among other things, are concerned about a lack of cost protections for people with pre-existing conditions.\nBoth MacArthur and Meadows insisted that just because there wouldn’t be a vote on health care before Saturday — which will be Trump’s 100th day in office — that does not mean there is no urgency to bring the bill to the floor as soon as possible.\n“I’m still talking to members, whipping members today,” Meadows said. “Even though we’ve heard from leadership that there’s not going to be a vote today, I’m still working as if there is. And so, I think there still is the pressure to make sure that we have enough votes to pass it.”\n“This is our moment. If we fail now, that law becomes permanent,” MacArthur said about the Affordable Care Act, adding he’d be open to changes to his amendment if it brought more people on board.\nAt least 15 members are solid “no's\" on the health care bill, and another handful are “leaning no” or undecided. Some members, such as Rep. Mario Diaz-Balart, R-Fla., were a \"yes\" on the previous legislation but are now back to undecided after the MacArthur amendment was added. Republicans can lose only about 20 votes before the legislation fails because no Democrats are expected to vote for it.\nRep. Chris Collins, R-N.Y., a moderate member of the Tuesday Group who backs the bill and is close to the president, dismissed the 100-day deadline as something made-up by the press.\n“There was never any 100-day pressure,” Collins said. “Because the press is focused on 100 days, of course the president is as well, but it’s an artificial number.”\n“I think we’re taking our time, you know, the MacArthur amendment has got to be explained in more detail to some of the moderates who don’t fully see how the waiver program might work, how it’s not as onerous or draconian as they may think,” he continued.\nThe White House had been pushing for a vote to repeal and replace Obamacare — one of Trump’s campaign promises — before Saturday. In an interview with Fox News, which will air Friday night, Trump said he was \"disappointed\" with the way Republicans had handled some key policy issues, including health care.\n“I’m disappointed that it doesn’t go quicker. I like them a lot,\" Trump said. \"I’ll tell you Paul Ryan’s trying very, very hard. I think everybody is trying very hard. It is a very tough system.”\nHouse Speaker Paul Ryan, R-Wis., has consistently tried to tamp down expectations that there would be a vote before Trump’s 100-day mark or even that one was on the horizon.\n“We will go when we have the votes,” Ryan told reporters earlier Thursday.",
    "label": 3
}