{
    "index": 297,
    "text": "President Trump on Saturday skipped the White House Correspondents’ Dinner to mark his 100th day in office doing what got him there: taking his populist message directly to an adoring audience, this one in Pennsylvania, the state he credits with delivering his surprise electoral college win in November.\nTrump revived the racially charged speech that infused his election campaign, lashing out at immigrants and promising to jail or deport anyone who doesn’t belong in the United States.\nHe also promised to restore coal mining jobs, though without detail about how that would happen.\n“We are not going to let other countries take advantage of us anymore. From now on it’s going to be America first,” Trump said.\nThe rally unfolded like a greatest hits of Trump’s most polarizing refrains. He prompted loud cheers for promising to keep radical Islamic terrorism out of the country, deport immigrants in the country illegally and build a wall along the border with Mexico.\nAdvertisement\nWhen Trump hammered the media, people in the crowd turned around to jeer and boo at reporters typing on their laptops in the press area on the arena floor.\nAmong the many signs seen in the crowd were: “Promises made. Promises kept,” “Drain the swamp” and “Women for Trump.” Young girls could be heard chanting “We want Trump!” The sound system played a rendition of “My Way.”\nThe rally coincided with an event staged by one of Trump’s favorite foils, the White House press corps, which held its annual dinner Saturday night in Washington — one of the first such dinners in more than three decades not attended by the sitting president.\nTrump’s speech started at the same time as the White House Correspondents’ Dinner, but administration officials said it wasn’t scheduled to take attention away from the event, sometimes called the “nerd prom.”\n“I respectfully suggest that it’s not just about the Correspondents’ Dinner; it’s rather an opportunity for him to talk to voters that elected him and what he’s been able to accomplish in the first 100 days,” White House Press Secretary Sean Spicer told reporters Friday.\nThe media were favorite targets of Trump during the campaign, and he went after them Saturday in Pennsylvania, once again accusing them of reporting “fake news” and adding that they deserve “a big, fat, failing grade.” Alluding to the dinner he was skipping in Washington, he predicted the black-tie event would be a “very, very boring” affair.\n“I could not possibly be more thrilled than to be more than 100 miles away from Washington’s swamp, spending my evening with all of you and with a much, much larger crowd and much better people, right?” the president said.\nThe rally took place at the Pennsylvania Farm Show Complex & Expo Center, 50 miles from where Trump made his 100-day compact with voters in October, and Trump recounted what he touted as major accomplishments in the first 100 days of his presidency.\nChief among them: He placed a conservative Justice Neil M. Gorsuch on the Supreme Court, revamped orders to allow immigration agents to deport more people in the country illegally, and initiated a program to roll back regulations on businesses and environmental protection.\nBut more than half of his 30-plus executive orders simply told Cabinet agencies to study a problem and come up with recommendations. Trump hasn’t repealed and replaced the Affordable Care Act or torn up the North American Free Trade Agreement or the Iran nuclear deal, as he pledged last year.\nAfter talking tough on Chinese trade practices, he has agreed not to name China a currency manipulator as he promised. And his efforts to ban travelers from select Muslim-majority nations have been blocked in court.\nThe White House announcement last week of an ambitious plan to cut taxes was rolled out as a one-page document with bullet points, not as a policy proposal to Congress.\nTrump, who had no government or military experience before he ran for president, acknowledged this week that running the government is tougher than he expected.\n“This is more work than in my previous life. I thought it would be easier,” Trump told Reuters in an interview Thursday.\nDuring that interview, he handed out maps showing which parts of the country he carried in November. His advisors say he is still fixated on the daily news cycle and often asks how a decision will play in the media before he chooses a path forward.\nThe 100th day of his presidency on Saturday also triggered protests around the country by tens of thousands of demonstrators who denounced the administration’s rejection of scientific claims on climate change and its action on other environmental issues.\nParticipants in the People’s Climate March said they objected to Trump’s rollback of restrictions on mining, oil drilling and greenhouse gas emissions at coal-fired power plants, among other things.\nTrump is the first sitting president to skip the White House Correspondents’ Dinner since Ronald Reagan, who didn’t attend in 1981 because he was recovering from being shot the previous month.\nAt the 2011 dinner, Trump was roasted by then-President Obama after several weeks of the billionaire businessman’s appearing on news shows spreading the false conspiracy theory that Obama wasn’t born in the United States. People close to Trump, who was in the audience that night, have said his humiliation that night spurred him to seriously consider a White House bid.\nbrian.bennett@latimes.com\nTwitter: @ByBrianBennett\nALSO\nTrump stumbled on healthcare and immigration, but he’s been ‘a wrecking ball’ on the environment\nWhy 100 days? Trump thinks the benchmark is lame. Is he right?\n100 days in, Trump’s supporters back him, but some doubts have begun to show",
    "label": 3
}