{
    "index": 100,
    "text": "President Donald Trump said Saturday he \"will not be happy\" if North Korea conducts another nuclear test, and he declined to rule out a U.S. military response to such a provocation.\n\"I don't know. I mean, we'll see,\" Mr. Trump said of possible military action during an interview with CBS News' John Dickerson that will air Sunday on \"Face the Nation\" and Monday on \"CBS This Morning.\"\nThe interview came just one day after North Korea test-launched a ballistic missile Friday from the western portion of the country. The launch, which failed shortly after lift-off, came after recent U.S. pressure on North Korea to cease its provocative behavior.\n\"Mr. President, you and the administration said to North Korea, 'Don't test a missile.' They have tested a missile. Is the pressure not working?\" Dickerson asked Mr. Trump.\n\"Well, I didn't say, 'Don't test a missile,'\" the president began. \"He's going to have to do what he has to do. But he understands we're not going to be very happy. And I will tell you, a man that I've gotten to like and respect -- the president of China, President Xi -- I believe has been putting pressure on him also. But so far, perhaps nothing's happened and perhaps it has. This was a small missile. This was not a big missile. This was not a nuclear test, which he was expected to do three days ago. We'll see what happens.\"\nDickerson followed up, \"You say, 'Not happy' -- what does that mean?\"\n\"I would not be happy,\" Mr. Trump repeated. \"If he does a nuclear test, I will not be happy. And I can tell you also, I don't believe that the president of China, who is a very respected man, will be happy either.\"\n\"'Not happy' mean military action?\" Dickerson asked.\n\"I don't know,\" the president responded. \"I mean, we'll see.\"\nMake sure you tune into \"Face the Nation\" this Sunday for the first part of John Dickerson's interview with President Trump, taping at the White House and in Harrisburg, Pennsylvania, on Saturday, April 29th, Mr. Trump's 100th day in office. More of the interview will air in a live broadcast of \"CBS This Morning\" from the East Room of the White House on Monday, May 1.",
    "label": 3
}