{
    "index": 388,
    "text": "To snap a photo of the Hollywood sign, tourists have clogged hillside streets and hiking paths, spurring battles in Hollywood Hills neighborhoods and in court over how people should be able to access the iconic landmark.\nNow Mayor Eric Garcetti has floated an alternative: Building a gondola to ferry visitors to the beloved sign.\n“What could we do to actually bring people to the summit, to where the Hollywood sign is, without going through the neighborhoods to the south?” Garcetti mused during an interview on ABC 7.\nThe idea isn’t new to Hollywood residents or activists. Leron Gubler, president and CEO of the Hollywood Chamber of Commerce, said the suggestion dates back at least two decades and had been mentioned before by former City Councilman Tom LaBonge.\nIn the past, “everybody just viewed that as a pipe dream,” Gubler said.\nAdvertisement\nBut after the city closed off a Beachwood Drive gate leading to one of the most popular trails, there is fresh debate over how Los Angeles can both protect neighborhoods and ensure access to the sign.\nLos Angeles started blocking the gate after a legal fight over hordes of hikers trekking near a Beachwood Drive ranch, interfering with its day-to-day use. Griffith Park preservationists are challenging that move, arguing that the city should have considered alternative ways to protect the ranch while preserving pedestrian access.\nA gondola “would certainly provide another access point for tourists,” said Marian Dodge, president of Friends of Griffith Park, one of the groups contesting the city decision.\n“But it would not resolve the problem for residents who want to walk up their street and go for a hike,” Dodge said.\nNo formal proposal for the gondola exists. Garcetti told ABC 7 he had been discussing ideas with City Councilman David Ryu, who represents Beachwood Canyon and other affected parts of the Hollywood Hills. Spokesman Estevan Montemayor said it was “one of many ideas” that Ryu was open to.\n“However, at this point, it’s just an idea,” Montemayor said, stressing that the councilman was focused on a new study that would help guide decisions surrounding the Hollywood sign.\nGarcetti spokesman George Kivork said in a written statement Monday that the mayor was “open to exploring ideas that ease congestion and encourages creative thinking when looking at ways to give Angelenos and tourists better access to the Hollywood sign and other iconic landmarks and destinations.”\nIn his televised interview, Garcetti suggested a gondola could come from the Universal Studios area and generate revenue to relieve traffic and improve Griffith Park.\nHollywood Hills resident Jeffrey Briggs said “anything is better than the current situation.” But he questioned whether tourists gazing up at the sign from Hollywood Boulevard would be willing to go elsewhere for a gondola ride.\n“If you’re sitting here in Hollywood and someone tells you, ‘You have to go take the 101,’ you’re going to say, ‘Why can’t I just go straight to it?’” said Briggs, an attorney who provides legal advice to the Hollywood Sign Trust.\nBriggs suggested that the city could instead create a viewing platform in the Hollywood area. Others have pitched the idea of a Ferris wheel.\nBut there has been scant debate on many of the most ambitious ideas, Briggs said, because “no one believes the city can pull it off.”\nInstalling a gondola could face other obstacles: Dodge said the city would have to be careful to avoid spoiling the view from below and pointed out that the sign itself is designated as a historic monument.\nGubler, the head of the Hollywood Chamber of Commerce, added that the idea would likely have to go through extensive environmental studies.\nNeighborhood groups might also raise concerns: Sarajane Schwartz, who was part of a group of Beachwood Canyon homeowners who sued the city over the onslaught of tourist traffic, said noise could be a potential problem in the canyons. If the city wants to make money, she argued, it needs to shut down park entrances that are not approved by the parks commission.\n“Why would people pay money if they can go to a bootlegged entrance for free?” said Schwartz, whose group recently dismissed its lawsuit against the city.\nBut other residents argue that the city should provide lots of ways to reach the sign — including at the Beachwood Drive gate.\n“This park is for the public,” said Fran Reichenbach, founder of the Beachwood Canyon Neighborhood Assn.\nGubler said that the escalating tensions over the Hollywood sign could prod the city to finally examine the longstanding idea.\n“And now that the mayor is suggesting it,” Gubler added, “that may give it a little more traction.”\nemily.alpert@latimes.com\nTwitter: @LATimesEmily",
    "label": 3
}