{
    "index": 329,
    "text": "The latest version of the Republican effort to repeal and replace the Affordable Care Act is teetering on the verge of failure as the conversation among Republicans on Capitol Hill has shifted to soul-searching and recriminations over what went wrong in their long campaign to end Obamacare.\nThough House leaders say they have not given up on the effort, no vote is planned and some senior GOP lawmakers signaled their dissent.\nA failure to vote before the House goes on recess at the end of the week would mark the third time Republicans tried to muster support from their ranks to advance the healthcare overhaul, only to have to make an embarrassing retreat at the last minute.\nHouse Speaker Paul D. Ryan and other leaders, including Vice President Mike Pence, engaged in a flurry of closed-door meetings Tuesday at the Capitol. Some estimates put the vote count within single digits of the 216 needed for passage, but others numbered Republican defections at more than 30, well over the 22 the party can afford to lose.\nRank-and-file lawmakers say they are being bombarded by calls to their offices and protests at home. Of particular concern is that this latest version of the bill contains a provision, added to attract votes from conservatives, that would effectively end Obamacare’s guarantee of insurance coverage for those with preexisting conditions.\nAdvertisement\nStates could allow insurers to charge sick people more and offer them coverage through so-called high-risk pools, which many states operated before Obamacare. But experts and consumer advocates panned this arrangement as unaffordable.\n“They’re scared,” said Rep. Tom Rooney (R-Fla.), whose district voted for President Trump. “[They] feel like they’re about to lose it and they’re going to die. And if we cannot explain to people that is not going to happen, then it’s going to be very difficult to ever bring a bill to the floor.”\nMany lawmakers expressed frustration at having to figure out on their own how the recent changes to the bill would affect consumers.\nThey complain that Trump should be playing a bigger role, explaining the legislation to wary voters, while others bemoan that Congress never dug into the thorny policy details to devise a workable healthcare alternative.\nAmong the notable recent defections was Rep. Fred Upton (R-Mich.), former chairman of a key committee that approved the bill earlier this year. He told the Michigan radio station WHTC-AM on Tuesday that he was now opposed, uncomfortable with latest revisions, according to the Detroit News.\nLeaders have indicated they will no longer be making adjustments to the bill, the American Health Care Act, because tweaks made to win support from the conservative House Freedom Caucus have only served to chase away centrists Republicans.\nGOP Reps. Ken Calvert of Corona and Dana Rohrabacher of Costa Mesa are among those who supported the original version of the bill but have backed away from the amended version. Another, Rep. Doug LaMalfa of Richvale, remained undecided.\n“That’s part of my own internal struggle — if we do something and it’s still harmful to a lot of folks,” La Malfa said.\nThe growing prospect that Trump and Ryan won’t get the votes to advance the healthcare bill doesn’t necessarily kill the long Obamacare repeal effort. But G. William Hoagland, a former Senate Republican budget official who is now senior vice president at the Bipartisan Policy Center, said failing to get a vote by Friday would make it very difficult for House Republicans to carry on their repeal campaign much longer.\n“At a certain point, the politics become hard to sustain and it comes time to call it like it is and move on,” he said.\nThere has been very little enthusiasm among Senate Republicans for the House bill. That means less incentive for House Republicans to risk political backlash for a bill that faces such an uncertain future in the Senate.\nSenate Majority Leader Mitch McConnell of Kentucky did little to calm those fears Tuesday when he suggested passage in the Senate would be a “real big challenge.”\nThe longer the hunt for votes drags on, the more it exposes lawmakers to the risks of doing nothing or approving a bill that, so far, polls show has little public support.\n“They’ve got a trifecta going,” said House Minority Leader Nancy Pelosi (D-San Francisco) during an interview Tuesday with the Los Angeles Times.\n“They lose if they bring it up and it passes the House and the Senate and then the public sees what that is — that’s a loser. They lose if they bring it up in the House and they can’t pass it in the Senate because they’ve now walked the plank for nothing. And then they’re now in another losing situation because it doesn’t appear that they’re going to have the votes.”\n“It is doggie doo on their shoe,” Pelosi said. “They cannot get away from it.”\nTrump and House Republican leaders labored in recent days to push the bill forward, making the case that it would not threaten critical health protections in the Affordable Care Act.\nOver the weekend, Trump and other administration officials tried to argue that Americans with preexisting medical conditions would still be protected.\n“Health care plan is on its way,” Trump wrote in one tweet. “Will have much lower premiums & deductibles while at the same time taking care of pre-existing conditions!”\nBut the legislation’s sweeping cuts to healthcare assistance for millions of low- and moderate-income Americans — some 24 million more people would likely be without insurance with the bill — energized a nationwide resistance movement against it.\nAt the same time, not a single major group representing doctors, hospitals and patients supported the House legislation.\nRyan echoed Trump’s promise, insisting that proposed changes to the House bill by Rep. Tom MacArthur (R-N.J.) would force states that scrap Obamacare protections to offer other options, such as special high-risk health plans for patients with preexisting conditions.\nBut the MacArthur amendment was greeted with derision by leading physician and patient groups — including the American Diabetes Assn., the March of Dimes and the advocacy arm of the American Cancer Society — which warned in increasingly stark language that it would be disastrous for sick Americans.\nStill, MacArthur was among those who warned that the window for action was closing.\n“It’s this week or it’s very difficult,” said the former insurance executive. “How many times are we going to go through this?”\nlisa.mascaro@latimes.com\nTwitter: @LisaMascaro\nnoam.levey@latimes.com\nsarah.wire@latimes.com\nALSO\nQ&A: Filibuster, cloture and what the ‘nuclear option’ means for Gorsuch nomination and the Senate’s future\nWhat we learned about Neil Gorsuch during his Supreme Court confirmation hearing\nGorsuch set to be confirmed to the Supreme Court, but will the fight over Trump’s pick break the Senate?\nMore coverage of Congress\nMore coverage of politics and the White House",
    "label": 3
}