{
    "index": 7,
    "text": "— -- President Trump today said he is \"proud\" to follow in the footsteps of \"our wonderful Ronald Reagan\" by speaking at a National Rifle Association event.\n\"In the history of the organization and today I am also proud to be the first sitting president to address the NRA leadership forum since our wonderful Ronald Reagan in 1983,\" Trump said.\nToday's meeting, at the NRA's Leadership Forum in Atlanta, isn't Trump's first speech to the gun rights group. He was endorsed by the NRA in May and spoke at their convention at the time.\n\"Only one candidate in the general election came to speak to you and that candidate is now the president of the United States standing before you again,\" Trump said of himself during his speech.\n\"The eight year assault on your Second Amendment freedoms has come to a crashing end. You have a true friend and champion in the White House,\" Trump said.\nThe NRA is known for their sizable lobbying operation and by raising money for -- and against -- candidates. The group made over $52 million in donations to candidates during the 2016 election, according to the Center for Responsive Politics. They spent $30.3 million in support of Trump, the CRP reported.\nTrump campaigned on the pledge to support and protect the Second Amendment, which, he said during his May NRA appearance, was \"under a threat like never before.\" He pointed to his then-rival Hillary Clinton as the basis for that threat.\n\"Hillary Clinton wants to abolish the Second Amendment, not change it; she wants to abolish it,\" Trump said at the time, although Clinton had never made such claims.\nTrump has noted that his two eldest sons, Donald Jr. and Eric, have been longtime members of the NRA.\nAt today's speech, Trump stressed their love of shooting.\n\"I can tell you, both sons, they love the outdoors. Frankly, I think they love the outdoors more than they love by a long shot Fifth Avenue, but that's OK,\" Trump joked.\nAfter starting the speech by reviewing the state-by-state wins on election night, Trump talked about the work that he has done on behalf of gun owners. He talked about various appointments he has made, including the nomination and eventual addition of Neil Gorsuch to the Supreme Court, as well as Interior Secretary Ryan Zinke, Attorney General Jeff Sessions and Secretary of Homeland Security John Kelly.\nHundreds of protesters and gun control advocates gathered near the convention site this morning, The Atlanta Journal-Constitution reported today.\nThere will be another protest Saturday, and Democratic Rep. John Lewis of Georgia is scheduled to attend. Lewis and Trump have a turbulent history. Lewis did not attend the inauguration and said he did not see Trump as a \"legitimate president.\" Trump returned the favor by criticizing the civil rights leader, saying that he was \"all talk, talk, talk -- no action or results.\"",
    "label": 2
}