{
    "index": 114,
    "text": "The House will vote on the GOP's proposed health care bill Thursday, according to Majority Leader Kevin McCarthy's office.\nThe vote on the long-awaited health care bill is expected to take place early Thursday afternoon. The vote comes more than a month after the GOP's first failed attempt, when the vote was called off due to a lack of support, and before Congress goes into recess for 11 days.\nHouse leadership has been working to attract enough votes to pass the bill. Last week, Speaker Paul Ryan, R-Wisconsin, told reporters, \"We're going to go when we have the votes, but that's the decision we'll make when we have it.\" The House Freedom Caucus -- many members of which opposed the health care proposals introduced earlier this year -- has endorsed the latest attempt at health care reform.\nThe GOP can only afford to lose 22 votes for the measure to pass.\nAs of Thursday evening, the proposed legislation had no public scoring from the Congressional Budget Office.\nThe GOP health care push has been controversial, especially over questions about whether it will cover pre-existing conditions. On CBS' \"Face The Nation\" Sunday, President Trump pledged it would.\nHouse Minority Leader Nancy Pelosi issued a statement blasting the new bill, saying, \"From the beginning, Trumpcare has meant higher health costs, more than 24 million hard-working Americans losing health coverage, gutting key protections, a crushing age tax, and stealing from Medicare. With each passing week, Republicans have only made their bill more costly and more cruel to American families.\n\"If Republicans pass Trumpcare, Americans with pre-existing conditions will be pushed off their insurance and segregated into high risk pools – where they will face soaring costs, worse coverage, and restricted care. Trumpcare spells heart-stopping premium increases for Americans with anything from asthma to cancer. It's a frightening future for families who need affordable, dependable health care the most.\n\"Forcing a vote without a CBO score shows that Republicans are terrified of the public learning the full consequences of their plan to push Americans with pre-existing conditions into the cold. But (Thursday), House Republicans are going to tattoo this moral monstrosity to their foreheads, and the American people will hold them accountable.\"\nCBS News' Rebecca Shabad contributed to this report.",
    "label": 3
}