{
    "index": 149,
    "text": "WASHINGTON -- One day after House Republicans passed a bill to repeal and replace Obamacare, Republicans in the Senate said they're writing their own bill -- from scratch.\nThe House bill would have profound impacts on Americans who get their health care through Medicaid.\nDr. Gwen Graddy runs a program called Pace, providing comprehensive care for 600 frail and elderly patients in Detroit. Like nearly 70 million Americans, they are all enrolled in Medicaid.\nWithout it, \"a number of these people would prematurely end up in nursing homes,\" Graddy says.\n\"Or number two, these people would end up in emergency rooms getting their primary care and ultimately end up in hospitals receiving care,\" she says.\nThe GOP plan that passed Thursday would, for the first time, place caps on federal Medicaid funding to states starting in 2020.\nThe bill would halt federal payments for Obamacare's expansion of Medicaid to people living just above the poverty line.\nThe 32 states that participated in that expansion would now have to either fund that coverage themselves, cut benefits or cut enrollment. Michigan is one of those states.\n\"We're talking about the elderly, we're talking about children, we're talking about disabled, we're talking about mental illness,\" Graddy says. \"Any individual that would be eligible for the benefits that would come out of a Medicaid program would be limited in what's available for them.\"\nAll told, the GOP bill would cut an estimated $900 billion from Medicaid over the next 10 years, reducing Medicaid's ranks by 14 million people.\nMany Republicans, like Sen. Rand Paul of Kentucky, argue there's no choice.\n\"We do not have enough for Medicare, we do not have enough for Social Security, we do not have enough for Medicaid -- before we got started on the expansion of Medicaid,\" Paul said Friday during a speech at the Cato Institute.\nHouse Republicans say their Medicaid reforms would give states more flexibility. But many Republican governors oppose the cuts. One even called them \"devastating.\" And they are urging the Senate to make some serious changes to that bill.",
    "label": 2
}