{
    "index": 488,
    "text": "OnPolitics Today: Who needs spies when the president might tell you himself?\nIt was shaping up to be a quiet Monday, OnPolitics peeps. And then this happened: The Washington Post broke a major story about President Trump reportedly revealing CLASSIFIED INFORMATION to the RUSSIANS. The White House, of course, is denying the report.\nAnd that is how our Monday night has gone.\nIt's OnPolitics Today, or the Roundup Formerly Known As For the Record. Subscribe here.\nTrump may have revealed classified information\nWe can't even joke about this one. Our president, the commander-in-chief of the United States, allegedly told the Russian foreign minister and the Russian ambassador classified information. According to the Post, Trump described details of an Islamic State threat related to using laptop computers on aircraft. Additionally, he revealed the city in the Islamic State's territory where a U.S. intelligence partner detected the threat – which could damage a critical source of intelligence on the terror group. The reaction went about the way you expected it to. The White House called the story \"false.\" The Democrats are, for lack of a better phrase, freaking the heck out. As of 8 p.m., three whole Republicans, including House Speaker Paul Ryan, have expressed their concerns. As commander-in-chief, Trump *can* do this. But should he? Our favorite summation comes from Democratic Sen. Martin Heinrich of New Mexico: \"Protip: Don’t give the Russians classified information. #Classified101\"\nHe said, he said\nSpeaking of whether things are true or not, here is a fact for you: there are a number of times when the White House and Trump have said things that are false. Like the time when Sean Spicer insisted that the Trump inauguration had \"the largest audience.\" Or the time that the president claimed he had been wiretapped by the Obama administration. Or the time that the firing of James Comey was pinned on the deputy attorney general (see below). Trump faces the largest credibility gap since since Richard Nixon (who, you know, resigned) and Lyndon B. Johnson (who, you know, decided not to run for a second term). And here's the thing: That doesn't appear to really bother the president, as USA TODAY's Susan Page notes.\nOh yeah and the Comey fallout is still ongoing obviously\nHas it really been less than a week since news broke that the president fired FBI director James Comey? Here's what you need to know about the latest: Deputy Attorney General Rod Rosenstein — aka the guy that was blamed for the firing before Trump told everyone, \"No, it was MY IDEA\" (not an actual quote) — will brief senators on Thursday about said decision on Comey. That sounds absolutely awful for Rosenstein, especially since Democrats are skeptical over the reasoning given for Comey's firing (namely, that he mishandled the investigation in Hillary Clinton's emails). Also, the White House still isn't going to say a thing about whether there are Comey tapes and the meetings between Trump and Comey meetings were highly unorthodox to begin with.\nElsewhere in politics land",
    "label": 2
}