{
    "index": 125,
    "text": "Barack Obama proposed to a serious girlfriend before he met his eventual wife Michelle, according to a new biography of the former president.\nThe book – \"Rising Star: The Making of Barack Obama\" by David J. Garrow – was reviewed Wednesday in The Washington Post. The review details the book's assessment of Obama's relationship with Sheila Miyoshi Jager, who is now a professor at Oberlin College in Ohio.\nJager told Garrow that Obama asked her to marry him in the winter of 1986. Jager's parents objected to the union, believing her to be too young, as she was in her early 20s and two years younger than Obama.\nTheir romance continued, but Jaeger says his political ambitions got in the way. Possessed by a sense that he was destined to a life in politics, and could even become the first African-American president, she says race soon cast a shadow over their relationship.\n\"I remember very clearly when this transformation happened, and I remember very specifically that by 1987, about a year into our relationship, he already had his sights on becoming president,\" Jaeger told Garrow.\nObama kept his personal ambitions and private life separate for a time, Jager says. But eventually, she says, according to Garrow, that Obama found her ethnicity a serious political handicap. Jagar is of Dutch and Japanese heritage, while Obama increasingly looked to rise by embracing his African-American background.\nGarrow notes that, for a young black politician on the rise in Chicago, a racially mixed marriage could be a liability. He details the trials of an African-American state senator with a white wife who had to fend off accusations that he \"talks black but sleeps white.\" He also quotes Carol Moseley Braun, who became Illinois' first African-American senator and whose ex-husband was white, as saying \"interracial marriage really restricts your political options.\"\nAccording to Jager, such considerations weighed heavily on Obama and put great strain on their relationship. A mutual friend of the couple told Garrow he remembered Obama saying, \"The lines are very clearly drawn…If I am going out with a white woman, I have no standing here.\" Obama, known as Barry for much of his young life, started going by Barack, and Jaeger recounts him becoming \"irrationally furious\" when she called him by his old nickname during a trip to Hawaii.\n\"He told me that under no circumstances was I ever to use that name with him,\" Jaeger says.\nObama eventually asked Jaeger to marry him again before he departed for Harvard Law School. He wanted her to come with him, she says, despite their increasingly fraught relationship, \"mostly, I think, out of a sense of desperation over our eventual parting and not in any real faith in our future.\"\nAt Harvard Law, Garrow writes, Obama irritated fellow students with his penchant for classroom oratory even as he was broadly admired on campus. He then became the first African-American chief editor of the Harvard Law Review, a moving moment for the other black editors on staff that gave the young Obama his first taste of national attention.\nAfter his first year at Harvard, Obama returned to Chicago as a summer associate at a prestigious local law firm. There he met Michelle Robinson, the future first lady and an employee at the firm. Their relationship quickly became serious, although he still saw Jaeger some when she arrived at Harvard on a teaching fellowship.\n\"I always felt bad about it,\" Yaeger tells Garrow.\nEventually, though, Obama and Robinson became engaged. His communications with Jaeger became increasingly sporadic. And the rest, as they say, is history.",
    "label": 2
}