{
    "index": 333,
    "text": "Throughout his young presidency, just as he did in the campaign, Donald Trump has insisted that much of what’s wrong with the U.S. economy boils down to one thing: big trade deficits.\nIf only the United States sold more to the rest of the world than it bought overseas, Trump argues, the country would take a dramatic turn for the better. That would be true especially in manufacturing, the thinking goes, where the shift to foreign factories has cost millions of American jobs.\nBut focusing so much on the trade deficit as a scorecard on economic health, many experts say, is not only misguided, but it also diverts attention and resources away from problems that will have a far bigger impact on Americans’ long-term well-being.\nNo question U.S. trade in goods is lopsided\nBut while Trump’s fixation on trade deficits has proven to be an effective political message, he overstates their economic importance, critics say.\nThe flaw in using deficits or surpluses to size up U.S. commercial relations with any single country, which Trump tends to do, ignores the complexities of trade in today’s global economy.\nAdvertisement\nThe trade gap with Mexico, for example, looks very big — $63 billion last year. But the reality is that about 40% of the value of the goods imported from Mexico is made in the U.S.\nTrump vs. economists\nTrump says trade deficits:\nare the central cause of U.S. manufacturing and economic woes\nindicate trading partners need the U.S. more than the other way around\nif reversed, will create many jobs and reopen factories\nExperts say trade deficits:\nreflect a low savings rate relative to consumption and investment\ndon’t necessarily give the U.S. an advantage at the negotiating table\nif reversed, may not add many new jobs due to automation\nThe problem is aggravated by the president’s informal, zig-zag approach to trade policy. Last week, Trump suggested he was about to tear up the 23-year-old North American Free Trade Act. Hours later the White House said amicable negotiations over modifying the deal are on track.\nSimilarly, Trump’s fondness for off-the-cuff remarks, which he sometimes acknowledges later were based on insufficient understanding of the issue, make it hard for administration officials to focus on basic strategies.\nThe link between trade deficits and jobs is not so clear\nChanges in the trade balance and the number of manufacturing jobs have often moved in opposite directions. During economic downturns, U.S. trade balances tend to improve amid sharp drops in imports even as factories cut back on employment.\nTrump may be overplaying his hand when it comes to the impact of deficits. He thinks big trade deficits give the U.S. leverage to make trading partners offer sweeter terms.\n“We have massive trade deficits. So when we’re the country with the deficits, we have no fear,” he said last week when asked whether he worried about sparking a trade war after slapping tariffs on Canadian lumber.\nBut having a big deficit doesn’t give the U.S. a particular advantage at the bargaining table, said Wendy Cutler, a top trade negotiator in the Obama administration.\nEven the opposite may be true, some say: Big deficits can reduce U.S. bargaining power because any sudden action to cut back imports would send damaging shock waves through the nation’s economy.\nSecretary of Treasury Steven Mnuchin, right, and National Economic Director Gary Cohn . (Mark Wilson / Getty Images)\nTrump’s tax plan may undermine his trade goals\nBecause Trump’s tax proposal does not have enough spending offsets to pay for the cuts, it will increase the national debt.\nFederal Reserve Chair Janet Yellen (Susan Walsh / Associated Press)\nThat higher borrowing by the U.S. government will push up interest rates.\nA New York Stock Exchange trader (Bryan R. Smith / AFP/Getty Images)\nHigher rates will attract global investments in U.S. Treasury bonds.\nIncreased demand for U.S. bonds will tend to strengthen the U.S. dollar.\nPresident Trump and Canadian Prime Minister Justin Trudeau (Saul Loeb / AFP/Getty Images)\nThe rise in the dollar means American exports will become more expensive and imports will be cheaper.\nWeaker demand for U.S. exports and cheaper prices for imported goods will worsen the trade deficit.\nFocusing on deficits overlooks more important factors\nWhile no one argues that trade deficits are a good thing, most economists see them as symptoms of deeper problems. Addressing those long-term problems is likely to yield better results than haggling over present-day trade deals, which harm some Americans but help others.\nHigh on the list of long-range changes needed to assure future prosperity for the United States is increasing the skills of American workers. To borrow a term from the world of sports, it’s a matter of “matchups.”\nToday, many American workers compete head-to-head with foreign workers for jobs that require relatively modest skills and education. That’s a matchup U.S. workers cannot win, because workers in most other countries are paid less and what they produce can be sold for less.\nStudents at Lansing Community College in Michigan learn about advanced precision machining. (Carlos Osorio / Associated Press)\nThe answer, economists and other analysts say, is to train Americans for positions that require more technical skills than the low-wage foreign workers possess.\nInvesting in more education and training will pay especially big dividends because the increasingly high-tech economy of the future will make lower-skilled workers less and less valuable.\nThat will take time and money. But so far, such investment does not seem to be a priority for Trump.\n“We have to focus on upgrading skills of American workers,” said Raghuram Rajan, a University of Chicago Booth School of Business professor and former governor of India’s central bank. A lot of the new jobs, he added, are in the service industry, but getting them into rural areas and smaller communities is a big challenge. “These are important questions that the administration has to ask.”\nThe dismal U.S. saving rate is a bigger factor\nAnother long-term problem that is largely going unaddressed is the admittedly arcane issue of how much money Americans — and the federal government — save. For many years, Americans have saved at much lower rates than the countries that have risen to become major economic challengers, especially China.\nWhy does saving matter so much? After all, by becoming a nation of consumers, not savers, most Americans enjoy one of the highest standards of living in the world.\nThe trouble is that because the country is saving too little, it is indirectly paying for much of its consumption — and its investments — by borrowing from foreigners. Trump’s tax plan unveiled last week would only make matters worse, policy experts say, because his proposal for massive tax cuts for businesses would increase U.S. government debts by trillions of dollars, which would tend to push up the trade deficit.\nIn one sense, the most important U.S. export is the dollar. Because the dollar is considered the safest currency in the world, foreign nations and wealthy firms and individuals buy and hold huge reserves of greenbacks, even though they earn very little interest.\nThat may help U.S. consumers and the government in the short run, but the failure of Americans to save more means the country has trouble financing the big modernization and educational projects that would give it a better future.\n“The intuition is that if you make U.S. firms and workers more productive, they’ll be more competitive internationally. And if they’re more competitive, we’ll be able to export more,” said Barry Eichengreen, professor of economics and political science at UC Berkeley who was a senior advisor to the International Monetary Fund .\n“But if you haven’t done anything in the meantime to change savings or investment, you’ll also be importing more — and you will not have narrowed the external deficit.”\nWhat worries Eichengreen is that Trump may, in fact, end up discouraging savings with his deregulation of financial insitutions and other policies. Trump administration officials, he said, “are not exactly informed by economic literacy.”\nPresident Trump signs an executive order Saturday establishing the Office of Trade and Manufacturing Policy. (Carolyn Kaster / Associated Press)\nTo be sure, most economists and trade specialists applaud efforts by Washington to make its trading partners play fairly, which many don’t always do. U.S. exporters face a range of barriers that countries erect against imported goods, barriers that are not immediately recognizable as trade policies.\nTrump recently ordered a probe of exporters of cheap steel, a move aimed at targeting China’s huge overproduction of steel that has caused a global glut and slump in prices. That has made American-produced steel hard to compete, even though just 3% of U.S. iron and steel imports last year came from China.\n“Our government has done nothing to stop the trade cheating that is rampant in the world,” said Dan DiMicco, former chairman of steelmaker Nucor Corp. and a principal trade advisor to Trump during the campaign.\nIn some cases foreign governments will impose highly demanding health and safety rules for imports, even though they may be more interested in discouraging imports than in protecting their citizens. But most trade specialists say that attacking these and other barriers require careful and time-consuming efforts by U.S. officials, not dramatic unilateral action.\nIf Trump remains focused on his fiery rhetoric about trade deals such as the North American Free Trade Agreement — which includes both Mexico and Canada — it may do little to address the deep-seated problems that undergird trade relations. And tearing up existing agreements such as NAFTA or resorting to new tariffs could bring more lost jobs and new damage to the U.S. manufacturers that Trump promises to help.\nFor instance, hundreds of thousands of cars assembled by U.S. automakers in Mexico and then imported into the American market contain parts or major components made in this country. So, quick action to curtail auto imports would have quick negative effects on many U.S. factories and workers.\nIt would take many years and billions of dollars to build new assembly plants inside the United States. Moreover, highly automated new plants would need only a fraction of the workers employed in the old auto industry.\nWorse, the expected jobs might never return to U.S. shores at all. They could likely just shift to other lower-wage countries.\nThat’s what happened a few years ago when Washington levied big tariffs on imported Chinese tires. China accounts for nearly half of the United States’ $735-billion deficit in tradable goods and Chinese tires were seen as a particularly sore point.\nThe tariffs did make Chinese tires more expensive. But, instead of resulting in a surge of demand for American-made tires, U.S. purchasers shifted to Thailand, Indonesia and other low-cost producers, with little change in domestic industry employment.\nThe tire story is not unique. Experience shows that attacking a trade gap with one country by applying tariffs or other restrictions often increases the deficit with another country that is making and shipping those same products.\n“What Trump is trying to suggest is that if we impose some kind of import barrier, we’re going to get a bunch of jobs back,” said Edward Leamer, director of the UCLA Anderson Forecast. “And that seems highly doubtful.”\nAlready a subscriber? Thank you for your support. If you are not, please consider subscribing today. Get full access to our signature journalism for just 99 cents for the first four weeks.\ndon.lee@latimes.com\nFollow me at @dleelatimes\nALSO\nTrump’s ‘big beautiful wall’ is not in the spending plan. Will it ever get built?\nTrump’s frustration with budget compromise has him considering merits of a ‘shutdown’\nCongress on track to deliver sweeping spending bill, but not much else",
    "label": 3
}