{
    "index": 269,
    "text": "Washington (CNN) How did House GOP leaders win the final votes to pass their health care legislation? Will President Trump make a big decision on climate change before he meets with the Pope?\nAnd what do Palm Beach and New Jersey have in common?\nThese questions and more are answered in this week's \"Inside Politics\" forecast, where you get tomorrow's headlines today.\n1) Money helps sway House health care vote ...\nPromises of what political consultants call \"air cover\" helped House GOP leaders get to the finish line in last week's Obamacare repeal-and-replace vote.\nHouse members worried that a \"yes\" vote would be unpopular in their districts were told by Speaker Paul Ryan that they would get help with TV ads and other re-election support, CNN's Phil Mattingly reports.\n\"They know that they will need [help] -- especially for the 14 Republicans who voted yes and come from Hillary Clinton districts,\" Mattingly said. \"Where is that money going to come from?\n\"You have outside groups -- American Action Network has launched a $2 million ad buy in 21 districts. I'm told they promised President Trump would be available to campaign and raise (money).\"\n2) ... but the Senate is very different\nIt's been awhile since a major piece of legislation cleared the House, and because of that it has been awhile since we've been reminded of how differently things work in the Senate.\nThe rules are different, and so are the margins: Republicans have just a 52-48 edge, so one or two senators can have oversized influence. Also important: Senators run statewide, not in the carefully drawn districts that protect most House members.\nAlready, some of these differences are evident.\nJUST WATCHED How strong the Trump economy really is Replay More Videos ... MUST WATCH How strong the Trump economy really is 00:48\nGOP Sens. Susan Collins of Maine and Lisa Murkowski of Alaska, for example, don't like that the House bill cuts funding for Planned Parenthood. Look for that to change in the Senate version.\nAnd several GOP lawmakers from states hard hit by the opioid crisis don't like that the House bill allows states to drop a requirement that drug treatment be covered under health care plans. So look for that, too, to be among the many changes coming as the debate shifts to the Senate.\n3) Why Pope Francis is closely watching this Trump decision\nThere is a robust debate in the Trump White House about whether to withdraw the United States from the Paris climate change accord that the Obama administration helped negotiate.\nConservatives say it is a campaign promise the President must keep. Environmentalists are hoping Ivanka Trump sways her father to take a different course on climate change than he did as a candidate.\nA decision on the Paris deal is due soon, and Julie Pace of the Associated Press says it could make the President's first overseas trip even more interesting. On his itinerary is a face-to-face with one of the world's most prominent climate change activists: Pope Francis.\nJUST WATCHED Fareed: Trump is turning allies against US Replay More Videos ... MUST WATCH Fareed: Trump is turning allies against US 03:56\n\"There is an interest in trying to get a decision done before he heads to Europe later this month,\" Pace reports. \"He will be meeting with some leaders of countries who are part of it (the Paris agreement). One of the big advocates that he would be meeting with is, of course, Pope Francis. So this will be just one really fascinating element of what will be an incredibly interesting meeting between the Pope and the president.\"\n4) Is Trump considering Democrats for high-level vacancies?\nThere are still dozens and dozens of high-level vacancies throughout the Trump administration, and the White House is getting some interesting advice from Republican friends: Hire some Democrats.\nHouse Democrats to be exact.\nJonathan Martin of The New York Times reports that GOP strategists think the party could improve its odds of holding the House in next year's midterm elections if the President offered jobs to a few Democrats who serve in districts where Trump won.\nThe strategy: Those are districts the GOP would have good odds of winning if longtime Democratic incumbents were not on the ballot. This isn't the first time the White House floated this idea.\n\"Back during December, there was an effort to get Democratic senators into the cabinet. That fizzled,\" Martin says. \"I've learned this week, actually, that the House GOP sought to get Reince Priebus, the chief of staff at the white house, to appoint house Democrats, too ... there is one job that is still open, as we know: Army Secretary.\"\n5) How Mother's Day impacts the weekend White House\nPresident Trump is spending the weekend at his private golf club in Bedminster, New Jersey, and that could be a sign of things to come.\nHis Mar-a-Lago resort in Palm Beach, Florida has been Trump's weekend White House for much of his young presidency. But Margaret Talev of Bloomberg Politics notes that the property is seasonal -- and due to close for the year next Sunday -- Mother's Day.\n\"We haven't heard yet officially from the White House whether President Trump will be marking that, but he does most years and we'll now see the action and guest list shift up to Bedminister,\" explains Talev.\nIt remains to be seen how that move would affect Trump's weekend activities -- or his guest lists.",
    "label": 3
}