{
    "index": 167,
    "text": "Former Secretary of Defense Robert Gates said the firing of FBI Director James Comey Tuesday was \"not terribly well done.\"\nGates, the Chancellor of William & Mary who served as defense secretary under Presidents Obama and Bush, told CBS News' \"Face The Nation\" in an interview airing Sunday that it helps to have a \"single story\" in place when firing a senior official. There is, he said, a correct way to dismiss a senior official with a \"professional approach.\"\n\"You know, I fired a lot of senior people myself and I think the key, when you feel compelled to remove a senior official, is essentially to have all your ducks in a row at the beginning,\" Gates said. \"To have the rationale, have everybody understand what the rationale was.\"\n\"If possible, to be in a position to announce who is going to step in as the interim immediately,\" Gates continued. \"And if possible, to announce who you're going to nominate to replace that person. And so, being able togo forward, put forward a name of somebody that you would like to have as the candidate to be in that position. For that to be somebody of impeccable integrity and reputation disarms a lot of the worst criticism that it's some kind of a power play.\"\nThe White House is interviewing candidates to replace Comey, but has yet to announce a pick.\nMr. Trump's administration has released conflicting stories about when Mr. Trump decided to fire Comey, and why.\nWhite House staff said the president made the decision to fire Comey only Tuesday at the recommendation of Attorney General Jeff Sessions and Deputy Attorney General Rod Rosenstein. But Mr. Trump on Thursday said he was going to fire Comey \"regardless\" of the DOJ recommendation. The White House also said Mr. Trump fired Comey over the Clinton email investigation and because he had lost the confidence of \"rank and file\" FBI employees, but other developments -- like Mr. Trump's claim Thursday that he thought of the \"made-up\" story about collusion between Russia and him when firing Comey -- have immersed the White House's justification in scrutiny.\nGates said it's important to take a \"professional approach to replacing a senior official.\"\n\"It's always going to be contentious,\" Gates said. \"But having a single story in line in terms of how it happened and why it happened, that everybody is on the same page, and then what the next steps are I think helps to diminish the blowback that you get.\"\nFailing to take such a professional approach, Gates said, has consequences.\n\"Well, I think you see the kind of media firestorm that we've seen over the last couple of days,\" Gates said. \"And I think it would always have been a lot of coverage, but I think you can significantly mitigate it.\"\nThe full \"Face the Nation\" interview with Gates will air Sunday at 10:30 a.m.",
    "label": 2
}