{
    "index": 311,
    "text": "Liberal sanctuary cities in California and elsewhere may well win their legal battle against President Trump thanks to Supreme Court rulings once heralded by conservatives, including a 2012 opinion that shielded red states from President Obama’s plans to expand Medicaid coverage for low-income Americans.\nOn Tuesday, a federal judge in San Francisco temporarily blocked enforcement of Trump’s sanctuary city executive order, resting his ruling on high court decisions that protected states and localities from federal meddling.\nIn the 2012 case, Chief Justice John G. Roberts Jr. said it was unconstitutional for Obama and the Democratic-controlled Congress to demand that Republican-led states expand Medicaid or face the threat of losing federal Medicaid money. That is akin to “a gun to the head,” Roberts said, leaving the states no choice but to comply.\nThe same is true with Trump’s executive order on sanctuary cities, U.S. District Judge William H. Orrick said in Tuesday’s decision. Trump’s Jan. 25 order declared that jurisdictions that do not fully comply with federal immigration enforcement laws “do not receive federal funds, except as mandated by law.”\nIt was not clear what funds would be withheld, but Trump in a TV interview said he could use “defunding” as a “weapon” to force the cities to get in line.\nAdvertisement\nOrrick said San Francisco and Santa Clara County took the threat of a funding cutoff seriously, just as the Republican states said they feared a cutoff of their Medicaid money. This threat is “unconstitutionally coercive,” he said. “The executive order threatens to deny sanctuary jurisdictions all federal grants, hundreds of millions of dollars on which the counties rely.”\nOrrick, an Obama appointee, also quoted at length from a 1997 opinion by the late Justice Antonin Scalia that shielded county sheriffs from conducting background checks on new gun buyers. The Brady Act required local police chiefs to check to see if new buyers were eligible to own a handgun, but county sheriffs in Montana and elsewhere refused, arguing the federal government could not force them to comply.\nBy a 5-4 vote, the Supreme Court agreed. “The federal government may not compel the states to enact or administer a federal regulatory program,” Scalia said. It may not “command the states’ officers, or those of their political subdivisions, to administer or enforce a federal regulatory program.”\nScalia’s words about federal background checks apply equally to the federal government’s effort to arrest and detain immigrants who are subject to deportation, Orrick said. Although cities and counties may choose to aid federal immigration officers, “the executive order uses coercive means in an attempt to force states and local jurisdictions to honor civil detainer requests,” he wrote. He said this violates the 10th Amendment, which leaves some power “reserved to the states respectively, or to the people.”\nIlya Somin, a law professor at George Mason University in Arlington, Va., described Orrick’s decision as “an important victory for both federalism and separation of powers. Some conservative Republicans may not like the outcome of this specific case,” he wrote on the Volokh Conspiracy blog. “But they will have reason to celebrate it the next time a liberal Democratic president tries a similar move.”\nOn Wednesday, Trump called the decision “ridiculous” in a tweet. “First the Ninth Circuit rules against the ban & now it hits again on sanctuary cities—both ridiculous rulings. See you in the Supreme Court,” he wrote.\nTrump’s lawyers say the administration is simply trying to enforce a provision of federal law that says a state or local government “may not prohibit, or in any way restrict, any government entity or official from sending to, or receiving from, the Immigration and Naturalization Service information regarding the citizenship or immigration status, lawful or unlawful, of any individual.”\nThe executive order pledges to enforce this provision to the “fullest extent of the law.” However, the order did not carefully define what is a sanctuary city and what officials must do to be in compliance with the federal law.\nBecause Orrick is a district judge in San Francisco, the administration will appeal first to the 9th Circuit Court of Appeals. If it loses there, it can appeal to the Supreme Court.\nNext month, the 4th Circuit Court in Virginia and the 9th Circuit Court in California will hear the Trump administration’s appeals of a pair of judges’ rulings that blocked the revised travel ban on people coming from six mostly Muslim countries. There, Trump’s lawyers can argue that the Constitution and federal law gives the executive broad power to restrict who enters the country.\nBy contrast, the dispute over sanctuary cities turns on the president’s power over states and localities. Trump’s lawyers may face an uphill fight.\nIn Orrick’s courtroom, Trump’s lawyers tried to save the executive order by arguing that it was legally meaningless and would not threaten funds going to San Francisco or Santa Clara.\nSomin said Trump’s lawyers will face a stiff challenge.\n“If the case gets to the Supreme Court, which I am not at all sure would happen, I think it’s likely that either the court would rule along the same as lines as Judge Orrick, ” he said, or perhaps opt for the administration’s view that the order is exceedingly narrow and “largely meaningless.”\ndavid.savage@latimes.com\nOn Twitter: DavidGSavage",
    "label": 3
}