{
    "index": 800,
    "text": "Trump met with health insurance executives and discussed Republicans’ efforts to repeal and replace the Affordable Care Act, apparently only now becoming aware that the party hasn’t been able to come up with a plan because health care is “an unbelievably complex subject.”\nAdvertisement\nLater that evening, when CNN’s Anderson Cooper asked Sanders to respond, the senator laughed and shook his head, recalling the long legislative battles it took for progressives to pass the ACA.\n”Well, some of us who were sitting on the health education committee, who went to meeting after meeting after meeting, who heard from dozens of people, who stayed up night after night trying to figure out this thing ― yeah, we got a clue,” Sanders said. “When you provide health care in a nation of 320 million people, yeah, it is very, very complicated.”\nSen. Bernie Sanders mocks President Trump saying nobody knew health care is \"so complicated\" https://t.co/TpQI6mVjDI https://t.co/xTaFEnVsCB — Anderson Cooper 360° (@AC360) February 28, 2017\nThe senator laid into the GOP for repeatedly delaying introducing a replacement, despite pledging for years to repeal the law.\nAdvertisement\n“Maybe now, maybe the president and some of the Republicans understand [that] you can’t go beyond the rhetoric,” he said. “’We’re going to repeal the Affordable Care Act, we’re going to repeal Obamacare, and everything will be wonderful!’ A little more complicated than that.”\nTrump on Tuesday morning reiterated his discovery about the issue.\n“You know, health care is a very complex subject,” he said on “Fox and Friends.” “If you do this, it affects nine different things. If you do that, it affects 15 different things.”\nBut Trump claimed that he has a “really terrific” replacement plan in the works.\n“It’s going to be something that’s going to be really respected,” he said.\nWhen asked on Monday about Trump’s presidency so far, Sanders said he was “stunned, really, every day.”",
    "label": 3
}