{
    "index": 296,
    "text": "Wow. It seems like a lifetime since Donald Trump took office. But we’re just approaching his 100th day. With just a few days to go until that milestone, we can only imagine what could happen in such little time. Let’s catch up on week 14:\nLast weekend\nThe headliner. Tens of thousands across the country (and beyond) marched in the name of science.\nMonday, April 24\nThe headliner. Trump spoke with record-setting astronaut Peggy Whitson and another crew member on the International Space Station.\nTrump spoke with record-setting astronaut Peggy Whitson and another crew member on the International Space Station. What you might have missed. A blog post the State Department published in early April came under fire for promoting Trump’s Mar-a-Lago. The agency deleted the post soon after.\nTuesday, April 25\nThe headliner. Back to the Flynn saga. Lawmakers are now saying that former national security adviser Michael Flynn didn’t disclose payments he received from business dealings in Turkey and Russia. According to Rep. Elijah Cummings, Russian companies paid Flynn more than $67,000 before the election.\nBack to the Flynn saga. Lawmakers are now saying that former national security adviser Michael Flynn didn’t disclose payments he received from business dealings in Turkey and Russia. According to Rep. Elijah Cummings, Russian companies paid Flynn more than $67,000 before the election. All in the family. Ivanka Trump got booed while in Berlin, when she said that her father is an advocate for women’s rights.\nIvanka Trump got booed while in Berlin, when she said that her father is an advocate for women’s rights. Sanctuary cities fight back. A federal judge blocked Trump’s order to strip funding from cities who refuse to follow the administration’s immigration policy.\nWednesday, April 26\nThe headliner. The White House revealed a dramatic plan to overhaul the tax code. Budget experts are skeptical.\nThe White House revealed a dramatic plan to overhaul the tax code. Budget experts are skeptical. National monuments under review. Trump signed an executive order that could lead to the reduction or elimination of some national monuments.\nTrump signed an executive order that could lead to the reduction or elimination of some national monuments. Backtracking? Trump told the leaders of Mexico and Canada that he won’t leave the North American Free Trade Agreement — at least for now.\nTrump told the leaders of Mexico and Canada that he won’t leave the North American Free Trade Agreement — at least for now. What you might have missed. All 100 senators headed to the White House for a briefing on North Korea.\nThursday, April 27\nThe headliner: Congress is trying to avoid a government shutdown. House Republicans introduced a stopgap bill that would keep the government open for another week in order to buy time to pass a $1-trillion-plus spending bill. As a result, they’re pushing the repeal and replacement of Obamacare until next week.\nCongress is trying to avoid a government shutdown. House Republicans introduced a stopgap bill that would keep the government open for another week in order to buy time to pass a $1-trillion-plus spending bill. As a result, they’re pushing the repeal and replacement of Obamacare until next week. Troops killed. Two American troops were killed and a third wounded Wednesday night during a raid in Afghanistan, the Pentagon announced.\nTwo American troops were killed and a third wounded Wednesday night during a raid in Afghanistan, the Pentagon announced. It’s not over with Flynn. The Pentagon inspector general is investigating whether Flynn violated military rules by accepting foreign payments from Russia and Turkey.\nThe Pentagon inspector general is investigating whether Flynn violated military rules by accepting foreign payments from Russia and Turkey. What you might have missed. The Senate confirmed Alex Acosta as secretary of Labor, filling the last spot in Trump’s Cabinet.\nFriday, April 28\nThe headliner. Government shutdown averted! Congress passed the stopgap measure (mentioned yesterday) and will get another week to hammer out a deal to keep the government running for the remainder of the fiscal year.\nGovernment shutdown averted! Congress passed the stopgap measure (mentioned yesterday) and will get another week to hammer out a deal to keep the government running for the remainder of the fiscal year. Drill, baby, drill. Trump signed an executive order that could open up parts of the Pacific, Arctic and Atlantic oceans for new oil and gas drilling.\nSaturday, April 29 (Day 100)\nThe headliner. Day 100 finally arrives. Trump skipped the White House Correspondents’ Dinner to hold a rally for his supporters in rural Pennsylvania, where he lashed out at immigrants and the media.\nDay 100 finally arrives. Trump skipped the White House Correspondents’ Dinner to hold a rally for his supporters in rural Pennsylvania, where he lashed out at immigrants and the media. Meanwhile … thousands of demonstrators around the country held protests over Trump’s rejection of climate change and other environmental concerns.\nthousands of demonstrators around the country held protests over Trump’s rejection of climate change and other environmental concerns. What you might have missed. Trump signed executive orders directing a review of U.S. trade agreements and creating an Office of Trade and Manufacturing Policy, according to pool reports.\nCan’t get enough? We’ve got you covered for all of Trump’s first 100 days. » »\nGrade the president\nNow that you’re all caught up, here’s your chance to tell us what you think of Trump as we track his major moves in the first 100 days.\nGrading opens every Friday and closes at the end of Monday. We’ll be posting your responses, so subscribe to our newsletter to be notified when they go up.\nMissing something? Email colleen.shalby@latimes.com and melissa.leu@latimes.com or tweet us @cshalby and @melissaleu.\nAdvertisement\nALSO:\nWeek 1 | Week 2 | Week 3 | Week 4 | Week 5 | Week 6 | Week 7 | Week 8 | Week 9 | Week 10 | Week 11 | Week 12 | Week 13\nTracking President Trump’s campaign promises",
    "label": 3
}