{
    "index": 315,
    "text": "Supporters of Donald Trump worried he has lost his appetite for poking the establishment would probably be reassured if he were to make good on his promise to swiftly kick to the curb the Paris agreement on climate change.\nBut the promise to snub Paris is fast becoming a political albatross for the president.\nAs Trump meets with top advisors Thursday to weigh what purpose a U.S. withdrawal from the agreement would serve, he is under intensifying pressure from his allies to keep it intact. And it is not just coming from his climate-anxious daughter, Ivanka. The White House is getting an unexpected earful on the matter from a broad spectrum of voices on the right, including some prominent skeptics of global warming science.\nRepublicans are increasingly adopting the point of view that there isn’t much upside to walking away from the Paris accord beyond the burst of satisfaction it would give core Trump voters. Politicos who were once among the most vocal opponents of the agreement are reconsidering, as they grow concerned about the prospect of the United States removing itself from one of the most influential forums for steering global energy policy — and one that doesn’t place particularly onerous obligations on the nation.\nCo-opt it, don’t crush it, is fast becoming a mantra among a broadening circle of advisors to the administration, much to the horror of the free market absolutists and anti-globalism activists who took the accord for as good as dead the day Trump was elected. The president plans to announce by the end of May what direction the administration will go.\nAdvertisement\n“If the president asked me today whether we should stay in or get out, I am not sure what I would tell him,” said Rep. Kevin Cramer (R-N.D.), an energy advisor to Trump during the campaign who previously urged him to reject the pact unequivocally and as recently as October declared the accord a grave economic threat to America. “The more I speak to people, the more convinced I am that there is a lot of upside to staying in if we do this right.”\nAll this is cold comfort to the many thousands of global warming activists who will be marching for climate action in Washington and elsewhere Saturday. The shifting view in the GOP on the Paris accord is not so much a sign that the right is embracing mainstream science on global warming and a need to take bold measures as it is that many in the oil, gas, coal and nuclear sectors are seeing more opportunity to preserve market share by staying in Paris than by bolting.\n“We want to make sure we have a leg up and opportunity for American energy and technologies to compete in the world market and not get boxed out by others,” said Jeffrey Merrifield, a former commissioner at the Nuclear Regulatory Commission who now represents nuclear energy companies as an attorney. “It’s a good reason for staying at the table to be part of that discussion.”\nThe pact sets goals for reducing emissions, but it leaves lots of flexibility for how nations go about it.\nIt does not require America to keep intact the Clean Power Plan, then-President Obama’s signature action for reducing emissions, which Trump has targeted for elimination. It does not, some energy lobbyists argue, even require enforcement of the landmark Clean Air Act, a key tool in American efforts to curb greenhouse gases. It does, however, set fairly aggressive targets over the long haul, and every action Trump has taken on climate has undermined America’s ability to meet them.\n“Have a little faith,” said energy lobbyist Scott Segal, arguing at a freewheeling debate this week on Capitol Hill among conservatives convened by Cramer. They discussed whether modifying rather than abandoning Obama’s policies would give America more leverage to reopen negotiations and push other nations to take on more of the burden. “I want to see what the Paris structure will look like if the team of negotiators is not dispatched by Barack Obama, but by Donald Trump.”\nNot all conservatives are warming to the idea. Several activists from the network of nonprofits that have been bankrolled by fossil fuel tycoons Charles and David Koch are urging Trump to not waver on his pledge to retreat.\n“It was a promise,” Chris Horner of the Energy and Environment Legal Institute said of Trump’s vow to withdraw from the Paris accord. “Should the president keep his promise? We argue he should. There is no political upside to the president breaking his promise.”\nHorner expressed alarm at all the “rationalizations” he is hearing from Republicans for backing away from that promise. “We are hearing more every day,” he said.\nThe debate will rage on in the White House on Thursday, where Trump’s Cabinet is also conflicted about what direction to take. Secretary of State Rex Tillerson is loath to sacrifice the seat at the table the United States has by continuing to honor the agreement. Environmental Protection Agency Administrator Scott Pruitt calls the Paris accord a bad deal that America should walk away from. Trump strategist Stephen K. Bannon is expected to argue vociferously against remaining in the agreement, but the president’s mere contemplation of staying in is another sign of how much the influence of the former Breitbart executive has waned.\nBut that hasn’t made the politics any less complicated for Trump. Bannon’s point of view remains strong among his base.\n“This is a very sinister program,” Marlo Lewis, fellow at the Koch-backed Competitive Enterprise Institute, said of the Paris accord. “What happens if the next president is a progressive, like Hillary Clinton would have been? As long as this Frankenstein monster is out there, with the right people at the top, it can revert right back to where Obama left it.”\nevan.halper@latimes.com\nFollow me: @evanhalper\nALSO\nLos Angeles County gets a ‘C’ on UCLA’s latest environmental report card\nAs the White House changes course on climate change, California stubbornly presses forward\nTrump is creating a void on climate change. Can California persuade other states to help fill it?",
    "label": 3
}