{
    "index": 379,
    "text": "Mayor Eric Garcetti used his State of the City address Thursday to present Los Angeles as a compassionate counterpoint to the policies of President Trump, charting a sharply different path on climate change, immigration and efforts to help those in need.\nWhile the nation is “anxious and divided,” Los Angeles has the opportunity “to be a model of moral leadership and bold action,” Garcetti told the crowd of politicians, labor leaders and business representatives inside the Los Angeles City Council chambers.\nFresh off a historic reelection victory, Garcetti, 46, acknowledged that the city remains “an imperfect paradise” but said L.A. is making major strides on jobs, tourism, transportation and housing.\nHe also released his proposed budget for the 2017-18 fiscal year, staking out homelessness as his top priority while closing an estimated $263-million shortfall.\nThe $9.2-billion spending plan also lays out additional money to repair the city’s most damaged streets, adds 75 firefighters and dramatically expands funding for the city’s Vision Zero program, which seeks to end traffic fatalities.\nAdvertisement\nGarcetti used his speech to contrast the “progressive” activities in Los Angeles with a “backward, retrenching Washington,” said Los Angeles City Councilman Mike Bonin. “Trump is writing a public narrative of America, and I think Los Angeles and California are the counter-narratives to that.”\nDespite the optimistic messages, Garcetti argued city leaders need to hold the line on spending. To balance the budget this year, the mayor relied on $103 million in spending reductions, much of it achieved by leaving city employee positions vacant.\nThe remainder of the shortfall was eliminated by relying on anticipated revenue, including funding from digital billboards, Airbnb-type rentals and trash franchise agreements.\nGarcetti was able to increase spending in key areas, in large part because voters approved tax increases to pay for transportation initiatives and efforts to fight homelessness. The mayor proposed $176 million to aid the homeless, a significant increase bolstered by the passage of Proposition HHH in November.\nStill, one union representative argued that the budget focuses too little on public safety.\n“This budget is a recipe for longer police response times, increasing crime in our neighborhoods and fewer police officers,” said Dustin DeRollo, spokesman for the Los Angeles Police Protective League, which represents rank-and-file officers.\nGarcetti said Angelenos do not need to worry about the city’s fiscal health and called the budget a “conservative” document.\n“We not only protected, but expanded, core services and core priorities, from paving streets to homelessness,” Garcetti said.\nThe mayor called on the City Council to pass a fee on development that would be used to pay for affordable housing. City Controller Ron Galperin said he had “serious questions” about the proposed fee, which is opposed by business groups.\n“I’m not convinced that the way that you create more housing is by making it more expensive to build…. Los Angeles already is one of the most expensive cities in the country to build anything,” Galperin said.\nGarcetti won a second term last month with 81% of the vote. He has not stated publicly whether he has plans to run for higher office.\nThe mayor did not mention President Trump by name during the State of the City address. But he vowed that if “the White House pulls out of the Paris climate agreement, we’re going to adopt it right here in L.A.”\nHe also touched on the issue of immigration, switching to Spanish as he told people not to be afraid to report a crime. He praised Talia Inlender, a staff attorney at the nonprofit law firm Public Counsel, for her volunteer work aiding travelers at Los Angeles International Airport in the wake of Trump’s travel ban.\nGarcetti also reiterated that “the LAPD will never act as a federal immigration force.”\nHis oft-repeated stance was criticized by Robin Hvidston, executive director of We the People Rising, a Claremont-based group opposed to illegal immigration.\n“This sends a message to the world that people can enter and live in Los Angeles illegally,” Hvidston said. “Not only that, but the mayor is going to protect them.”\nBefore the speech, the crowd at City Hall watched a video showing glowing sunrises and other iconic Los Angeles scenes, then listened to an invocation by an imam, Jihad Saafir, who called on God to fill their hearts with empathy, love and humility.\nAcknowledging the struggles still confronting the city, Garcetti cited the recent shooting of a 3-year-old girl and reiterated his commitment to get 20,000 guns off the street in the next five years — a goal he unveiled earlier this year.\nThe program comes amid growing concern over gun violence. All told, 319 people have been injured or killed in shootings so far this year.\nViolent crime has risen for three straight years after 12 consecutive years of decline, according to city data. On Thursday, however, Garcetti said he was encouraged by recent statistics showing a dip in crime so far this year compared with the same period in 2016.\nAs he closed out his annual address, Garcetti dismissed the idea that Los Angeles is “some isolated world on the coast,” adding that “our families struggle with the same things people grapple with throughout the country.”\nRaphael Sonenshein, executive director of the Pat Brown Institute at Cal State L.A., said that message captures the duality of the city’s Hollywood glamour and blue-collar workers — and could be especially important for Garcetti’s political future beyond Los Angeles.\nThe speech “made a case for the city,” Sonenshein concluded, “as well as for his leadership.”\ndakota.smith@latimes.com\nTwitter: @dakotacdsmith\nemily.alpert@latimes.com\nTwitter: @LATimesemily\ndavid.zahniser@latimes.com\nTwitter: @DavidZahniser\nALSO\nA $10-million fund will help immigrants fight deportations. But should it help those with violent criminal convictions?\nL.A. City Council backs plan to borrow $60 million to pay off legal settlements\nGarcetti now has a mandate — but how he will use it has City Hall and the political world guessing\nUPDATES:\n4:50 p.m.: This article was updated with additional details and reaction.\n12:30 p.m.: This article was updated with additional details and reaction.\n10:25 a.m.: This article was updated with additional details from L.A. Mayor Eric Garcetti’s prepared remarks.\nThis article was originally published at 10 a.m.",
    "label": 3
}