{
    "index": 426,
    "text": "Iowa may be without individual health plans if insurer pulls out\nShow Caption Hide Caption Medica is third insurer likely to exit Iowa market Medica, a Minnesota based health insurer, released a statement suggesting it was close to following two larger carriers in deciding not to sell such policies in Iowa for 2018, due to instability in the market. Wochit\nDES MOINES — Tens of thousands of individual health policy consumers in Iowa could be left with no health insurance options if the last carrier for most of the state stops selling such policies, as it suggested Wednesday.\nMedica, a Minnesota-based health insurer, released a statement suggesting it was close to following two larger carriers in deciding not to sell such policies in Iowa for 2018, because of instability in the market.\n“Without swift action by the state or Congress to provide stability to Iowa’s individual insurance market, Medica will not be able to serve the citizens of Iowa in the manner and breadth that we do today. We are examining the potential of limited offerings, but our ability to stay in the Iowa insurance market in any capacity is in question at this point,” the company’s statement said.\nRelated: Republicans tweak Obamacare repeal bill to woo moderates\nMedica’s move comes on the heels of announcements last month that Aetna and Wellmark Blue Cross & Blue Shield are pulling out of Iowa’s individual health insurance market. Those are the only three choices for individual health insurance in most areas of the state this year.\nThe pull-outs would not affect Iowans who obtain insurance via an employer or a government program, such as Medicare or Medicaid. But the carriers’ exit could leave more than 70,000 Iowans who buy their own coverage without any options for 2018.\nThe situation comes as the U.S. House of Representatives wrestles with a bill to replace the Affordable Care Act. This week, Republicans won a few more supporters for their plan by promising to add $8 billion to help those with pre-existing conditions pay for their health care. Iowa’s insurance commissioner has said there is little he can do unless Congress loosens the reins on state authority over rules insurers have to follow.\nMedica is a relatively small carrier, which faced a daunting prospect in Iowa after Aetna and Wellmark announced they would no longer sell individual health insurance plans here. The two large carriers said they’d lost tens of millions of dollars on the policies, largely because they covered too many older Iowans with chronic health problems and not enough young, healthy people. If Medica remains in the market, it could face the prospect of shouldering all of that risk by itself.\nRelated: Individual insurance plans at risk in more areas with Trump threats\nThe three carriers’ decisions to pull out will affect Iowans who buy individual health insurance either on or off the federal government’s online marketplace. Unless a replacement carrier is found, the change means moderate-income Iowans in most counties would not be able to use Affordable Care Act subsidies to help pay premiums for private insurance. It also means many better-off Iowans who pay their entire premiums without government assistance would lose their individual insurance policies next year.\nThe change won’t affect nearly 77,000 Wellmark customers who bought individual policies that took effect before Jan. 1, 2014. Those insurance pools are relatively stable, because the policies weren’t subject to Affordable Care Act regulations, including the ban on insurers denying coverage to people with pre-existing health problems.\nThe insurance carriers’ decisions to stop selling individual insurance will affect more than 70,000 other Iowans who bought more recent policies from Wellmark, Aetna or Medica. And the decisions could mean that other Iowans won’t have options for new health insurance next year if they lose jobs that offer coverage, age out of their parents’ policies or become divorced from a spouse who has an employer-provided plan.\nInsurers have complained that the Affordable Care Act, also known as Obamacare, put them in a difficult spot. The 2010 law bars insurers from denying coverage to people with pre-existing health problems. It also requires most Americans to obtain coverage or pay a penalty, but insurance industry leaders say that requirement has not been strictly enforced.\nRelated: Health insurers eye steep increases as enrollment period nears\nThe result is too many young, healthy people are staying out of the pool, leaving insurers to cover mostly older, unhealthy people, the carriers say. Wellmark’s leader said last month that the problem probably will get worse because President Trump has told his administrators to stop enforcing the coverage requirement.\nIowa Insurance Commissioner Doug Ommen, who was recently appointed by Republican Gov. Terry Branstad, has said he understands the companies’ position. After Aetna announced its decision April 6, Ommen said his office was hamstrung by the Affordable Care Act in how it can respond.\nRelated: Aetna-Humana $37B merger blocked over fear it would harm consumers\n“Without congressional action, we’re very limited in what we can do,” he said. “This is a federally created situation, and we need a federally created solution.”\nA fourth carrier, Gundersen Health Plan, currently offers individual health insurance in five counties in northeast Iowa. That company, which is based in Wisconsin, accounts for a sliver of the Iowa market. A spokesman said this week that the company hasn’t decided whether to continue offering those plans for next year.\nContributing: Deirdre Shesgreen, USA TODAY. Follow Tony Leys on Twitter: @tonyleys",
    "label": 3
}