{
    "index": 30,
    "text": "According to an ABC News whip poll, 21 Republicans currently oppose the bill.\n— -- A top House Republican announced opposition to the GOP health care bill Tuesday, citing concerns about pre-existing conditions, as Republican leaders continued to tout the proposal and hunt for votes.\nRep. Fred Upton, R-Michigan, the former chairman of the House Energy and Commerce Committee with jurisdiction over health care, told a Michigan radio station this morning that he won't be voting for the bill.\n\"I’ve supported the practice of not allowing pre-existing illnesses to be discriminated against from the very get go,\" Upton said. \"This amendment torpedoes that.\"\nThe new amendment to the GOP health care bill would keep pre-existing conditions protections in place, but would allow states to seek waivers for an Obamacare mandate that prevents insurers from charging consumers with pre-existing conditions more for health insurance.\nHouse Speaker Paul Ryan, R-Wisconsin, defended the measure Tuesday morning and insisted Republicans are gaining ground in their effort to grow support for the bill.\n\"What's important is we want to have a situation where people can afford their health insurance. We want to have a situation where people have a choice of health insurers. That's not happening in Obamacare,\" Ryan said, pointing to high premium increases. \"So what good is insurance if you don't get it, if it's not offered to you or you can't afford it? So the purpose of our bill is to get more choices to lower prices while preserving the protections for pre-existing conditions. So that is a very important thing.\"\n\"We're excited about this policy,\" he continued. \"We're making very good progress with our members and our president has been instrumental to that.\"\nAccording to ABC News' whip count, at least 21 Republicans are opposed to the amended health care bill, putting the GOP on the verge of losing a potential vote.\nEven more Republicans remain undecided on the measure, including Rep. Ed Royce, R-California, the chairman of the House Foreign Affairs Committee, and Rep. Rodney Frelinghuysen, R-New Jersey, the chairman of the House Appropriations Committee.\nAnother leadership ally, Rep. Billy Long, R-Missouri, who was also a vocal Trump supporter during the campaign, came out against the measure -- even after spending 30 minutes on the phone with President Trump on Monday.\nA House GOP aide said a vote this week, before the House leaves Washington for a week-long recess, is a possibility, though no changes had been made to the schedule as of Tuesday afternoon.\nThe aide said Republican leaders are considering adding more funding to the high-risk pools for consumers with pre-existing conditions, in an effort to court more GOP moderates.\nThis morning, top Republicans were mum on a potential vote this week. Leaders didn't bring it up in the GOP conference meeting, according to members. House Majority Whip Scalise told reporters the whip count is \"better\" today.\nVice President Mike Pence was back on Capitol Hill Tuesday, huddling with undecided moderates in his House-side office before the Senate GOP lunch.\n\"We’re still trying to work through some issues,\" Rep. Dave Reichert, R-Washington, told reporters as he left Pence's meeting.",
    "label": 3
}