{
    "index": 257,
    "text": "(CNN) With President Donald Trump's first 100 days in office in the rearview mirror, lawmakers and advocates are uncertain but hopeful about the impact the new administration will have on the Native American community.\nTrump's choice of Ryan Zinke to be secretary of the interior quelled the concerns of some; as a former congressman from Montana, Zinke has experience representing Native Americans in Washington, which is seen as a promising sign by many of the community's top advocates.\nBut some of the President's executive actions and controversial comments, including a recent reference to Democratic Massachusetts Sen. Elizabeth Warren as \"Pocahontas,\" have raised some concerns. Lawmakers serving on the Senate Committee on Indian Affairs have voiced trepidation about the impact the new administration may have on Native American health care, education funding and sovereignty, among other issues.\nHowever, community stakeholders say they trying to balance those concerns with optimism as the President's first term unfolds.\nZinke takes over\nIn interviews, lawmakers expressed trust in Zinke's demonstrated ability to understand the issues important to Native Americans across the nation. Hailing from a state with seven Indian reservations, Zinke possesses \"a degree of knowledge\" not typical of the interior secretary position, said Sen. John McCain, the current longest-serving member and former chairman of the Senate Committee on Indian Affairs.\n\"Secretary Zinke has much more experience on Native American issues than his predecessor -- who had literally none,\" the Arizona Republican told CNN in an interview. \"My initial impression is President Trump and the people around him support sovereignty and the Native American population. They can have a degree of knowledge and involvement in Native American issues that was not the case amongst their predecessors.\"\nThe interior secretary under former President Barack Obama was Sally Jewell, the previous CEO of outdoor retailer REI. The Interior Department did not respond to requests for comment.\nIn 2015, then-Rep. Zinke sought to make tax breaks on coal mined from American Indian reservations permanent -- a move viewed as boosting the communities' revenue and creating jobs for tribal members. In a statement emailed to CNN, the National Congress of American Indians expressed their support for Zinke, citing \"his approach to the (Bureau of Indian Affairs) as well as his commitment to giving tribal nations a seat at the table across the federal government.\"\n\"Ryan Zinke has a long history of fighting for our country,\" NCAI President Brian Cladoosby said in the statement. \"Throughout his service as a congressman for Montana, he fought for Montanans and Montana's tribes in the halls of Congress. We have no doubt that Secretary Zinke will continue fighting for all tribes as secretary of interior.\"\nTribal sovereignty\nThe densest cloud of uncertainty surrounds the matter of tribal sovereignty, or the US agreement to protect the ability of individual tribal governments to govern themselves.\nWhile Zinke's congressional track record reflects commitment to Native American self-determination, Trump's past is not as clear.\n\"Secretary Zinke has always supported the principles of tribal sovereignty and self-determination,\" McCain said. \"That's an important pillar of our tribal relations.\"\nIn 1993, Trump's comments in a congressional hearing on Indian casinos shocked lawmakers and others.\n\"Go up to Connecticut, and you look (at the Mashantucket Pequots),\" Trump told the House Natural Resources Native American affairs subcommittee. \"They don't look like Indians to me.\"\nIn June 2016, then-presidential candidate Trump labeled Democratic Sen. Elizabeth Warren of Massachusetts \"Pocahontas\" -- a reference to her claimed Indian heritage.\n\"Pocahontas is at it again!\" Trump wrote in a tweet. \"Goofy Elizabeth Warren, one of the least productive U.S. Senators, has a nasty mouth.\"\nThe President resurfaced the comment in Atlanta on April 28 this year, telling a crowd of National Rifle Association members that \"it may be Pocahontas\" pursuing the Democratic presidential nomination in 2020.\nJUST WATCHED A hard look at the treatment of Native Americans Replay More Videos ... MUST WATCH A hard look at the treatment of Native Americans 01:54\nThe remarks were condemned by the National Council of American Indians, who in a May 3 statement called them \"derogatory.\"\n\"I'm disturbed by some comments the President has made,\" Sen. Tom Udall, vice chairman of the Senate Committee on Indian Affairs, told CNN. \"He has made some very derogatory comments about tribes. I hope Secretary Zinke encourages President Trump about the importance of self-determination, teach him about that, understand what it's all about.\"\nRecent executive actions have done little to assuage these worries, the New Mexico Democrat said. On the Dakota Access Pipeline and the planned border wall (which would cut a reservation in half ), Trump has moved ahead \"without talking to\" American Indian stakeholders, Udall said.\n\"He's taken action without consultation,\" Udall said. \"One of the cores of trust and responsibility is government-to-government consultation, talking with tribes that are concerned.\n\"It shows a complete lack of understanding of tribal sovereignty, self-determination -- things very, very important to tribes,\" Udall added.\nHowever, these are missteps that could be remedied with future collaboration, Udall said.\n\"The tribes are a little apprehensive,\" Udall said. \"But I think if they see an outreached hand, it is going to help get some things done.\"\nEducation\nOne issue that's already on Zinke's plate at Interior is Native American education. Speaking at a March 8 hearing of the Senate Committee on Indian Affairs, the secretary acknowledged the failings of the Bureau of Indian Education.\n\"Words cannot capture how terrible it is that children in schools overseen by Bureau of Indian Education are so poorly served,\" Zinke said.\nMany lawmakers agree that the schools should be a top priority for the new administration. But though Zinke has said he supports upgrading the schools, actually making changes is more difficult.\n\"He responded as you might expect (during the March 8 hearing) -- that he was committed to it, that he understood the challenges and the situation, and he said it was on his highest priority list,\" McCain said. \"He gave the right answers. And I believe him. But I've heard those same answers for years and years.\"\nAmong the things McCain said he would like to see: More federal funding for school choice initiatives.\n\"The answer to that in my view is to give the tribe access to BIE funds to be used for private tuition, tutors, classes, charter schools, so Native families have more choices,\" McCain said. \"I'm not saying charter schools are better or worse -- although I personally believe they're better -- but Native American parents should be able to have a choice where they want their children to go.\"\nAccording to a 2014 Government Accountability Office report , the Bureau of Indian Education spent about $15,391 per pupil annually -- compared to the average of $9,896 per student at public schools nationwide.\nDespite this, Government Accountability Office reports have found that BIE students have higher dropout rates, lower scores on college admission tests and lower college entrance rates than their public school counterparts.\n\"We have a long way to go when it comes to Indian education,\" Udall said.\nAnd the confirmation of Betsy DeVos as secretary of education has done little to assuage the New Mexico Democrat's concerns: \"The thing that worries me the most is the new education secretary,\" he said.\nDeVos's efforts to \"voucherize education\" \"could well apply to the Bureau of Indian Education,\" Udall said.\n\"I think that would be a real disaster,\" Udall said. \"It would be draining resources away from already depleted resources pool. That is not a good idea.\"\nHealth care\nAlso on Zinke and lawmakers' wish lists are improvements to Native American health care.\n\"The one (issue) I would really start with would be Indian health care,\" Udall said. \"It's been a hot-button issue.\"\nDuring his January 17 confirmation hearing , Zinke told lawmakers that \"as bad as the VA is, (Native American health) is worse.\"\nWith the ongoing GOP efforts to repeal the Affordable Care Act, lawmakers and advocates are unsure what the future may hold for the health care of the Native American community.\nAccording to Udall, Republicans are \"not involving Democrats\" in health care reform discussions; an exclusion that makes it difficult for the party to advocate for Indian-American rights.\n\"It's a closed-door affair,\" Udall said. \"The best advocates for Native Americans excluded from the table.\"\nGiven the underfunding of the Indian Health Service, many tribal members \"rely heavily\" on the Affordable Care Act's health exchange, Udall said. Were the federal government to cut discretionary spending -- as proposed in the President's budget -- and repeal Obamacare, tribes across the country would suffer, Udall said.\n\"The proposal in the budget is to increase defense dramatically at the expense of the domestic side,\" Udall said. \"With that proposal and the proposal on the Affordable Care Act, that could be a big hit on the tribes across the country.\"\nSpeaking at the March 8 hearing, Paul Torres, the chairman of Al Pueblo Council of Governors, also voiced concerns about the budget cuts.\n\"These across-the-board cuts are alarming because the majority of programs serving Indian Country fall under the category of discretionary spending and are not exempted under the President's proposed plan,\" Torres said.",
    "label": 3
}