{
    "index": 340,
    "text": "Almost from the moment U.S. Ambassador to the United Nations Nikki Haley took the stage at a recent women’s conference in liberal Manhattan, jeers and boos erupted.\nHaley flashed the crowd a smile, sitting with her hands folded in her lap. She had come straight from the U.N., where she had spoken emotionally about the poison gas attack in Syria that killed scores of civilians, the latest horror in the country’s civil war.\n“America leading,” she said, “is what we are trying to do.”\nMSNBC anchor Greta Van Susteren pressed Haley on the multiple investigations into whether President Trump’s current or former aides colluded with Russia during the 2016 campaign.\nAs Haley tried to answer, a heckler interrupted, “What about refugees?’’\nIt was the kind of crossfire that Haley, 45, has faced repeatedly since she resigned in January as a widely respected governor of South Carolina to join Trump’s team. Since then, she has become a high-profile voice on U.S. foreign policy, at times eclipsing Trump’s taciturn secretary of State, Rex Tillerson.\nAdvertisement\nHaley’s nomination had been a surprise and not only because she had no diplomatic experience: She had endorsed Trump’s rivals during the GOP primaries last year, and he tweeted in response that she had “embarrassed” her state.\nHaley already had been on the short list of rising GOP stars with a possible national future. Unlike many potential rivals, her role at the U.N. will keep her in the public eye, for better or worse, in the Trump administration.\nUnlike some of her predecessors at the U.N., Haley often displays a down-home charm that reveals her Southern upbringing, peppering her comments with “gonnas” and “wannas.”\n“And what we’re gonna say is it’s just not gonna work,” she told CBS News when asked about North Korea’s threats about using military force.\nAs a diplomat, however, Haley has been as contrarian as the president she represents.\nIn her debut speech at the U.N., she warned allies and rivals that they would “see a change in the way we do business.”\n“For those who don’t have our back,” she added, “we’re taking names.”\nBut she also has voiced more concern for human rights abuses than the White House, penning a column that said ignoring the issue leads to “a vicious cycle of violence and instability.”\nShe even has appeared to contradict, or at least politely correct, the president.\nA day after Trump seemed to jettison decades of U.S. policy and dismiss the possibility of a future Palestinian state, for example, Haley said at the U.N. that the administration “absolutely” supported a two-state solution with an independent Palestinian nation.\nHer relations with Trump are difficult to read.\nOn April 24, three weeks after the Manhattan event, Haley sat at the president’s side at an ornate table in the White House with ambassadors representing the 14 other nations in the U.N. Security Council.\nTrump initially scolded the ambassadors for diplomatic failures in North Korea and Syria, and branded the U.N. an “underperformer.” He then turned toward Haley, who sat beside him.\n“Does everybody like Nikki?” he asked his guests. “Otherwise, she can easily be replaced.”\nAwkward laughter followed until Trump finally added, “She’s doing a fantastic job.”\nMadeleine Albright, who served as U.S. envoy to the U.N. from 1993 to 1997, thought the episode strengthened Haley’s hand in diplomatic circles.\n“It showed they have a personal relationship, that he can kid her like that,” Albright said. “She is seen as somebody who can … have influence” with Trump.\nSome historians liken Albright’s headline-grabbing tenure as U.S. ambassador to the U.N. under a low-key secretary of State, Warren Christopher, to Haley’s high-wattage tenure so far under Tillerson, who deliberately kept a low public profile until recently.\n“It’s a delicate balancing act,” Albright said. The U.N. ambassador must explain U.S. policy to the world, but also keep an eye on reactions — and politics — in Washington.\nOn Friday, Haley definitely took the back seat when Tillerson made his debut speech to foreign ministers at the U.N. Security Council to address the threat from North Korea.\nThe daughter of Indian immigrants, Haley was born Nimrata Randhama in Bamberg, S.C., and later adopted her husband’s last name. She also converted from the Sikh faith to Christianity.\nAfter six years in the state Legislature, she became the first woman and the first person of color to win the governorship of South Carolina in 2010 — and then was reelected on a platform that was anti-tax and fiscally conservative. To this day, she wears a silver necklace with an image of the palmetto tree, symbol of her state.\nAs governor, she voted for bills that restrict abortion. As the child of legal immigrants, she called for greater enforcement of immigration laws, a position that put her in sync with Trump.\nHaley’s response to the 2015 church massacre of black worshipers by a self-declared white supremacist put her in the national spotlight. As the state mourned, she deftly arranged the gradual removal of Confederate flags from state property, a still-sensitive issue for the state that fired the first shots of the Civil War.\n“She is a very gifted politician,” said Jaime Harrison, chairman of the state Democratic Party, who noted that Haley had refused to commit to removing the flags when demands came up during her 2014 reelection race.\nHer political skills were tested at the Women in the World conference in Manhattan, where Trump clearly was not popular. Guffaws broke out when Haley complained that the Russians “just make things up,’’ a charge frequently leveled against Trump.\nHaley got her most enthusiastic response when she mentioned her predecessor at the U.N., Samantha Power, who had served under President Obama.\nPanelists at a later session ridiculed Haley after she left the stage. It was left to summit host Tina Brown, the magazine editor and author, to come to Haley’s defense.\n“She sat there very graciously, very courageously while people heckled,” she said. “She didn’t get agitated about it.’’\nbarbara.demick@latimes.com\ntracy.wilkinson@latimes.com\nDemick reported from New York and Wilkinson from Washington.\nALSO\nCongressional negotiators reach $1-trillion deal to fund government but provide little for Trump’s priorities\nPassing 100-day mark, Trump offers mixed signals on healthcare, taxes and North Korea\nCongress approves stopgap spending bill to prevent federal shutdown, but Obamacare repeal stalls",
    "label": 3
}