{
    "index": 690,
    "text": "NEW You can now listen to Fox News articles!\nAs chairman of the Senate Judiciary Committee, Sen. Chuck Grassley has worked diligently to help President Trump, a fellow Republican, assemble a hand-picked Cabinet -- but the Iowa senator is making clear he won’t be a pushover for the White House.\n“ANSWER MY LETTER,” Grassley demanded Sunday of the White House, regarding requests to declassify a “secret” refugee deal between the Australian government and former President Barack Obama.\nThe demand was among seven tweets Grassley fired off this weekend, several directed at \"Whoever monitors Twitter at the WH.\"\nThe 83-year-old Grassley is among Capitol Hill’s most prolific tweeters. But the content and tone of this weekend’s spree stood out, considering Grassley shepherded Alabama GOP Sen. Jeff Sessions through his panel's hearing on the way to Sessions being confirmed last week as U.S. attorney general.\nHis committee soon will begin hearings on what is widely considered Trump’s most important pick -- Judge Neil Gorsuch for the Supreme Court.\n“We have a president that is messaging on Twitter and communicating that way,” Grassley said matter-of-factly Monday on Fox News' \"America's Newsroom.\" “Seems to me, it’s legitimate for me to do it. … Twitter is a way of getting people thinking about things.”\nOn Sunday, Grassley sent the White House tweets on a range of issues -- from plans to protect whistle-blowers to when the president’s home and office will be reopened for public tours -- in addition to his call for more transparency.\n“Whoever monitors Twitter at WH for President Trump read my previous 2tweets and hv this businessman understand TRANSPARENCY=ACCOUNTABILITY,” Grassley wrote in one of the tweets.\nA top Grassley concern is a deal Obama reportedly cut with Australian Prime Minister Malcolm Turnbull just days before Trump’s November election victory to bring roughly 1,200 refugees to the United States from offshore Australia detention centers.\nThe deal was purportedly a contentious topic when Trump and Turnbull spoke by phone earlier this month.\n“Grassley has always sort of struck me as more independent-minded Republican,” Tony Reiss, a GOP operative in South Dakota, said Monday.\n“Elections do have consequences, and the president should be able to fill his Cabinet and the courts as he sees fit. But classification shouldn't be used to cover up blunders, on either side of the aisle. Under normal operating procedures, the default should be openness and transparency.”",
    "label": 3
}