{
    "index": 185,
    "text": "This past week's ransomware attack, in which 200,000 computer users in 150 countries were affected, was unparalleled in its scope and sophistication, said former CIA deputy director and CBS News senior national security contributor Michael Morell.\n\"We have never seen a cyberattack with this kind of breadth,\" Morell said on \"CBS This Morning\" on Monday.\nIn the attack, a computer user's files are encrypted and made no longer readable.\nHackers would demand $300 in ransom to decode them, or they would be destroyed.\nThe malware program is called \"WannaCry,\" and it was first uncovered in documents stolen from the U.S. National Security Agency, exposing a vulnerability to Microsoft's operating system.\nMorell said the \"WannaCry\" cyberattack was also notable for its sophistication.\n\"There are two pieces to this: One was basic phishing attacks to get inside networks; that happens every day. But the second piece was lateral movements inside of a network once you are inside. So it spread very, very rapidly, and that is very unusual, and very frightening.\"\nFormer CIA deputy director and CBS News senior national security contributor Michael Morell. CBS News\nHe said it was more likely that organized crime was behind the attack rather than a nation state, given the demands for ransom in order to free up the encrypted data. \"So that makes it the largest cybercrime attack we have ever seen before,\" Morell said.\nWhen asked by the United States fared much better than other countries from the attack, Morell credited America's cybersecurity (\"better than any other place in the world\") and the fact that the U.S. has appropriate and up-to-date versions of Microsoft compared to other parts of the world, where older or pirated versions of the Microsoft operating system are being used.\n\"That's one of the reasons Russia was hit so hard: Pirated versions can't be patched, either,\" he said.\nOn the matter of North Korea, Morell was asked if their recent missile tests were a game-changer in their relations with the U.S. Morell doubted it: \"You have to be careful of taking the North Koreans at face value. They've made claims before in the past that haven't been true.\"\nBut he added that the recent missile launches, successful or not, underscored the acceleration of Pyongyang's missile development program. \"It's not slowing and it's not going to stop. They are willing to sit down and negotiate with us but they're not willing to give up these weapons or their missiles,\" he said.\nMorell was also asked to weigh in on President Trump's search for a replacement for FBI Director James Comey, whom he fired last week in the wake of the Bureau's growing investigation into his administration's links to Russia.\nWhen asked if any candidate stands out to him, Morell said no. \"I think what's important -- and I think it is widely-recognized -- that the individual chosen has to be non-partisan, has to be objective, and has to be seen as such by both Democrats and Republicans. And that is the only way this is going to work.\"",
    "label": 2
}