{
    "index": 403,
    "text": "Trump to NRA: The 'assault' on gun rights is over\nShow Caption Hide Caption Trump rallies NRA 'friends' on eve of 100-day milestone Ninety-nine days into office President Donald Trump jets into Atlanta, Georgia, to address the National Rifle Association, earning a triumphant welcome from the hugely powerful US gun lobby. Video provided by AFP Newslook\nATLANTA – President Trump spent the eve of his 100th day in office with some of his most fervent supporters, talking about two of his favorite topics: Gun rights and his surprise win of the November election.\n\"The eight-year assault on your Second Amendment freedoms has come to a crashing end,\" Trump told the annual National Rifle Association convention, part of a drumbeat of events designed to herald his 100th day in office on Saturday. \"You have a true friend and champion in the White House.\"\nThe thousands of NRA members who gathered in a concrete convention hall in downtown Atlanta are the kinds of people who remain committed to Trump, despite the political travails and low national approval ratings of his early months in office – and they in no way regret their choice of a president they helped elect.\n\"So far, I think he's done better than he's been given credit for in the media,\" said Kathleen Mahn, 45, a stay-at-home mom and fitness instructor in Peachtree City, Ga., after cheering Trump's remarks.\nPlaying to the political interests of the NRA crowd, Trump outlined a series of actions he's taken that he said were designed to protect gun rights, such as nominating Supreme Court Justice Neil Gorsuch and Attorney General Jeff Sessions.\nOnly the second president to address the NRA convention – the first was Ronald Reagan in 1983 – Trump barely mentioned the impending 100 day mark, a traditional yardstick to measure the accomplishments of presidents early days in office. But he made sure to defend his record during his first three-and-a-half months, from taking action to improve the Department of Veterans Affairs to cracking down on illegal immigration.\nThanking gun owners for their support and get-out-the-vote efforts, Trump also spoke warmly of Election Day – \"wasn't that a great evening?\" he said at one point – and hit frequent campaign themes, touting his \"America First\" trade policy and the slogan \"Make America Great Again\" that adorned the hats of many supporters.\nTrump also mocked the large group of Democrats who are already exploring possible presidential runs against Trump in three years, taking a special shot at the Native American heritage of Sen. Elizabeth Warren, D-Mass. \"It may be Pocahontas, remember that,\" Trump said of his potential re-election opponent. \"And she is not big for the NRA, that I can tell you.\"\nWhile a series of national polls give Trump record-low approval ratings for a new president, they also reveal strong and continuing support among Republicans.\nA recent ABC News/Washington Post survey gave Trump an overall approval rating of only 42%, but also said that 96% of the people who voted for him last November still back him. The poll also Trump would win a hypothetical re-match with Democrat Hillary Clinton, 43% to 40%.\nThat support among conservatives was evident as volunteers and vendors set up booths – \"15 Acres of Guns & Gear,\" the signs say – throughout the Georgia World Congress Center ahead of Friday's NRA meeting. \"The gun owners are middle America,\" said Ron Sasaki, 49, a police officer from western Washington state and member of a group called AmericanSnipers.org. \"We relate to him more, and he relates to us more, than regular politicians.\"\nNRA members who watched Trump praised him not only over gun rights, but for other efforts like his tax cut plan and his promise to build a wall along the U.S.-Mexican border. They also dismissed critics of these and other Trump plans.\n\"The minute anything comes out of his mouth, they're going to oppose it,\" said Don Spruill, 75, a retired marketer for Coca-Cola who lives in Marietta, Ga., of Trump's opponents.\nWife Judy Spruill echoed other NRA members in her disdain for Washington politicians, and the fact that Trump doesn't resemble them.\n\"He is so politically incorrect,\" she said. \"We love that; at least I do.\"\nFor their part, NRA officials also defended Trump's 100-day progress and denounced his critics. Chris Cox, executive director of the NRA's lobbying arm, told members ahead of Trump's speech they were the ones who helped get him elected, telling them \"we didn't just swing an election, we altered the course of history.\"\nWayne LaPierre, executive vice president of the NRA, said gun owners must beat back \"leftist zealots\" who are determined to \"destroy President Trump.\"\nMeanwhile, lawmakers are throwing cold water on the idea that Trump's early days in office have been successful. They denounced his failed efforts to replace President Obama's health care bill, and executive orders designed to de-regulate Wall Street financial firms and coal and mining companies.\nThey also insist that Trump's pro-NRA agenda, including his opposition to expanding background checks, leads to the proliferation of guns and violence in the U.S. “President Trump in his first 100 days has had more false starts, failed policies and bad ideas than most presidents have in an entire term,\" said Sen. Dianne Feinstein, D-Calif.\nAfter the NRA speech, Trump attended a fundraiser for Republican congressional candidate Karen Handel, who is seeking the suburban Atlanta U.S. House seat vacated by current Health and Human Services Secretary Tom Press.\nThe race that's been closer than expected will be an early test of the \"Trump effect\" ahead of next year's congressional elections nationwide.\nTrump sought to rally NRA members ahead of the vote, saying that Handel is \"totally for the NRA and she's totally for the Second Amendment, so get out and vote.\"\nBefore Trump's speech, one of the signs that flashed on a video board in the hall said that \"even after the election, the anti-gun left still has us in their cross-hairs.\"\nTrump played up those kinds of concerns, claiming that some people want \"to abolish the Second Amendment,\" even though no serious lawmaker has made such a proposal.\n\"I greatly appreciated your support on November 8th in what will hopefully be one of the most important and positive elections for the United States of all time,\" said Trump, who is preparing to mark his 100th day with a Saturday night rally in Harrisburg, Pa., one of the key states behind his Electoral College victory.\n\"And to the NRA, I can proudly say, I will never, ever let you down.\"",
    "label": 3
}