{
    "index": 738,
    "text": "Stephen Miller, a senior adviser to President Donald Trump, is now working on women’s issues in the White House despite having once forcefully argued against paid maternity leave and equal pay legislation, according to unnamed White House officials cited in a Politico report Thursday night.\nMiller, 31, will work with Ivanka Trump, the president’s daughter and senior adviser, on women’s issues including family leave and child care, according to Politico’s report.\nAdvertisement\nIn a White House where men named Steve (Bannon, Mnuchin, Miller) essentially outnumber women in the uppermost ranks, it’s not surprising that a man is working on women’s issues.\nBut Miller’s thinking on women’s issues is troubling, as evidenced by an op-ed he wrote in 2005 as a junior at Duke University. In “Sorry feminists,” he claims that the gender pay gap is a myth. Women make less than men, Miller argues, because men work longer hours, choose higher-paying jobs and take on more dangerous work.\n“The pay gap has virtually nothing to do with gender discrimination. Sorry, feminists. Hate to break this good news to you,” he writes.\n“The truth is, even in modern-day America, there is a place for gender roles,” he adds. “I simply wouldn’t feel comfortable hiring a full-time male babysitter or driving down the street and seeing a group of women carrying heavy steel pillars to a construction site.”\nAdvertisement\nThe essay reveals a lack of understanding when it comes to decades of research on economics and gender inequality, although that’s not very surprising considering Miller’s age when he wrote it.\n“The image of Stephen Miller, a well-documented misogynist, heading up the White House’s ‘women’s issues’ department would be laughable if it wasn’t so horrifying,” Stephanie Schriock, president of Emily’s List, said in a statement.\nSenior adviser to the president Stephen Miller attends a joint press conference by President Donald Trump and Canadian Prime Minister Justin Trudeau on Feb. 13. He is now working with Ivanka Trump on women's issues, Politico reports. MANDEL NGAN via Getty Images\nIn the piece, Miller argues that closing the pay gap would mean women would have to “trade in jobs like housekeeping for night shifts doing road repairs.”\nLike a good many pay gap deniers, Miller says women make less because they “choose” to ― ignoring the constraints that gender roles put on our choices. For example, our education system encourages boys to study science and math, which lead to higher-paying jobs. And in the work world, the system favors white men white men like Miller ― in pay and promotions ― over all other demographics. The lack of paid maternity leave also forces women out of the workforce, lowering their pay potential over a lifetime and reinforcing the pay gap.\nAdvertisement\nBeyond that, there is research that shows that a pay gap remains, even after you control for the fact that women-dominated fields pay less than male-dominated fields and that women may take longer breaks from the workforce.\n“The truth is, even in modern-day America, there is a place for gender roles.” - Stephen Miller, in a 2005 op-ed\nMiller goes farther still in that op-ed, arguing that paid maternity leave ― something that every developed country in the world mandates ― would harm businesses and lead to layoffs. There is plenty of research showing that paid leave actually helps companies lower costs by retaining women ― they’re far less likely to quit jobs, and businesses spend less money hiring and training replacements.\nAt the prompting of Ivanka during the presidential campaign, Trump proposed a paid maternity leave policy of six weeks off for birth mothers. The president seemed to expand on that policy when he mentioned paid family leave during a speech to Congress in February. Nothing has been done on this issue thus far.\nIvanka also claimed at the Republican National Convention last summer that her father would work to close the pay gap.\nAdvertisement\nThis article has been updated with comment from Schriock.\nGet more news and opinion on gender and economics from Emily Peck in her newsletter. Sign up here.",
    "label": 3
}