{
    "index": 271,
    "text": "Washington (CNN) Then-President Barack Obama warned President-elect Donald Trump in November against hiring retired Lt. Gen. Michael Flynn as his national security adviser , former Obama administration officials confirmed to CNN Monday.\nObama warned Trump about Flynn during their Oval Office meeting on November 10, days after Trump was elected president.\n\"Given the importance of the job, the President through there were better people for it, and that Flynn wasn't up for the job,\" a former senior Obama administration official told CNN Monday.\nOther former Obama administration officials said then-Director of National Intelligence James Clapper didn't think highly of Flynn, and in fact was the person who recommended Flynn's firing as DNI in 2014. Flynn's focus was generally limited to terrorism and didn't know much about many other issues important for the national security adviser job, such as China, the officials said.\nBut at least one former Obama official disputed that, saying Obama's concerns were not related to the firing of Flynn from the Defense Intelligence Agency but rather in the course of the investigation into Russian interference into the 2016 election.\n\"Flynn's name kept popping up,\" according to a senior Obama administration source.\nThe White House confirmed later Monday that Obama raised concerns about Flynn during his Oval Office sitdown with Trump in November.\n\"It's true President Obama made it known he wasn't exactly a fan of Gen. Flynn's,\" press secretary Sean Spicer said.\nHe said the concerns shouldn't have come as a surprise, since Flynn was an \"outspoken critic\" of the Obama administration's shortcomings on foreign policy.\nSpicer said if the Obama administration was \"truly concerned\" about Flynn, there are steps it could have taken, including suspending his security clearance.\nFlynn previously served as the head of the Defense Intelligence Agency under Obama until he was reportedly forced out of the post 2014 over internal disagreements over policy and management.\nTrump did not heed Obama's counsel on Flynn, bringing aboard the former military intelligence officer who supported Trump during his campaign as his national security adviser. Trump fired Flynn 24 days later when news broke of Flynn's conversations with Russian Ambassador to the US Sergey Kislyak.\nNews of the warning comes as former acting Attorney General Sally Yates is set to testify before Congress on Monday about the concerns she expressed to Trump administration officials about Flynn's contacts with Russian officials, namely with Kislyak.\nYates, in her role as acting attorney general, warned White House counsel Don McGahn on January 26 that Flynn was lying when he denied -- both publicly and privately -- that he discussed US sanctions on Russia with Kislyak. It wasn't until weeks later that Trump asked for Flynn's resignation, only after news surfaced that Flynn had misled Vice President Mike Pence about his conversations with Kislyak.\nJUST WATCHED Trump: I feel badly for Michael Flynn Replay More Videos ... MUST WATCH Trump: I feel badly for Michael Flynn 01:31\nAccording to five current and former intelligence officials, their concern started around the time Flynn went to Moscow for the 10th anniversary gala of the state-sponsored news agency Russia Today. At that dinner, the former high-ranking intelligence official was seated right next to Russian President Vladimir Putin. He also had contact with Kislyak after the trip.\nFormer US officials were highly suspicious of Kislyak and his motives, and there were concerns Flynn didn't seem to understand the dangers in the conversations, the officials said. As was reported over the weekend, even Trump's own team was concerned enough to request a CIA profile of the Russian ambassador to help illustrate to Flynn he was taking a big chance in his interactions with Kislyak.\nYates' testimony on Monday will be the first time she speaks publicly about her warnings to the White House about Flynn.\nThe Senate and House intelligence committees are continuing to investigate Russian interference in the 2016 election, including potential coordination between Russian officials and the Trump campaign or people close to the campaign.\nCongressional investigators have so far homed in on Flynn, Carter Page, a former foreign policy adviser to the Trump campaign, and Roger Stone, who informally advised Trump during his presidential run.\nWhile Trump asked for Flynn's resignation, he has not abandoned his former national security adviser altogether.\nTrump on Monday morning sought to get ahead of Yates' testimony, taking to Twitter to deflect criticism that he or his administration should have kept Flynn out of the top national security post from the outset.\nGeneral Flynn was given the highest security clearance by the Obama Administration - but the Fake News seldom likes talking about that. — Donald J. Trump (@realDonaldTrump) May 8, 2017\nAsk Sally Yates, under oath, if she knows how classified information got into the newspapers soon after she explained it to W.H. Council. — Donald J. Trump (@realDonaldTrump) May 8, 2017\n\"General Flynn was given the highest security clearance by the Obama administration -- but the Fake News seldom likes talking about that,\" Trump said in his first missive.\n\"Ask Sally Yates, under oath, if she knows how classified information got into the newspapers soon after she explained it to W.H. Counsel,\" he tweeted.\nFlynn began advising Trump on national security in early 2016 and soon became a constant presence by Trump's side as he crisscrossed the country from rally to rally.\nHe frequently introduced Trump on the campaign trail, delivering introductory remarks rife with criticism of the Obama administration's foreign policy and of Democratic nominee Hillary Clinton. Flynn often led Trump supporters in chants of \"Lock her up!\" as he accused her of corruption and negligence in her use of a private email server.\nTrump came to value Flynn not only for his like-minded view of global affairs but for his loyalty throughout the campaign.\nCNN's Jake Tapper, Kevin Liptak, Pamela Brown and Gloria Borger contributed to this report.",
    "label": 2
}