{
    "index": 3,
    "text": "The president has signed more legislation but has yet to take a foreign trip.\n— -- While President Trump's first 100 days in office have produced few major legislative breakthroughs, there are still plenty of statistics to analyze.\nHere are a few interesting facts and figures, and how some of them compare to those of his predecessor, Barack Obama.\n1. Trump has signed more legislation than Obama\nAt this point in 2009, President Obama had signed 15 bills into law. Despite his administration’s lack of big-ticket legislative successes that the president himself spearheaded, Trump has signed 29 bills so far.\n2. 45 close to surpassing 44’s first-year golf total\nObama, the 44th president, hit the links 29 times in 2009, according to unofficial presidential chronicler Mark Knoller. Trump has already made 21 visits to golf clubs, by ABC News’ count. (Note: the White House has often declined to confirm if/when Trump has actually played.)\n3. Trump way behind on foreign travel\nPresident Donald Trump and first lady Melania Trump walk down the stairs of Air Force One as they arrive at the Palm Beach International Airport, April 6, 2017, in West Palm Beach, Fla., en route to Mar-a-Largo for meetings with Chinese President Xi Jinping. Alex Brandon/AP Photo\nTrump has not yet traveled outside the United States since taking office. By comparison, at this point in his young presidency, Obama had made four trips abroad, his first on Feb. 19 to Ottawa, Canada, according to the State Department. Assuming he doesn’t add any trips before his May 25 appearance at the NATO summit in Brussels, Trump will have been in office the longest number of days, without a foreign trip, since Lyndon B. Johnson, who traveled to Canada 10 months after his emergency swearing-in Nov. 22, 1963.\n4. Trump has exercised his executive authority more than Obama\nCritics have pointed to the number of executive orders Trump has signed, on things like advancing the Keystone Pipeline, as an abuse of power. Trump has signed 10 more executive orders than Obama did at this point in his presidency (30 versus 20).\n5. Three trips to Trump’s other Pennsylvania Avenue address\nObviously, Trump has made history by becoming the first president to also develop a hotel in the nation's capital. But while the hotel there has become the place for Republicans to see and be seen, the president himself has visited three times since his swearing-in.\n6. Press briefings, conferences on par with Obama\nPresident Donald Trump speaks at a press conference at the White House in Washington, Feb. 16, 2017. ABC News\nTrump decries the \"lying media\" and \"fake news\" but he’s just about even with his predecessor when it comes to official media opportunities. Press secretary Sean Spicer has briefed the press on-camera 42 times, while at this point in 2009 Robert Gibbs held 40 briefings. Trump has done nine news conferences, while Obama had done 12.\n7. One interview each with ABC News\nBoth Presidents Obama and Trump sat for one interview with ABC News: Obama with Charles Gibson Feb. 3 (the big news: Tom Daschle’s withdrawal from consideration as HHS secretary), and Trump with David Muir Jan. 25 (when he said Mexico would “absolutely” pay the United States back for the border wall).\n8. Almost 20 percent of his time has been spent at the ‘Southern White House’\nTrump will have spent 18 nights, just under one-fifth of his first 100 days, at his Florida retreat Mar-a-Lago.\n9. Daily briefings - not every day\nAs president-elect, Trump said he wouldn’t need to receive the presidential daily briefing, which covers the latest in national security and intelligence issues, every day. And he has held true to that assertion since taking office. The president has received the PDB 48 times, just less than half of his time in office so far, according to ABC News’ analysis.\n10. Foreign engagement by-the-numbers\nPresident Donald Trump meets with German Chancellor Angela Merkel in the Oval Office of the White House, March 17, 2017. Evan Vucci/AP Photo\nHe hasn’t traveled abroad yet but Trump has talked to many world leaders. He has had 65 phone calls with them, 13 bilateral meetings in the West Wing, two such meetings at Mar-a-Lago and has written two letters to foreign heads of state.\nTrump has held two phone calls with Russian President Vladimir Putin, but he has been in contact the most frequently with German Chancellor Angela Merkel, with whom he has spoken five times by telephone.",
    "label": 3
}