{
    "index": 393,
    "text": "Conservationists alarmed by Trump Interior nominee\nPresident Trump on Friday chose lobbyist and former Bush administration official David Bernhardt as his nominee to become deputy Interior secretary, drawing criticism from conservationists who said the lawyer’s history of representing oil companies and agricultural interests raises troubling questions about potential conflicts of interest.\nBernhardt has led Trump’s transition team for the Interior Department and is a shareholder of the law firm Brownstein Hyatt Farber Schreck LLP, where he has represented energy and mining companies and lobbied for California’s Westlands Water District, the largest agricultural water agency in the country.\nHe leads the firm’s Natural Resources Department, which also includes fellow shareholder Scott Slater, the president and CEO of Cadiz Inc., which is pursuing a controversial plan to pump groundwater in the Mojave Desert and sell it to Southern California cities.\nCritics said Bernhardt’s nomination flies in the face of Trump’s campaign pledges to “drain the swamp” and clean up Washington.\n“David Bernhardt is a walking conflict of interest,” said Aaron Weiss, media director for the Center for Western Priorities, a Denver-based advocacy group. “He would need to recuse himself from any discussions or decisions involving Cadiz, involving Westlands Water District, involving the offshore clients he has worked with. It is a very long list.”\n24 national monuments threatened by Trump's executive order\nSenate confirms Montana Rep. Ryan Zinke as Interior secretary\nIf confirmed as deputy secretary, Bernhardt would help lead a department that oversees the National Park Service, the Bureau of Indian Affairs, the Fish and Wildlife Service and other divisions with responsibility for managing dams and administering 245 million acres of public lands — about one-tenth of the country’s land area.\nInterior Secretary Ryan Zinke said that Bernhardt’s experience both in government and in his legal work “is exactly what is needed to help streamline government and make the Interior and our public lands work for the American economy.”\nConservation activists, however, said they expect Bernhardt would be an advocate for more oil and gas drilling and mining who would also weaken protections on endangered species.\nIleene Anderson, a senior scientist with the Center for Biological Diversity, said it’s concerning that Bernhardt’s law firm has a financial interest in the Cadiz water project, which would involve pumping groundwater from an aquifer in the Mojave Desert and building a 43-mile pipeline along a railroad line to send the water to cities.\nCourtney Degener, Cadiz’s vice president of communications and external relations, said Bernhardt has never lobbied on behalf of the company.\nStill, some environmentalists said they suspected Bernhardt played a role when the Interior Department announced a policy change last month that could facilitate the project. Under that change, the agency scrapped guidelines on how federal officials should evaluate the uses of public lands running alongside railroads.\nAnderson, who has fought the Cadiz project for years, said she thinks the recent change in the agency’s position is “undoubtedly a direct result of Mr. Bernhardt’s influence.”\nWeiss pointed to records showing the Brownstein law firm owns shares in Cadiz and has an agreement under which the company would gain more shares if the water project is completed.\nAsked about that agreement, Lara Day of Brownstein Hyatt Farber Schreck said in an email that the law firm doesn’t comment on its financial arrangements with clients.\nBernhardt’s nomination must be confirmed by the Senate. If confirmed, he would be bound to comply with federal ethics standards.\nBernhardt worked as a lawyer and lobbyist for the Brownstein firm before he joined the Interior Department under President George W. Bush in 2001. After holding several positions, including deputy solicitor and deputy chief of staff, he was confirmed by the Senate in 2006 as the department’s solicitor — the agency’s top lawyer.\nHe returned to the law firm in 2009 and was involved in lobbying until November, when he terminated his registration as a lobbyist for Westlands and joined the Trump transition team.\nRecords list $32,150 in political contributions from Bernhardt to Republicans in 2015 and 2016, including to Sen. John McCain of Arizona and Sen. Dan Sullivan of Alaska, as well as members of Congress such as David Valadao and Paul Cook of California, and Rob Bishop of Utah.\nValadao said on Twitter on Friday that Bernhardt “is a dedicated public servant w/the knowledge and expertise to effectively serve as Deputy Secretary.”\nBernhardt’s law firm also has a political action committee that records show made $265,500 in political contributions to federal candidates in 2016, with 66% of the contributions going to Republicans and 34% to Democrats.\nThe Center for Biological Diversity said in a statement that Bernhardt has represented a “who’s-who of special interests,” from energy companies to Rosemont Copper, which is seeking to develop a copper mine in the Santa Rita Mountains in Arizona. The conservation group also noted that Bernhardt’s lobbying for the Westlands Water District has focused on legislation relating to the Sacramento-San Joaquin River Delta that would benefit large agricultural businesses to the detriment of endangered fish.\nBrett Hartl, the center’s government affairs director, expressed concern that Bernhardt would be a “go-to guy” for Republicans such as Bishop, who has called for repealing the Endangered Species Act.\n“In his long career taking advantage of the revolving-door of special interests, Bernhardt has always sided with big business at the expense of our most imperiled wildlife,” Hartl said. “If confirmed he’d be a disaster for all endangered species.”\nRepublican allies defended Bernhardt’s record. Former Interior Secretary Dirk Kempthorne described him as thoughtful and fair, saying he was widely respected within the agency for his leadership and management skill.\nDuring the confirmation hearings, though, he’s likely to face questions about the companies he has represented and how he intends to avoid conflicts of interest.\nKate Kelly, a former senior adviser to Interior Secretary Sally Jewell during the Obama administration, called Bernhardt’s nomination troubling.\n“He is going to be working on policies affecting clients for whom he lobbied just months ago,” said Kelly, now public lands director at the Center for American Progress, a research and advocacy organization.\n\"We need to understand what he would recuse himself from should he be confirmed,\" Kelly said. \"I think we just need a lot more sunlight.\"\nFollow Ian James on Twitter: @TDSIanJames",
    "label": 2
}