{
    "index": 399,
    "text": "Trump may take Arizona's school tax credit program national\nPHOENIX -- Arizona has offered tax breaks in exchange for donations to private-school scholarships for two decades. Seventeen states have followed in the Grand Canyon State's footsteps.\nThe federal government could be next.\nPresident Donald Trump has proposed investing $250 million into a private-school-choice program, though he has offered no details on what it would involve. Education experts have indicated it could be a voucher program similar to the program Arizona just expanded, but say it's more likely to be a tax credit similar to Arizona's School Tuition Organization program.\nThe Trump administration on Wednesday announced some broad information on the president's tax-cut proposal but did not provide details on specific tax credits that may be included.\nArizona’s private-school tax-credit program consists of four separate tax credits, two for individuals and two for corporations. Donations are made to qualifying school tuition organizations, which then allocate scholarships for students at private schools. Individual taxpayers this year can get a dollar-for-dollar tax credit of up to $1,086 for donations.\nBoth Trump and Secretary of Education Betsy DeVos have shown an interest in the latter in recent months, and DeVos' ties with school tax credits and Arizona are numerous.\nUntil her appointment, DeVos oversaw the American Federation for Children, one of the most influential national school-choice advocacy groups in the nation. The organization she founded and helped fund spent more than $200,000 to elect conservative lawmakers to the Arizona Legislature last year.\nGov. Doug Ducey is a vocal supporter of DeVos, as are Arizona's charter school and other state school choice leaders.\nTrump and DeVos in March visited a Florida private school that benefits from that state's tuition tax-credit program. And Trump in his speech to the joint chambers of Congress recognized a Florida student who benefited from a school tax-credit scholarship.\n“We see the tax credit as a great option for getting children into better schools.”\nWhile Florida's tax-credit program is larger and garners more national attention than Arizona's, it allows only corporations to donate to scholarship organizations. Republican bills in the U.S. House and Senate propose a program that would allow individuals and corporations to claim a tax credit for donating to a K-12 school scholarship-granting organization — a nearly identical setup to what exists in Arizona.\nTommy Schultz, national communications director for the American Federation for Children, said the group believes a tax-credit program is Trump's \"most likely and most viable\" option at this point. The organization is working with Congress on federal legislation.\n\"We see the tax credit as a great option for getting children into better schools,\" he said, saying it would be politically easier to pass a tax credit as part of a tax-reform bill package than to try to push a new voucher program through Congress.\n\"We have seen, like in Arizona, tremendous momentum in the states. For the first time in quite a while, we have the opportunity to get something done in Washington, D.C.,\" he said.\nArizona's program provides scholarships to help thousands of students attend private school each year. Supporters say it gives parents, some of whom would not otherwise be able to afford a private education, more access to the schools of their choice. According to the data, more than half of the scholarships are allocated to students from low-income families.\nBut critics warn that Arizona should provide some cautionary lessons for a federal system.\nArizona's program has exploded over the past two decades, and public-school advocates say that has come at a significant cost to the state coffers as Ducey and the Legislature struggle to find enough money to fund students and teachers.\nLeading the way\nArizona created the nation’s first tax credit for private education 20 years ago.\n\"We sort of invented the wheel,\" said Senate President Steve Yarbrough, R-Chandler, who oversees a tax-credit organization and has for years spearheaded legislation on the issue.\nYarbrough said he thinks a tax-credit program would likely be more politically palatable to the public than a voucher or empowerment scholarship account program. For one, he said, the U.S. Supreme Court has already deemed Arizona's program constitutional.\nGO IN-DEPTH:Private-school families cash in on tax-credit program\n\"ESAs, that's the government's money that you're spending,\" he said. \"With tax credits, the United States Supreme Court has said that's the people's individual donation, that's private money. There's a big, big difference between those two.\"\nAnd who better than Arizona to be the model, he said, with a lot of experience to offer the federal government.\n\"We've had our stops and starts, ups and downs,\" he said. \"We started off with a one-page bill, and today we have a 96-page Department of Revenue manual.\"\nMost other states with tax-credit programs require that all scholarships go to lower-income students. Arizona directs only a portion of its scholarship to lower-income students.\nThe federal legislation proposes scholarships for students at or below 250 percent of the federal poverty level, or about $61,500 for a family of four.\nIn Arizona, 55 percent of the scholarship money given through the tax-credit program in 2016 went to children of “low income” families, defined as those earning 185 percent of the federal poverty level, or $44,955 for a family of four, according to data acquired by The Arizona Republic.\nSlow growth?\nArizona also is unique in that it has no cap on the amount of credits available, which has a direct impact on the state's general fund. Most other states cap their program at less than $10 million. Trump proposed a $250 million cap, at least to start.\nYarbrough called that amount \"crumbs on the table\" of the federal budget.\nBut Schultz said it would be a start.\n\"We'd love to see all 50 states participate,\" Schultz said. \"So states that don't have school-choice programs get a choice to participate and states like Arizona and Florida that do have programs can expand what they've already got going on.\"\nAnd if Arizona were the model, the name of the game may be gradual expansion.\nArizona officials promised the program would primarily benefit special-needs and low-income students. But they've consistently expanded the program over the years, opening it to all students. A program that legislative budget staff in 1997 estimated would cost $4.5 million a year now tops $150 million.\nIn fiscal 2016, according to data from the Arizona Department of Revenue, Arizonans claimed $100 million in individual tax credits. Corporations claimed another $56.6 million.\nAnd that doesn’t include $48 million in tax credits handed out separately for public-school extracurricular activities.\nState hit?\nSupporters of Arizona's tax-credit program have for years said its a financial gain for the state because scholarships total less per student than the state would pay to educate that student in a public school. The average tax-credit-funded scholarship, individual and corporate combined, was $3,378 in fiscal 2016. However, the state does not track how many students received multiple scholarships — a common occurrence. About 24,000 scholarships were issued that year. The state in 2016 allocated $3,600 per student in public schools, although children with special needs qualify for much more.\nIn some cases, the state may be paying more to send a non-special needs child to private school than it would pay to send that same child to public school.\nFor example, according to 2016 state data, the average scholarship for The Gregory School in Tucson, which serves middle and high-school students, was $4,307. The average for The Orme School, a private boarding school near Prescott, was $7,049. The average for Pardes Jewish Day School in Scottsdale, which serves grades K-8, was $3,617.\n“It's criminal how we pull money from the general fund and we just divert it into these school tuition organizations.”\nBut critics have said the program is a drain on the general fund because many of these children would never have been on the state school rolls in the first place. Data seems to confirm that, showing that fewer than 30 additional students have joined the state's private-school rolls in nearly 20 years.\nAccording to the U.S. Department of Education's National Center for Education Statistics, Arizona's private-school population grew .06 percent from 1997 to 2014, from 44,991 to 45,019 students. The public school population during that same period grew 24 percent, from 879,259 to 1.09 million.\nThat trend, in particular, concerns critics of the program, who say every dollar donated to a school-tuition organization is a dollar that an individual or a corporation does not pay into the state’s general fund, which pays for public education.\nThere’s no way to know how much Arizona’s program will grow over the next decade because the state lacks a cap. The Joint Legislative Budget Committee staff, which provides data projections on myriad other items as the Legislature develops a budget, has no projections available for the program’s individual tax credits.\nThe “low income” corporate tax credit alone is permitted to grow by 20 percent each year. Corporations must apply in advance to qualify for this credit, and it typically hits its cap within a matter of hours of being opened to applications.\nThis year, corporations will qualify for $62 million worth of credits. The cost to the state grows to $107 million by 2020 and $138 million by 2025 and $165.5 million by 2026 , according to an analysis by the Children's Action Alliance.\n\"It's criminal how we pull money from the general fund and we just divert it into these school tuition organizations,\" said Joe Thomas, president of the teacher advocacy group the Arizona Education Association. \"You've got everybody paying these tax dollars, and it's getting diverted to the wealthy. That's really the only people that benefit from all this stuff.\"\nFederal education spending hit?\nA federal tax program would have a similar impact on federal coffers — decreasing the amount of money the federal government receives in taxes that are then used to pay for education, among other programs. But given the size of the federal budget and the current $250 million limit on the program, the impact to the $4 trillion federal budget would proportionally be minimal.\nDuring a recent forum hosted by the Washington, D.C.-based Thomas J. Fordham Institute, which promotes school reform, school-choice leaders said a federal tax-credit program could be rolled out nationwide or it could be set up to allow states to choose whether they will opt in and oversee the scholarship administration organizations.\nThomas W. Carroll, president of the New York-based school-choice advocacy group Invest in Education, was among the speakers at the forum.\n\"You have what I view as a once-in-a-lifetime opportunity to get something very bold done on school choice, something that applies to all 50 states,\" Carroll said during the forum. \"I vote for going big.\"\nHe said he supports a dollar-for-dollar federal tax credit, like Arizona offers.\n\"It's not (government) spending,\" he said, referring to the federal court opinion upholding Arizona's program. \"It's individual people's money spending the money they earned in the first place. The government is simply stepping back and taking less money.\"\nHe said he believes it should be offered to citizens regardless of which state they live in.\nCritics see it differently.\nThomas, with the state teachers' association, said school tax credits are not financially good for states.\n\"I would urge every state to take a hard look at where our public school funding is, and that should tell them why they don't want STOs,\" Thomas said. \"We need to fund one public school system in this state.\"\nChildren's Action Alliance President and CEO Dana Wolfe Naimark shares that critical view of the effects of the tax credit: \"It means leaving public schools to crumble and decay. That is what's happening in Arizona.\"\nREAD MORE:\nVouchers benefiting students in more-affluent areas\nWhy AZ doesn't know where voucher money goes\nDouglas lashes out over report on vouchers\nDucey signs expansion of school-voucher program\nDid lawmakers get punked on school-voucher deal?",
    "label": 3
}