{
    "index": 777,
    "text": "Jonathan Ernst / Reuters\nWhat’s the “Trump Doctrine” of foreign policy? At first glance, foreign policy under Trump seems inconsistent, arbitrary, and devoid of principle.\nA few weeks ago, even before the airstrike on Syria, Trump communications director Mike Dubke told Trump’s assembled aides that international affairs presented a messaging challenge because the Trump administration lacks a coherent foreign policy. “There is no Trump doctrine,” Dubke declared.\nAdvertisement\nI think Dubke is being grossly unfair. Of course there’s a Trump Doctrine. You just have to know where to look for it.\nThe Trump Doctrine began to emerge when Trump issued his travel bans (both the first and second) on predominantly Muslim countries.\nBut he notably excluded predominately Muslim countries where Trump has business interests.\nSo under what might be called the First Principle of the Trump Doctrine, people living in a predominantly Muslim country have a chance of entering the United States only if their country contains an edifice with Trump’s name on it.\nThe Second Principle follows logically from the first. Countries that are potential markets for Trump’s business ― nominally run by his two sons, but still filling his pockets ― may be eligible for special favors if they allow Trump to make money there.\nAdvertisement\nFor example, Trump’s business currently has 157 trademark applications pending in 36 nations, according to the New York Times.\nRegistered trademarks are giant financial assets for a business like Trump’s, which in recent years has made big money by selling his name rather than by building or making anything.\nSoon after he was sworn into office ― but only after Trump backed off of his brief flirtation with a “two China” policy ― the Chinese government granted Trump preliminary approval of 38 trademarks of his name.\n“It was a gift,” said Peter J. Riebling, a trademark lawyer in Washington, of China’s decision. “Getting the exclusive right to use that brand in China against everyone else in the world? It’s like waving a magic wand.”\nOne potential obstacle for the Second Principle is the Constitution’s “emoluments” clause, which bars U.S. government officials from receiving gifts from foreign powers.\nAdvertisement\nNo matter. Apparently the Trump Doctrine, well, trumps the Constitution.\nA group called Citizens for Responsibility and Ethics in Washington (CREW), joined by several prominent law professors, is suing Trump over this.\nBut the United States ― through the U.S. Department of Justice ― argues in a legal brief, expected to be filed this month, that the framers of the Constitution meant only to rule out gifts that compensate presidents or other office holders for services they might do for a foreign power, not for public policies they advance that benefit a foreign power.\nInterpretations of the U.S. Constitution by the Department of Justice aren’t like the musings of any random defense attorney. They carry special weight. They represent the views and interests of the United States.\nWhich makes this one official U.S. government policy ― and thereby, confirms it as the Second Principle of the Trump Doctrine.\nThe Third Principle comes down hard on countries that kill their own children with poison gas. They will be bombed.\nAdvertisement\nYou may recall Trump had long been opposed to bombing Syria. But, as he recently explained, Syrian dictator Basha al-Assad’s “attack on children… had a big impact on me,“ adding that “my attitude toward Syria and Assad has changed very much.” The bombing ensued.\nThis doesn’t mean endangered children will be given refuge in the United States, though. Recall the First Principle: Nobody gains entrance to the United States from a predominantly Muslim nations unless their country contains a Trump hotel, spa, or golf course.\nWhich brings us to the Fourth Principle.\nNot long after the Syrian bombing, Trump authorized the Pentagon to drop a 22,000-pound GBU-43/B Massive Ordnance Air Blast Bomb (MOAB) on people described as “Islamic State forces” in eastern Afghanistan near the Pakistani border.\nIt was the first time the bomb ― nicknamed the “mother of all bombs,” and one of the largest air-dropped munitions in the U.S. military’s inventory ― had ever been used in a combat.\nTrump’s rationale? The group was allegedly connected to ISIS.\nSo under the Fourth Principle of the Trump Doctrine, the United States reserves the right to drop a mother of a bomb on any group seemingly connected with ISIS.\nAdvertisement\nThis applies even if the group is not fighting to gain or hold territory claimed by the Islamic State. The group could be thousands of miles away from the Islamic State, anywhere around the world.\nCould a mother of a bomb be dropped on such a group if it’s located in a country containing a Trump hotel, or considering a Trump trademark application?\nFrankly, I don’t know. That pesky detail hasn’t been worked out yet.\nBut this one uncertainty doesn’t undermine the overall consistency or clarity of the Trump Doctrine of foreign policy. It’s four major principles are firmly rooted either in making money for Trump, or stopping bad people from doing bad things.\nIf Mike Dubke had a clearer grasp of Donald Trump’s worldview, he’d surely see this ― as would everyone else.",
    "label": 3
}