{
    "index": 723,
    "text": "On April 29, a week after Earth Day, Donald Trump will mark his 100th day in office. Mike Segar/Reuters\nPresident Donald Trump gave many signals on the campaign trail that his presidency would be a disaster for the environment. He called global warming a “hoax” and “bullshit,” vowed to dismantle the Environmental Protection Agency, and undo regulations to revive the fossil fuel industry.\nAlmost 100 days into Trump’s tenure, the fears of environmentalists, scientists, public health advocates have been confirmed — and then some.\nBefore he’d even been sworn in, Trump nominated several climate deniers chummy with the fossil fuel industry to his cabinet, including former Texas Gov. Rick Perry as the head of the Department of Energy and Oklahoma Attorney General Scott Pruitt to head the Environmental Protection Agency ― a man who had sued the agency 14 times over industry regulations. Pruitt recently claimed, in contradiction to overwhelming scientific consensus, that human activity ― i.e. the burning of fossil fuels ― is not definitively the primary contributor to climate change.\nOn the day Trump took office, a page devoted to climate change action on the White House website disappeared. Four days later, Trump signed executive orders reviving the controversial Keystone XL and Dakota Access pipelines, a move that set the tone for a series of swift and sweeping changes to the nation’s climate and environmental policies that were soon to follow.\nDismantling environmental protections is one area where Trump has made quick work. “Donald Trump’s foreign policy and legislative agenda may be a confused mess,” wrote the Los Angeles Times’ David Horsey earlier this month. “But his administration’s attack on the environment is operating with the focus and zeal of the Spanish Inquisition.”\nHere’s an abbreviated timeline of some of the major environmental actions Trump has taken in his first 100 days.\nTrump signed H.J. Res. 38, which repealed the Stream Protection Rule, in the Roosevelt Room of the White House on Feb. 16, 2017. Getty Images\nFeb. 16, 2017: Stream Protection Rule nixed\nTrump signed legislation repealing the Stream Protection Rule, an Obama-era regulation that sought to protect U.S. waterways from coal mining operations. The rule required coal mining companies to avoid practices “that permanently pollute streams, destroy drinking water sources, increase flood risk and threaten forests.” The regulation mandated the testing and monitoring of waterways before, during and after mining operations, and required companies that had used controversial practices like mountaintop removal mining to restore land to its “previous condition” once mining is complete.\nEnvironmentalists and public health advocates lambasted the rule’s repeal. “Limiting the toxic waste coal companies can dump in our rivers and streams is not a burdensome government regulation; it is common sense and, quite frankly, the job of our federal government,” said Deborah Murray, a senior attorney with the Southern Environmental Law Center, in a statement.\nFeb. 28, 2017: Clean Water Rule threatened\nThe president signed an executive order aimed at dismantling the Waters of the United States rule, also known as WOTUS or the Clean Water Rule. Trump instructed the EPA and the Army Corps of Engineers to reconsider the environmental rule that designated which of the nation’s waterways should be protected under the federal Clean Water Act. The rule extended protection to 2 million miles of streams and 20 million acres of wetlands that hadn’t been clearly covered under the original law. A repeal of the rule could threaten the drinking water of 117 million Americans and the health of many species, including endangered birds and marine life. Food safety and industries from farming to recreation could also be at stake if the rule is thrown out.\nMarch 2, 2017: Methane emissions info scrapped\nThe EPA threw out a regulation requiring oil and gas companies to provide more detailed information about their drilling facilities, including reporting on what equipment they use and how much methane, a potent greenhouse gas, is emitted. “Today’s action will reduce burdens on businesses while we take a closer look at the need for additional information from this industry,” Pruitt, the EPA administrator, said. The methane rule was seen as a critical component of the U.S. plan to slash emissions as part of the Paris climate agreement.\nPruitt has come under scrutiny for his close ties to the fossil fuel industry — connections that were clearly documented in a cache of emails released days after Pruitt’s confirmation as head of the EPA.\nEPA administrator holds up a miner's helmet that he was given after speaking with coal miners at the Harvey Mine on April 13, 2017 in Sycamore, Pennsylvania. Justin Merriman/Getty Images\nMarch 7, 2017: “Science” vanishes from view\nAs first reported by The New Republic, the EPA’s Office of Science and Technology removed the word “science” from its mission statement.\nMarch 15, 2017: Car pollution standards rolled back\nAs automakers pushed the Trump administration to lift regulations on their industry, Pruitt announced that the EPA would reconsider Obama-era fuel-efficiency standards for some vehicles.\nObama had introduced rules aimed at limiting greenhouse gas emissions from passenger vehicles, in a bid to reduce the carbon footprint of the U.S. transportation sector, which accounts for one-third of the country’s CO2 emissions. Based on those rules, carmakers would be required to have an average fuel-economy rating of 54.5 miles per gallon across its entire fleet sold in the U.S. by 2025 (or about 36 miles per gallon in real-world driving). According to an EPA report released in the last days of Obama’s tenure, this new standard would reduce greenhouse gas emissions by an estimated 6 billion metric tons over the lifetime of the new vehicles.\nTrump, however, has signaled that he wants to roll back these regulations as much as possible. As Vox explained, Obama’s fuel economy targets are more or less locked in through 2021, but the door remains open for changes between 2022 and 2025.\nPruitt said his agency would be taking a “fresh look” at the 2022-2025 standards. These rules are “costly for automakers and the American people,” he said.\nMarch 16, 2017: Proposed budget would slash EPA funds\nThe White House released its preliminary “skinny budget,” which proposed deep and sweeping cuts to several science and environmental agencies, including the EPA and the National Oceanic and Atmospheric Administration. The budget proposed a 30 percent reduction in EPA funding — a cut that could see hundreds of people involved in climate change change research losing their jobs and the elimination of more than 50 EPA programs.\nThe budget would also slash Energy Star, the voluntary initiative that boosts energy efficiency in appliances, electronics and buildings. Grants for ozone pollution cleanup efforts and international climate programs like the United Nations’ Green Climate Fund, would cease, as would some funding for the cleanup of several of America’s most important water bodies, including the Great Lakes, the largest surface freshwater ecosystem in the Western Hemisphere, and the Chesapeake Bay, the nation’s largest natural estuary.\nThe budget also proposes halving the funding for enforcing the Clean Air Act, which aims at reducing air pollution, and removing funding completely for the Clean Power Plan (more on that below).\nDelegates from West Virginia hold signs supporting coal on the second day of the Republican National Convention in Cleveland, Ohio, July 19, 2016. Aaron Bernstein/Reuters\nMarch 28, 2017: Trump takes aim at Obama’s climate plan\nTrump signed the “Energy Independence Executive Order,” a directive that weakens many Obama-era climate and clean energy initiatives. First, the order called for a review of the Clean Power Plan, Obama’s signature program to fight global warming and one that was central to America’s plan to reach the goals laid out in the Paris climate agreement. The plan aimed to reduce carbon emissions from existing power plants by 32 percent below 2005 levels by 2030.\nThe executive order also reversed Obama’s moratorium on new coal mining leases on federal lands, and instructed the Department of Interior (led by former Montana congressman and climate skeptic, Ryan Zinke) to begin reviewing several regulations for oil and gas extraction on federal lands, including national parks.\nThe directive made clear that the Trump administration would be abandoning Obama’s climate roadmap. “We have a different view about how you should address climate policy in the U.S., and we’re going in a different direction,” a senior White House official told reporters the day before the executive order was signed.\n“I can’t get into ultimately what that means from an emissions standpoint,” the official added. “I have no idea.”\nSurrounded by miners from Rosebud Mining, Trump signs the Energy Independence Executive Order at EPA Headquarters in Washington, DC, March 28, 2017. JIM WATSON/Getty Images\nApril 18, 2017: Pollution cleanup at power plants faces challenge\nThe EPA asked a federal appeals court to delay arguments over a rule that prevents coal-fired power plants from releasing toxic chemicals, including mercury, lead, arsenic and other pollutants, into the environment. In its court filing, the agency said it wants to first review the regulation as “prior positions taken by the Agency … may not necessarily reflect its ultimate conclusions after that review is complete.”\nThe filing came days after Pruitt announced his intention to postpone compliance deadlines for the Mercury and Air Toxics Standard (MATS) rule, which was finalized in 2011 and is currently in effect. “I have decided that it is appropriate and in the public interest to reconsider the rule,” Pruitt wrote in an April 12 letter.\nThe MATS rule has been tied up in the court system for years. Shortly after the regulation was finalized, a coalition of industry groups and conservative states ― including Oklahoma, which Pruitt then represented ― sued the EPA to stop it. In 2016, Pruitt sued a second time to block the regulation.\nThe D.C. Circuit Court of Appeals was expected to hear oral arguments on May 18 to determine whether the rule should be upheld, after a 5-4 Supreme Court decision led by Justice Antonin Scalia found the EPA had not adequately considered the regulation’s cost.\nThis is an argument Pruitt has repeatedly touted, claiming that the MATS rule would put an undue financial burden on the energy industry. However, as the Associated Press notes, most power plants nationwide are already on track to comply with the new standards. According to the Environmental Defense Fund, companies have been able to accomplish this at a fraction of the expected cost.\nThe rule is expected to have a tremendous impact on public health. An earlier EPA analysis concluded that the regulation would prevent up to 11,000 premature deaths, 4,700 heart attacks, and 130,000 asthma attacks every year.\nActivists rallied in support of the EPA outside of Senate Minority Leader Chuck Schumer's (D-NY) Midtown Manhattan office, April 4, 2017 in New York City. Drew Angerer/Getty Images\n‘100 days of harm’\nApril 29, 2017 — exactly 7 days after Earth Day — will be President Trump’s 100th day in office.\nRhea Suh, the president of the National Resources Defense Council, called the past three months “100 Days of Harm.”\n“Like any arbitrary benchmark, the 100-day point of a new president’s term normally tells us only so much about what’s to come. In the case of President Trump’s all-out assault on our environment and health, however, we’ve already seen more than enough,” wrote Suh in a recent column. “Trump has acted again and again to undo half a century of bipartisan progress in protecting our rights to clean water, air, and lands. He’s moved to part ways with longstanding American values of conservation in the public interest. And he’s betrayed the covenant we’ve forged with our children to leave them a livable world.”\nMore than 60 percent of Americans said they disapproved of how Trump is handling the environment in an April Quinnipiac University poll. Fifty-two percent of respondents said they “are embarrassed to have Trump as president.”\nActivists have said it’s not too late to stop Trump’s anti-climate and anti-environment agenda. While his executive orders have garnered a lot of hype, a majority of them have not yet had a substantive impact on actual policy.\nConcerned citizens just have to be swift, and smart, in combating these threats, advocates say.\n“We can’t afford to focus all of our energy on reacting to the parade of bad ideas and morally bankrupt policies that are pouring out of Washington,” wrote Sierra Club’s Executive Director Michael Brune in an op-ed last month. “We must also push back with better ideas and smarter policies for the world that we want to create.”\nClick through the slideshow below to learn more about what YOU can do right now to stop President Trump’s dangerous climate agenda:\nWhat You Can Do Right Now To Stop Donald Trump's Dangerous Climate Agenda See Gallery\nAdvertisement",
    "label": 3
}