{
    "index": 361,
    "text": "A Palmdale city councilman asked Mayor Jim Ledford to take a leave of absence after the Los Angeles district attorney’s office served search warrants at the mayor’s City Hall office and home this week.\nCity Councilman Austin Bishop said that several steps need to be taken to maintain the city’s integrity in light of the investigation into Ledford, who has come under fire, in part, because of a consulting job for which he was paid roughly $180,000 from 2010 to 2013.\n“We ask Mayor Ledford, in light of both his years of service, and the seriousness of this investigation, to take a voluntary leave of absence from all duties of the Office of Mayor until this investigation is complete,” Bishop said in a statement released Friday. “This will show ours and his commitment to put our residents first, and allow him to resume his duties should he be exonerated.”\nThe district attorney’s office served search warrants at Ledford’s City Hall office and home on Wednesday, according to Ledford’s former campaign manager and a city spokesman. Prosecutors served warrants at four additional locations, according to a spokeswoman for the district attorney’s office, who declined to disclose those locations or to comment on the nature of the investigation.\nBishop, 29, said he became aware that warrants were being served Wednesday morning when the acting city manager called him. He last spoke with Ledford on Tuesday evening at the end of a City Council meeting. The mayor has kept a low profile since the warrants were executed, according to Bishop, who said Ledford did not appear at a scheduled meeting Wednesday.\nAdvertisement\n“I’m not sure where Ledford is,” he said.\nBishop said that it is his understanding that any elected official who is under investigation cannot take part in City Council votes.\n“We want everything to go back to normal in a sense,” Bishop said while standing in the Antelope Valley Fairgrounds. “We want the D.A. to get to the bottom of this, and once everything is sorted out we can go from there.”\nLedford, 63, has served as Palmdale’s mayor since 1992 and coasted to reelection in 2016.\nThe city does not have term limits. Calls and emails to Ledford seeking comment have not been returned since Thursday morning. A city spokesman declined to comment on Bishop’s call for Ledford to take a leave of absence.\nA law enforcement official told The Times on Thursday that prosecutors are looking into a “quid pro quo” relationship involving Ledford but declined to elaborate. The official requested anonymity because they were not authorized to discuss the case.\nPart of the investigation involves a job Ledford took with a Complex Culture Change Consulting in Palmdale, which paid him nearly $180,000 between 2010 and 2013, according to court transcripts and the mayor’s former campaign manager, Kamal Al-Khatib.\nDuring a 2013 deposition in an unrelated lawsuit against the city, Ledford said he researched educational conferences for the firm but struggled to explain or provide evidence of any actual work he produced, court records show.\nLancaster Mayor R. Rex Parris, a fierce opponent of Ledford who was serving as an attorney for the plaintiffs in that case, has said Ledford essentially took a no-show job from people who benefited from City Council decisions.\nThe head of the consulting firm that hired Ledford, Susan Miller, was also the executive director of the Aero Institute in Palmdale, which leased a rent-free building from the city during the time Ledford was employed by the firm, according to the 2013 deposition.\nThe Aero Institute was also one of the locations where a warrant was served on Wednesday, according to a city spokesman. An employee who answered the phone at the Aero Institute hung up when contacted by a Times reporter on Thursday.\nA complaint about Ledford’s consulting job and relationship with the Aero Institute and Miller was also filed with the California Fair Political Practices Commission in 2013, records show.\nCity Hall and the Aero Institute were closed Friday. No one answered the door at the home of the institute’s president, Kimberly A. Shaw.\nNo one answered the door at Ledford’s home. One of his neighbors looked down from her second-floor balcony. She declined to give her name and shrugged her shoulders when asked when she last saw the mayor.\n“He’s my friend. I support him,” she said.\nBertha Terry, who lives a couple of doors down from the mayor’s home, said she saw a swarm of police appear at Ledford’s door Wednesday morning about 7:30 a.m.\n“I was like ‘What happened?’” she said. “I thought one of the neighbors had died or something.”\nPatricia Salazar, who cleans homes and works as an organizer for an immigrant rights organization, said she didn’t know the mayor lived on her block until this week.\nShe said she likes Ledford because of his work on behalf of immigrants in the U.S. illegally, and knocked on doors in support of his last mayoral bid in 2016.\nNoting that the investigation may “center around Ledford’s relationship with certain city contractors,” Bishop said the city should consider suspending financial relationships with any businesses involved in the district attorney’s review.\nOn Thursday, Miller declined to explain the consulting firm’s purpose or describe what Ledford did during his time employed there. The firm was shut down in 2013, and Miller said she spoke with the district attorney’s office four years ago but declined to offer specifics.\nAl-Khatib, his former campaign manager, has insisted the investigation is a politically motivated witch hunt driven by Parris and other Ledford enemies. Bishop downplayed such speculation Friday.\n“I think people like to run wild with stories, but I don’t really believe our district attorney would go put all this on the city unless they have sufficient evidence,” he said. “I don’t think anyone tells the D.A. what to do.”\nLos Angeles Times Staff Writer Richard Winton contributed to this report.\nbenjamin.oreskes@latimes.com\njames.queally@latimes.com\nFollow @boreskes and @JamesQueallyLAT for breaking news.\nUPDATES:\n3:30 p.m.: This article was updated with additional comments from neighbors of Mayor Jim Ledford.\n1:05 p.m.: This article was updated with additional comments from Bishop.\nThis article was originally published at 12:35 p.m.",
    "label": 3
}