{
    "index": 448,
    "text": "In tour of major religions, Trump will visit Saudi Arabia, Israel and Vatican on first foreign trip\nWASHINGTON — President Trump will add visits to Saudi Arabia, Israel and Rome to his pre-planned trip to Europe later this month, the White House said Thursday, making his first foreign trip as president a tour of three great world religions.\nTrump made the announcement after meeting with Roman Catholic cardinals in the Oval Office Thursday, and during an event to mark the National Day of Prayer with an executive order on what he called \"religious freedom.\"\n\"Tolerance is the cornerstone of peace and that's why I'm proud to make a major and historic announcement this morning and to share with you that my first foreign trip as President of the United States will be to Saudi Arabia, then Israel, and then to a place that my cardinals love very much, Rome.\"\nBut the White House clearly intends to send a signal by making his first visit to Saudi Arabia, home of the holiest sites in Islam, after controversial policies to suspend travel to the United States from six countries in the region in what critics called a \"Muslim ban.\"\nThere, Trump is expected to meet with leaders of the six countries in the Gulf Cooperation Council: Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, and the United Arab Emirates.\n\"It is there that we will begin to construct a new foundation of cooperation and support with our Muslim allies to combat extremism, terrorism and violence, and to embrace a more just and hopeful future for young Muslims in their countries,\" Trump said. \"Our task is not to dictate to others how to live, but to build a coalition of friends and partners who share the goal of fighting terrorism and bringing safety, opportunity and stability to the war- ravaged Middle East.\"\nThe three-country tour comes before long-scheduled stops in Brussels for the NATO summit on May 25, and in Sicily for the gathering of major economic powers known as the Group of Seven, or G7, on May 27.\nThe White House did not immediately announce dates and cities for the early legs of the trip, but the Vatican said Pope Francis would welcome Trump at the Apostolic Palace the morning May 24, followed by meetings with top Vatican diplomats.\nDuring the presidential election last year, Trump and Pope Francis clashed over immigration and Trump's proposed border wall, but both have said they are looking forward to their meeting.\nThe Israel announcement came one day after Trump met at the White House with Palestinian Authority Mahmoud Abbas, part of an effort to somehow revive peace talks between the Palestinians and the Israelis. Trump has promised to move the U.S. embassy in Israel from Tel Aviv to Jerusalem.\nA 1995 law requires that move, but every president since has waived it in the interests of national security. Trump must sign a new waiver by June 1 or move the embassy.",
    "label": 3
}