{
    "index": 416,
    "text": "OnPolitics Today: Republicans are trying to decrease overtime pay\nMore than half of Americans work hourly jobs. And if you work one for a private-sector company, know this: Republicans want to let employers skip time-and-a-half pay and offer you paid time off, instead.\nThe GOP-majority House voted Tuesday to pass a bill that would alter the Fair Labor Standards Act, which currently makes companies pay time-and-a-half to workers who put in more than 40 hours in a week.\nCompanies have lobbied for such a shift for years, claiming it would give them more flexibility and that some workers actually want less pay in exchange for time off. Critics, like Sen. Elizabeth Warren, call it a way \"for employers to cheat workers out of overtime.\" It goes now to the Senate.\nAlso on Wednesday: Comey said he's sickened over thoughts around his Clinton email probe, the Obamacare repeal edged closer to a reality, and Trump said he'll fix that whole Israel-Palestine thing, which, unlike health care, is apparently not complicated.\nIt's OnPolitics Today: USA TODAY's daily politics roundup. Subscribe here.\nComey to Senate panel: I regret nothing\nDems press Comey on Clinton, Trump probes FBI Director James Comey is maintaining that he did not treat disclosures about investigations into Hillary Clinton's emails and potential connections between the Trump campaign and Russia differently. (May 3) AP\nJames Comey, the FBI director who materializes every few months before a Senate panel, did so again Wednesday to defend his decision to publicly declare his probe into Hillary Clinton's email servers last fall. That disclosure came 11 days before the November election, and many Democrats — including Clinton herself — claim it tilted the contest in then-candidate Donald Trump's favor.\n\"It makes me feel mildly nauseous that we might have had some impact on the election,\" Comey said. \"But honestly, it wouldn't change the decision.\"\nKeeping quiet, Comey said, would have meant the \"death of the FBI as an institution in America.\" He also said he's confident that Russia hacked the DNC, and remains involved in American politics: Russia is \"the greatest threat to any nation on earth, given their intention and their ability,\" Comey said.\nHealth care repeal: House vote on tweaked bill planned for Thursday\nHouse Republicans said they'll vote Thursday on the latest bill aimed at repealing and replacing Obamacare. Amid an inner-party tug-of-war over the bill, GOP leaders announced an $8 billion amendment meant to woo still-wary moderates. The money would go to help those with pre-existing conditions pay for higher costs they look to face under the GOP's proposed law.\nThe new change was enough for at least two House Republicans, Fred Upton of Michigan and Billy Long of Missouri, to switch their votes. GOP leaders can only afford to lose about 22 Republican votes for the bill to still pass. Multiple counts had the number of GOP holdouts at about 20 on Tuesday.\nGodspeed: Trump says he's the guy who will bring peace to Israeli-Palestinian conflict\nTrump welcomes Abbas to White House, hopes for peace deal President Donald Trump welcomed Palestinian leader Mahmoud Abbas to the White House Wednesday, hoping to make strides toward promoting peace with Israel. (May 3) AP\n\"We want to create peace between Israel and the Palestinians,\" Trump said during meetings at the White House on Wednesday with Mahmoud Abbas, the president of the Palestinian Authority. \"We will get it done. We will be working so hard to get it done.\"\nTrump would be the first person to both accomplish such a peace agreement as president and to star in an '80s sex comedy called “Ghosts Can’t Do It.\"\nElsewhere in politics",
    "label": 2
}