{
    "index": 291,
    "text": "The Kushner family hopes to lure investments from wealthy business owners in China with the promise of American visas.\nNicole Kushner Meyer, the sister of White House adviser and President Trump's son-in-law Jared Kushner, spoke at an event in Beijing on Saturday. She was marketing a Kushner-owned property in New Jersey -- invest in the development and get into the United States on a so-called EB-5 visa.\nThe EB-5 visa allows immigrants a path to a green card if they invest more than $500,000 in a project that creates jobs in the United States.\nAn ad for the event, held at a Ritz-Carlton hotel, said \"Invest $500,000 and immigrate to the United States.\"\nRelated: President Trump, off to New Jersey, can't stop advertising his own brand\nThe EB-5 visa has been used by the Trump and Kushner family businesses. Foreigners, particularly wealthy Chinese nationals, have used the EB-5 program as a ticket into the states. And that promise has helped attract foreign investments for U.S. real estate projects.\nPresident Trump has taken an anti-immigration stance and vowed to severely tighten the use of work visas. The EB-5 program has come under fire by members of Congress on both sides of the aisle.\nLawmakers say the program essentially sells citizenship to high-income foreigners.\nOn Saturday, potential investors in the Kushner project were told they should act quickly because possible policy changes to the EB-5 program might raise the required minimum investment.\nNicole Kushner Meyer also told the crowd how her grandfather immigrated to the United States and built a business from the ground up.\nAnd she mentioned Jared's new position in the White House. Though she did not reference President Trump by name, his photo appeared on a slide that listed the \"key decision makers\" on the EB-5 program.\nRelated: The two biggest ways the Trump family could benefit from his tax plan\n\"In 2008, my brother Jared Kushner joined the family company as CEO, and recently moved to Washington to join the administration,\" she said.\nJared Kushner serves as an influential senior adviser to the president. Trump has at various times said he would lead or play a key role in many policy areas from foreign affairs to business innovation.\nThe event was meant to draw investors for 1 Journal Square, a $976.4 million residential and commercial project underway in New Jersey. The company says about 15% of it will be funded through the EB-5 program.\nJared Kushner has stepped away from the business since taking a key role in Trump's White House.\nHis attorney, Blake Roberts, said Kushner is not involved in the operation of Kushner Companies and divested his interests in the Journal Square project by selling them to a family trust that he, his wife and his children are not beneficiaries of, which was suggested by the Office of Government Ethics.\n\"As previously stated, he will recuse from particular matters concerning the EB-5 visa program,\" Roberts said in a statement.\nThe Beijing event, which was organized by Chinese immigration agency Qiaowai, was open to the public. Reporters from the Washington Post and the New York Times attended but said they were later asked to leave.\nKushner Companies declined to comment. Qiaowai could not be immediately reached for comment.\n--CNNMoney's Jethro Mullen contributed to this report.",
    "label": 3
}